{
  "title": "CBS News",
  "link": "https://www.cbsnews.com/",
  "description": "Latest news from CBS News",
  "items": [
    {
      "title": "Texas teen killed his twin sister in mystery stabbing",
      "link": "https://www.cbsnews.com/news/benjamin-meghan-elliott-texas-twin-stabbing-death-mystery-48-hours/",
      "source": "CBS News",
      "pub_time": "2025-09-28T02:30:10-04:00",
      "description": "Benjamin Elliott says he was sleepwalking when he stabbed his twin sister, Meghan. He insists he would never hurt her. Texas prosecutors disagreed even though they found no motive.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>In the early morning hours of Sept. 29, 2021, <span class=\"link\">Benjamin Elliott</span>, then 17 years old, walked into his twin sister Meghan's bedroom. It was something he had done hundreds of times. But on this morning, he had a knife in his hand and stabbed her in the neck while she was asleep. He would later say he was sleepwalking. When he realized what he had done, he immediately called 911.</p><p>\"I just killed my sister,\" Benjamin told the emergency operator. \"Oh my God … I thought it was a dream.\"</p><p>Benjamin's parents Kathy and Michael Elliott faced a heartbreaking and unimaginable reality: their beloved daughter, Meghan, was dead, and her adoring twin brother — their son — was accused of intentionally murdering her. They could not imagine why, and neither could investigators. Correspondent Erin Moriarty investigates the extraordinary case of \"The Boy Who Killed His Twin,\" for the 38th season premiere of \"48 Hours,\" now streaming on Paramount+.</p><p>\"What makes you so sure that you stabbed your sister while you were sleepwalking?\" Moriarty asked Benjamin Elliott in a jailhouse interview earlier this year.</p><p>\"I would never have done that,\" he replied. \"I loved her. … She was my best and closest friend.\"</p>\n<p>Benjamin's family, relatives and closest friends agreed. \"He and Meghan are so close, you could never picture anything bad happening between them,\" Drue Whittecar, a longtime family friend of the Elliotts, told Moriarty.</p>\n\n<p>\"And how did she feel about Ben?\" Moriarty asked.</p><p>\"She loved him,\" Whittecar replied. \"She looked up to him. … You would see her walk up next to him when she would feel uncomfortable and just kinda stand by him.\"</p><p>Moriarty also interviewed the prosecutors, Megan Long and Maroun Koutani.</p><p>\"Were you able to find any evidence that there was a problem with … these twins?\" Moriarty asked. \"No,\" Long replied. \"We definitely looked into it and tried.\" </p>\n\n<p>So how could such a seemingly loving relationship between the twins end in an unfathomable tragedy? </p><p>That's what Benjamin's parents — Kathy, a senior manager with the Girl Scouts of America, and Michael, a stay-at-home dad — and their eldest daughter, Elizabeth, wanted to know.</p><p>The Elliotts initially feared that a mental health crisis was the cause. But it turned out that Benjamin, and some close relatives of the Elliotts, had a history of sleepwalking. In fact, a boyhood friend of the Elliott twins told their parents about a slumber party years earlier, when they found Benjamin eating a donut on a couch — while he was asleep.</p><p>Benjamin's defense attorneys, Cary Hart and Wes Rucker, asked Dr. Jerald Simmons, a neurologist and sleep disorder expert, to examine Benjamin. Simmons was initially skeptical. But after interviewing Benjamin, and hearing about his and his family's history of sleepwalking, Simmons conducted two sleep studies on him, with the teenager hooked up to devices that monitored his every movement. Simmons went from skeptic to believer. </p><p>He determined that Benjamin fell quickly into what is known as slow-wave sleep, or when people can sleepwalk. That's important because on the night Meghan was killed, Benjamin spent hours scrolling the web on his cell phone, except for a 24-minute period when his phone was inactive. Simmons believes that Benjamin was sleepwalking during that period, and unintentionally stabbed Meghan to death.      </p><p>\"Do you believe Ben killed his sister without even realizing he was doing it in his sleep?\" Moriarty asked Simmons. </p><p>\"Yes,\" he replied. \"Ben definitely killed his sister. He did it, there's no question, he's the one that had the knife and he stabbed her. But … he didn't do this voluntarily. There was no motivation.\"</p>\n\n<p>Surprisingly, sleepwalking has proved to be a successful — albeit rare — criminal defense. For example, a Canadian man, Kenneth Parks, was accused of driving 14 miles to his mother-in-law's home, where he killed her. He claimed he was sleepwalking the entire time and was acquitted. And North Carolina father Joseph Mitchell, accused of strangling one of his children, said he was sleepwalking during the killing. He was also found not guilty.</p><p>The Elliotts were relieved, and frightened, at finally having an explanation. \"It's scary as hell,\" Kathy Elliott said, adding, \"if that can happen to us, then that could happen to anybody with a sleep problem.\" </p><p>They hoped Simmons' findings would end the investigation into Benjamin. After all, prosecutors admitted they could find no reason for the fatal stabbing. </p><p>But prosecutors were still not convinced. They questioned Benjamin's account of that night, his demeanor during an interrogation with a homicide detective and that he said he stabbed his sister once. That was important because the medical examiner determined Meghan had two wounds to her neck — and one was four inches deep and severed key arteries, which prosecutors believed should have left blood spatter at the scene.</p><p>Despite receiving Simmons' findings, prosecutors charged Benjamin with intentionally murdering his twin, and earlier this year, Benjamin stood trial. </p><p>The Elliotts had lost their daughter. No one knew why. Now, they faced losing their son. </p>\n</section>\n</div></body></html>"
    },
    {
      "title": "Trump moves to declassify Amelia Earhart records",
      "link": "https://www.cbsnews.com/news/trump-declassify-amelia-earhart-records/",
      "source": "CBS News",
      "pub_time": "2025-09-27T14:50:00-04:00",
      "description": "President Trump told his administration on Friday to declassify any federal records about Amelia Earhart, the pilot whose 1937 disappearance over the Pacific Ocean has drawn decades of public fascination.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>President Trump told his administration on Friday to declassify any federal records <span class=\"link\">about Amelia Earhart</span>, the pilot whose 1937 disappearance over the Pacific Ocean has drawn decades of public fascination.</p><p>\"Amelia made it almost three quarters around the World before she suddenly, and without notice, vanished, never to be seen again,\" the president wrote on Truth Social. \"Her disappearance, almost 90 years ago, has captivated millions.\"</p><p>Earhart and navigator Fred Noonan disappeared as they flew toward Howland Island in the Pacific, part of her attempt to become the first female aviator to circumnavigate the world. </p><p>It's widely believed that Earhart crashed into the ocean near Howland Island after running out of fuel, says Laurie Gwen Shapiro, a journalist who wrote a book on Earhart. But other theories about where she and her plane ended up have circulated for decades — many of which lack clear evidence. Researchers are <span class=\"link\">planning an expedition</span> to a remote island later this year.</p>\n<p>It's not clear what, if any, classified documents the government may have on Earhart.  </p>\n\n<p>But a lawmaker who represents the Northern Mariana Islands territory in the U.S. House pushed Mr. Trump to declassify and release Earhart records earlier this year, referring to \"credible, firsthand accounts\" that the aviator was spotted on the Pacific island of Saipan.</p><p>\"Despite these recollections, her disappearance and the possibility that she may have died on our islands remain matters of unresolved historical inquiry,\" Del. Kimberlyn King-Hinds, a Republican, wrote in a July letter to the president.</p><p>One of the theories is that Earhart was on a spy mission for the U.S. government when she landed in Saipan and was taken into custody by the Japanese. </p><p>Documents previously released by the FBI contain a 1967 request for a security review of a manuscript that cites Navy files on Earhart that were marked \"confidential,\" a level of classification. The manuscript's author, a senior officer in the Air Force, wrote that the conclusions in the Navy report were that Earhart was not on a spy mission, did not crash-land in Saipan, and was not held as a prisoner or executed as a spy. </p>\n\n<p>The FBI, in approving that manuscript for publication — which is a typical process for current and former government officials — noted that the Navy files did \"not warrant classification since the release of it would not be prejudicial to the national defense.\" </p><p>Shapiro called the theory that Earhart was taken captive in Saipan \"nonsense.\"</p><p>\"It's 99.9% that she ran out of gas,\" Shapiro told CBS News. She said Earhart and Noonan were low on fuel and \"very ill-prepared\" for their attempted flight to Howland Island, a tiny, difficult-to-find island in the middle of the ocean.</p><p>\"It's very boring to tell people, you know what, she ran out of gas,\" Shapiro said. \"The fantasy around it is amazing.\"</p><p>The National Archives and Records Administration has also previously released documents on the search for Earhart.  </p><p>In 1993, two Hawaiian lawmakers introduced bills in the House and Senate to require the government to release all records relating to Earhart's last flight and disappearance. The bills called for the declassification of \"any such relevant records that have been classified as government secrets.\" The measures never made it out of the committees they were referred to. </p><p>Mr. Trump's push to declassify Earhart records follows his decision <span class=\"link\">to release records</span> on the 1960s-era assassinations of Martin Luther King Jr., <span class=\"link\">John F. Kennedy</span> and <span class=\"link\">Robert F. Kennedy</span>. His administration is also under pressure to release records on the late sex offender Jeffrey Epstein.</p>\n\n</section>\n</div></body></html>"
    }
  ]
}