{
  "title": "CBS News",
  "link": "https://www.cbsnews.com/",
  "description": "Latest news from CBS News",
  "items": [
    {
      "title": "U.S. fighter jets scrambled to intercept Russian warplanes near Alaska",
      "link": "https://www.cbsnews.com/news/russia-planes-alaska-us-fighter-jets-intercept-bomber-fighter-jets-adiz/",
      "source": "CBS News",
      "pub_time": "2025-09-25T05:11:22-04:00",
      "description": "The U.S. sent fighter jets, yet again, to identify and intercept Russian military aircraft in the Alaskan Air Defense Identification Zone.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>U.S. fighter jets were scrambled Wednesday to identify and intercept four Russian warplanes flying near Alaska, the North American Aerospace Defense Command said in a statement. </p><p>NORAD said two Russian Tu-95 long-range strategic bombers and two Su-35 fighter jets were flying in the Alaskan Air Defense Identification Zone (ADIZ), which is international airspace that abuts U.S. and Canadian sovereign airspace.</p><p>NORAD responded Wednesday by sending an E-3 early warning and control aircraft, along with four F-16s and four KC-135 tanker planes, \"to positively identify and intercept\" the Russian aircraft in the Alaskan ADIZ.</p>\n<p>NORAD said Russian military activity in the ADIZ is common and not considered a threat, but it was the latest in a series of flights by Russian aircraft seen by many as testing the preparedness of U.S. and allied NATO nations. It came as officials in Denmark continued investigating <span class=\"link\">still-unattributed, large drones that flew close to Copenhagen Airport</span> on Tuesday and Wednesday, disrupting traffic.</p><p>Danish police have said the drones were operated by a \"capable actor.\" </p><p>European nations have been on alert amid <span class=\"link\">Russia's ongoing invasion of Ukraine</span>. Russian drones were <span class=\"link\">shot down by Polish and allied NATO warplanes</span> after crossing into Polish airspace on Sept. 9. Ten days later, Estonia said several Russian fighter jets entered its airspace.</p>\n\n<p>The Russian planes entered the Alaskan Air Defense Identification Zone on Wednesday about one month after a <span class=\"link\">very similar incident</span>, which also saw the U.S. scramble fighter jets for an interception.</p><p>In late August, NORAD said it had detected and surveilled a Russian military reconnaissance aircraft inside the ADIZ after intercepting the same type of spy plane over the region three times in the preceding days.</p><p>In September 2024, <span class=\"link\">NORAD posted dramatic video</span> of a Russian jet flying \"within just a few feet\" of NORAD aircraft off the coast of Alaska. At the time, a U.S. general said the conduct of the jet's crew was \"unsafe, unprofessional, and endangered all.\"</p><p>The ADIZ is \"a defined stretch of international airspace that requires the ready identification of all aircraft in the interest of national security,\" NORAD said.</p>\n\n<p>None of the situations thus far has resulted in Russian warplanes entering U.S. or Canadian sovereign airspace.</p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Huge sinkhole swallows part of a road in Thailand's capital",
      "link": "https://www.cbsnews.com/news/bangkok-sinkhole-thailand-road-evacuations/",
      "source": "CBS News",
      "pub_time": "2025-09-25T03:55:30-04:00",
      "description": "A huge sinkhole, likely caused by underground construction in Bangkok, Thailand, swallowed part of a road and took at least one vehicle - and almost a police station - with it.",
      "image_url": "",
      "content": "<html><body><div><article class=\"content content-article lazyload\" data-index=\"0\" data-path=\"/news/bangkok-sinkhole-thailand-road-evacuations/\" id=\"article-0\">\n\n\n<section class=\"content__body\">\n<p><em>Bangkok —</em> A massive sinkhole swallowed part of a major road in Bangkok on Wednesday, disrupting traffic, damaging infrastructure and prompting evacuations in the surrounding area. </p><p>There were no casualties, but three vehicles were damaged by the collapse, regional Governor Chadchart Sittipunt said, adding that officials believe the sinkhole was caused by construction work at an underground train station.</p><p>Videos of the collapse show a section of the road slowly sinking, pulling down several electricity poles and damaging water pipes. Cars tried to back away as the hole grew larger and completely severed the four-lane road. One edge of the hole stopped in front of a police station, exposing its underground structure.</p>\n<p>People were evacuated from the police station and other buildings. A nearby hospital said it would close the outpatient services for two days, although Bangkok city officials said the hospital's structure was not affected.</p><p>Officials cut electricity and water in the area as a precaution. Chadchart said crews were working to fix the hole as quickly as possible, fearing heavy rain could cause further damage. Bangkok is experiencing its rainy season, which typically extends from May through October.</p><p>Emergency workers used a crane with a large harness to remove a pickup truck that was left perched precariously on the edge of the precipice, and at least one other truck could be seen inside the roughly 160-foot-deep hole.</p>\n<p>Noppadech Pitpeng, a 27-year-old hospital worker who lives nearby, told the French news agency AFP that he was frightened by a rumbling sound Wednesday morning, which woke him up.</p>\n\n<p>\"The sound was like an electricity pole collapsing and my whole flat shook,\" he told AFP as he left his building, carrying some clothes in a bucket.</p>\n</section>\n</article>\n</div></body></html>"
    },
    {
      "title": "White House tells agencies to prepare for layoffs if government shuts down",
      "link": "https://www.cbsnews.com/news/white-house-trump-layoffs-omb-government-shutdown/",
      "source": "CBS News",
      "pub_time": "2025-09-24T23:08:00-04:00",
      "description": "The Trump administration is raising the stakes as Congress faces a looming deadline to pass a government funding bill.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>The White House's Office of Management and Budget (OMB) sent a memo to federal agencies Wednesday night telling them to prepare layoff plans if there is a government shutdown, increasing the stakes <span class=\"link\">ahead of Congress' Tuesday deadline</span> to pass a government funding bill. </p><p>The news was first reported by Politico.</p><p>The memo, obtained by CBS News, tells agencies to consider reduction-in-force notices — a federal term for layoffs — for employees in programs, projects or activities that have discretionary funding that stops on Oct. 1 or that don't have any alternative sources of funding. It also goes further and says that employees should get RIF notices if they're in programs or projects \"not consistent with the President's priorities.\" </p><p>The RIF notices would be in addition to any furlough notices directing federal workers to stay home from work without pay if there is a shutdown, the memo states. </p><p>\"Programs that did not benefit from an infusion of mandatory appropriations will bear the brunt of a shutdown, and we must continue our planning efforts in the event Democrats decide to shut down the government,\" the memo states. </p>\n\n<p>An OMB official said that several programs will continue regardless of a shutdown, including Social Security, Medicare, veterans' benefits, military operations, law enforcement, Immigration and Customs Enforcement, Customs and Border Protection and air traffic control. These are statutory federal programs and would not be impacted by any potential reductions-in-force.</p><p>\"We remain hopeful that Democrats in Congress will not trigger a shutdown and the steps outlined above will not be necessary. The President supports enactment of a clean CR to ensure no discretionary spending lapse after September 30, 2025, and OMB hopes the Democrats will agree,\" the memo ends with.  </p><p>During the last few major government shutdowns, the executive branch has temporarily furloughed staff who are deemed non-essential and asked people in critical jobs to keep working without pay. After the shutdown ends, federal workers are normally paid back for their missed paychecks. It's far less common for the government to consider permanent layoffs.</p><p>Bobby Kogan, a former OMB official during the Biden administration, said the mass firings would be \"an action of enormous self-harm inflicted on the nation, needlessly ridding the country of talent and expertise.\" </p>\n\n<p>\"It's also extortive. 'Give us what we want in a funding fight, or we'll hurt the country,'\" Kogan said in a statement. </p><p>Senate Minority Leader Chuck Schumer, a New York Democrat, called the memo \"an attempt at intimidation.\"</p><p>\"Donald Trump has been firing federal workers since day one—not to govern, but to scare. This is nothing new and has nothing to do with funding the government,\" he wrote, predicting that any laid-off workers will be hired back.</p><p>House Minority Leader Hakeem Jeffries, also a New York Democrat, wrote on X: \"We will not be intimidated by your threat to engage in mass firings. Get lost.\"</p><p>The current fiscal year ends on Tuesday, Sept. 30, meaning the government will enter a shutdown Wednesday if Congress doesn't pass a new funding package.</p><p>A Republican short-term funding bill that <span class=\"link\">passed the House</span> has failed to reach the 60 votes needed to advance in the Senate. With a 53-seat Senate majority, Republicans need to earn the support of at least seven Democrats to resolve the funding dispute. Meanwhile, Democrats are <span class=\"link\">asking for several concessions</span>, including a rollback of this year's Medicaid cuts and an extension to health insurance tax credits, in exchange for their votes.</p><p>On Tuesday, President Trump canceled a meeting with Democratic congressional leaders to negotiate on a short-term funding patch, saying that their demands were \"unserious and ridiculous.\" </p>\n\n<p>\"I have decided that no meeting with their Congressional Leaders could possibly be productive,\" he wrote on Truth Social.</p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Tropical Storm Humberto forms in Atlantic. Maps show its forecast path.",
      "link": "https://www.cbsnews.com/news/humberto-map-forecast-national-hurricane-center/",
      "source": "CBS News",
      "pub_time": "2025-09-24T23:07:00-04:00",
      "description": "Tropical Storm Humberto could potentially bring some downstream impacts to parts of the Southeast U.S. coast from Florida up to North Carolina, the National Hurricane Center said.",
      "image_url": "",
      "content": "<html><body><div><article class=\"content content-article lazyload\" data-index=\"0\" data-path=\"/news/humberto-map-forecast-national-hurricane-center/\" id=\"article-0\">\n\n\n\n<section class=\"content__body\">\n<p>Tropical Storm Humberto formed Wednesday in the central tropical Atlantic, and it is anticipated to move northwestward through the next several days, according to the National Hurricane Center.</p><p>The storm is one of two systems swirling over the western Atlantic that could potentially bring some downstream impacts to parts of the Southeast U.S. coast from Florida up to North Carolina, the director of the Miami-based hurricane center, Michael Brennan, said.</p><p>Currently, there are no coastal watches or warnings in effect. </p><h2>Tropical Storm Humberto forecast and path</h2><p>As of the NHC's Wednesday evening update, Humberto is located about 505 miles northeast of the Leeward Islands. It is moving west-northwest at about 12 mph with maximum sustained winds of 45 mph.</p><p>\"Steady strengthening is forecast during the next several days,\" the hurricane center said.</p>\n<p>Tropical-storm-force winds extend outward up to 45 miles from the center of Humberto.</p>\n\n<p>Due to warm sea surface temperatures and mid-level relative humidity, Humberto is \"within a favorable environment for strengthening,\" the NHC said.</p><p>It is the eighth named storm of the 2025 Atlantic hurricane season. The tropical storm comes on the heels of <span class=\"link\">Hurricane Gabrielle</span>, which is not impacting land and is forecast to head farther out into the Atlantic.</p><h2>Another storm system brews over the Caribbean</h2><p>The hurricane center said it is also closely monitoring a second storm system over the northeast Caribbean in the Atlantic near Humberto.</p>\n<p>The system is likely to become a tropical depression late this week, forecasters said.</p>\n\n<p>It is likely to bring heavy rains near Puerto Rico and the Dominican Republic through Wednesday before strengthening near the Bahamas, according to the NHC.</p>\n\n</section>\n</article>\n</div></body></html>"
    },
    {
      "title": "Federal prosecutors near decision on whether to charge James Comey, sources say",
      "link": "https://www.cbsnews.com/news/federal-prosecutors-james-comey-near-decision-charge/",
      "source": "CBS News",
      "pub_time": "2025-09-24T22:56:39-04:00",
      "description": "Federal prosecutors are considering asking a grand jury to indict former FBI Director James Comey, sources say.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p><em>Washington</em> — Federal prosecutors are nearing a decision about whether to seek an indictment against former FBI Director James Comey, a longtime foe of President Trump's, multiple sources familiar with the matter tell CBS News. </p><p>It's unclear what alleged crimes Comey could be charged with, but multiple media outlets have reported that prosecutors have looked into charging him with lying to Congress when he testified in 2020 about the origins of the FBI's investigation into Russian meddling in the 2016 election. The five-year statute of limitations for that runs out on Tuesday.</p><p>Prosecutors are considering presenting a case against Comey to a grand jury, sources told CBS News. In order to indict him, a majority of the grand jury would need to vote that there is probable cause to believe a crime was committed — a lower standard than the burden of proof needed to secure a criminal conviction.</p><p>If Comey is charged, it would mark a dramatic escalation in the Trump administration's push to punish the president's adversaries. Just four days ago, Mr. Trump penned a Truth Social post that appeared to urge Attorney General Pam Bondi to look into Comey, among others, calling them \"guilty as hell\" and writing, \"JUSTICE MUST BE SERVED.\"</p><p>Mr. Trump also said Saturday he had fired the <span class=\"link\">top federal prosecutor</span> in the Eastern District of Virginia. A day earlier, the official, Erik Siebert, announced his resignation amid concerns from prosecutors in the office that he could be removed for refusing to charge another Trump political foe, New York Attorney General Letitia James.</p>\n\n<p>Mr. Trump's former personal lawyer Lindsey Halligan, who has no prosecutorial experience, was <span class=\"link\">sworn in</span> as interim U.S. Attorney for the Eastern District of Virginia on Monday.</p><p>Comey and the president have sparred for years. In the lead-up to the 2016 election, Comey oversaw investigations into alleged Russian election interference — including whether Russia sought to aid Mr. Trump's campaign — and into Hillary Clinton's private email server. The FBI's handling of both probes has drawn heavy scrutiny, and the Russia investigation, dubbed \"Crossfire Hurricane,\" has long outraged Mr. Trump and his allies.</p><p>Mr. Trump fired Comey months into his first term in 2017, and the two have slammed each other periodically ever since. Comey has called Mr. Trump \"morally unfit\" to be president and has <span class=\"link\">accused</span> Mr. Trump of demanding that Comey pledge his loyalty to him when he was FBI director. Mr. Trump has accused Comey of lying and suggested he should be jailed.</p><p>Since Mr. Trump's return to office, he has continued to rail against the FBI and other agencies involved in the Russia probe. In recent months, the Justice Department has been <span class=\"link\">investigating</span> the handling of classified Russia-related materials by former senior FBI officials, and intelligence agencies have <span class=\"link\">revisited their Russia investigations</span>. In 2017, U.S. intelligence agencies assessed that Russia sought to meddle in the 2016 race and had a preference for Mr. Trump.</p>\n\n<p>The handling of the Comey probe has worried some legal experts.</p><p>\"What is different about this case is that there clearly has been significant presidential pressure brought to bear,\" Tom Dupree, a George W. Bush-era Justice Department official, told CBS News. \"You don't want a universe in which that pressure distorts the prosecutorial judgement and makes prosecutors make charging decisions based not on the evidence, but on what they think will please the president.\"</p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Judge rules Trump admin. can't require states to cooperate with ICE to get FEMA grants",
      "link": "https://www.cbsnews.com/news/trump-administration-immigration-fema-grants-ruling-sanctuary-state/",
      "source": "CBS News",
      "pub_time": "2025-09-24T22:54:00-04:00",
      "description": "The Trump administration faced a legal setback in its push to cut off funding to \"sanctuary\" cities and states",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>A federal judge ruled Wednesday it is unconstitutional for the Trump administration to require states to cooperate with immigration enforcement in order to get some Federal Emergency Management Agency grants — a legal setback in the administration's push to revoke funding to \"sanctuary\" cities and states. </p><p>U.S. District Judge William Smith of Rhode Island ruled in favor of 20 mostly Democratic states that had sued FEMA, accusing the administration of \"holding critical emergency preparedness and response funding hostage\" unless they assist immigration agents. </p><p>The decision is likely to be appealed.</p><p>The states that sued — which include California, New York and Illinois — took issue with a Department of Homeland Security document issued earlier this year that says recipients of DHS grants must \"honor requests for cooperation\" with immigration authorities, including requests to detain migrants or share information. Some of the plaintiffs are \"sanctuary\" states that have laws restricting cooperation between police and immigration agents.</p><p>The states argued this move violates federal law and the Constitution, and could deprive them of billions per year in key disaster grants from FEMA, which is a sub-agency of DHS.</p>\n\n<p>The Trump administration has argued its policy doesn't violate the law. Also, months after the lawsuit was filed, the government told the court it had decided most of the FEMA disaster grants that the states were concerned about losing will not be tied to immigration cooperation after all. The administration called the lawsuit moot on those grounds. </p><p>The states called the Trump administration's decision not to link disaster grants to immigration enforcement \"halfhearted and incomplete,\" arguing it's unclear if the decision was communicated to agency staff or if it will apply to years beyond 2025.</p><p>In a 45-page ruling Wednesday, Smith sided with the states and granted summary judgment, calling the policy \"both arbitrary and capricious and unconstitutional.\"</p><p>\"Plaintiff States stand to suffer irreparable harm; the effect of the loss of emergency and disaster funds cannot be recovered later, and the downstream effect on disaster response and public safety are real and not compensable,\" Smith wrote.</p>\n\n<p>New York Attorney General Letitia James hailed the ruling in a statement, writing: \"The federal government cannot prioritize its cruel immigration agenda over Americans' safety. Today, the court affirmed that it is blatantly unconstitutional for DHS to hold life-saving disaster relief funds hostage to advance its anti-immigration efforts.\"</p><p>DHS Assistant Secretary Tricia McLaughlin asserted in a statement that cities and states that \"break the law and prevent us from arresting criminal illegal aliens should not receive federal funding.\"</p><p>\"The Trump Administration is committed to restoring the rule of law. No lawsuit, not this one or any other, is going to stop us from doing that,\" she wrote.</p><p>The ruling follows a monthslong gambit by President Trump to punish \"sanctuary\" cities and states that limit cooperation between the police and Immigration and Customs Enforcement.</p><p>The Trump administration argues that those jurisdictions make it harder for ICE to apprehend undocumented immigrants, including accused criminals and people who are in state or local custody. But \"sanctuary\" cities and states typically argue that requiring them to cooperate with ICE would undermine trust in local police and make some immigrants wary of reporting crimes.</p><p>Within hours of returning to office in January, Mr. Trump signed an executive order telling federal agencies to ensure that \"sanctuary\" jurisdictions \"do not receive access to Federal funds.\" Since then, several agencies have moved to restrict grants to \"sanctuary\" cities and states, including the <span class=\"link\">Department of Justice</span> and the Department of Housing and Urban Development.</p><p>Those moves have drawn lawsuits from Democratic cities and states. Last month, a San Francisco-based judge <span class=\"link\">blocked the Trump administration</span> from cutting off funding to almost three dozen cities and counties, including Los Angeles, Chicago, San Francisco and Boston.</p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Some Massachusetts cranberry farmers are restoring their bogs into wetlands",
      "link": "https://www.cbsnews.com/news/massachusetts-cranberry-farmers-restoring-wetlands-economic-headwinds/",
      "source": "CBS News",
      "pub_time": "2025-09-24T21:45:21-04:00",
      "description": "A state program pays cranberry farmers to turn unproductive bogs back into wetlands.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p><em>Carver, Massachusetts</em> — For Jarrod Rhodes, a fourth-generation cranberry farmer in Carver, Massachusetts, a 30-acre state project is taking a portion of his family's land back in time.</p><p>\"In 10 years, I hope it looks like a natural swamp,\" Rhodes told CBS News of the project's outcome. \"And just, kind of, everything that it may have looked like, you know, before we were here.\" </p><p>As cranberry prices fall due to global competition and costs increase due to labor issues, higher utility costs <span class=\"link\">and extreme weather</span>, cranberry farmers like Rhodes are part of the Massachusetts Division of Ecological Restoration's Cranberry Bog Program that pays farmers to turn unproductive bogs back into wetlands.</p><p>The restoration project for the bogs owned by the Rhodes family is about 95% complete. It will be only a matter of time before native plants begin to return. </p><p>Massachusetts has restored over 500 acres of wetlands over the past 15 years through the program, with another 500 acres planned. </p>\n\n<p>According to the Massachusetts Division of Ecological Restoration, the state has about 13,250 acres of cranberry farms. Massachusetts is the second-largest grower of cranberries in the U.S. behind Wisconsin, according to the U.S. Department of Agriculture. </p><p>The state allocates around $1 million a year to the restoration program, while leveraging other local and federal grants to do these restorations. </p><p>For Massachusetts cranberry farmers, the program is one way to preserve their land as a generation of farmers nears retirement. </p><p>\"They want to make sure that the land that they've tended to for so long is like, in good hands, whether that be a restoration program, or passing it on to the next generation,\" said Karen Cahill, deputy executive director of the Cape Cod Cranberry Growers Association, a trade group which represents cranberry farmers in the state. </p>\n\n<p>Under the program, the farmers keep the land, but the public can enjoy it too. An example of a restoration process that worked was the Eel River headwaters in Plymouth in 2010, where 60 acres of former bogs are now beautiful wetlands, filtering water, storing carbon and providing storm resilience. They are also open for hiking and wildlife. </p><p>Beth Lambert helps oversee the state's restoration program, including the projects at Eel River and Carver.</p><p>\"Many of the cranberry farms in Massachusetts were constructed on wetlands,\" Lambert said. \"And what we're doing is, we're restoring those underlying drivers of water, the soil, and then we let Mother Nature take it from there.\"</p><p>Back on Rhodes' farm, streams now wind through areas where cranberry vines once grew. </p><p>\"It's cool to see it kind of all bare,\" Rhodes said. \"Just kind of waiting for it to grow back and see if it actually works the way that it was supposed to.\" </p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "ICE head says deadly Dallas facility shooting was an \"indiscriminate\" attack",
      "link": "https://www.cbsnews.com/news/ice-todd-lyons-dallas-shooting-indiscriminate-attack/",
      "source": "CBS News",
      "pub_time": "2025-09-24T21:20:35-04:00",
      "description": "Todd Lyons, head of U.S. Immigration and Customs Enforcement, said the shooter \"fired indiscriminately\" into the ICE field office in Dallas and vehicles stationed there.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>The head of U.S. Immigration and Customs Enforcement said <span class=\"link\">the shooting</span> at a <span class=\"link\">Dallas processing facility</span> that left one detainee dead on Wednesday \"could have been worse,\" telling CBS News the sniper's shots were \"indiscriminate\" and other people could have been hit during the attack. </p><p>Todd Lyons, ICE's acting director, said <span class=\"link\">the shooter</span>, who officials say died from a self-inflicted gunshot wound, \"<span class=\"link\">fired indiscriminately</span>\" into the ICE field office in Dallas and vehicles stationed there. He said a group of detainees was inside one vehicle at the time of the shooting, after being recently arrested by ICE. </p><p>Lyons said three detainees in ICE custody were shot, one fatally. He noted two detainees remained in critical condition as of Wednesday afternoon. ICE has said no agency employees were harmed during the attack.</p><p>But Lyons said the shooting could have been deadlier, citing the shooter's \"high-powered rifle\" and the area he targeted. Officials say the shooter fired from a nearby rooftop.</p><p>\"What's even scarier is the location where the field office is. There's businesses around there, busy I-35,\" Lyons told CBS News during an interview in New York, noting the shooting occurred when people were going to work and school in the early morning.</p>\n\n<p>\"He could have, in his indiscriminate fire, hit people traveling to work, civilians on the ground,\" he said, calling it \"a very scary situation.\"</p><p>\"But unfortunately, someone did lose their life, and it was a definite attack on an ICE facility,\" he added.</p><p>Lyons said he believes the shooter deliberately targeted federal law enforcement officials, citing bullet casings that officials said were found with anti-ICE messaging on them.</p><p>\"When you have anti-ICE rhetoric written on the bullets, you know who they're targeting,\" he said.</p>\n\n<p>Lyons identified the deceased shooter as 29-year-old Joshua Jahn, saying preliminary information indicates he acted alone. </p><p>Asked if ICE plans to implement new security measures in light of Wednesday's shooting, Lyons said the agency had already been operating under a \"higher threat posture\" but would \"reevaluate how we're doing operations.\"</p><p>He said operations by ICE, which President Trump has charged with overseeing the largest deportation operation in American history, would not be slowed by the shooting.</p><p>\"We won't be stopped by it,\" Lyons said. \"We're gonna ensure that we're out there taking these public safety threats off the street, but we will have to go ahead and ensure that the men and women of ICE have all the equipment they need, all the protection they need and all the support they need.\"</p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Jimmy Kimmel's ratings jumped to highest in years with his return to ABC",
      "link": "https://www.cbsnews.com/news/jimmy-kimmel-ratings-jump-highest-in-years-return-to-abc-airwaves/",
      "source": "CBS News",
      "pub_time": "2025-09-24T20:52:00-04:00",
      "description": "The first episode​ of \"Jimmy Kimmel Live!\" following the comedian's return from his suspension drew a broadcast audience about four times larger than average.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>The <span class=\"link\">much-anticipated episode</span> of \"Jimmy Kimmel Live!\" following the comedian's return from his suspension drew a broadcast audience about four times larger than average, according to Nielsen ratings data. This was despite the late-night show being preempted by about a quarter of all ABC affiliate TV stations in the U.S. </p><p>Tuesday's show drew an estimated 6.26 million total broadcast viewers, Disney said in a news release Wednesday, per numbers compiled by Nielsen, an audience measurement firm. The data does not include those who watched the episode on streaming platforms.</p><p>For comparison, according to numbers provided to CBS News by a Disney spokesperson, Kimmel's show averaged 1.42 million broadcast viewers during its 2024-25 season — less than a quarter of what it saw on Tuesday night.</p><p>Tuesday's broadcast also drew a 0.87 rating in the coveted demographic of adults ages 18 to 49, Disney said, the highest for a single episode of Kimmel's show since March 2015. The show averaged a 0.13 rating for that age group last season, Disney said.</p><p>Kimmel's monologue also drew more than 26 million views on YouTube and other social platforms, according to Disney, which owns ABC. In it, he showed a video clip of President Trump criticizing  the show, saying it \"had no ratings.\"</p>\n\n<p>The host responded: \"Well, I do tonight.\"</p><p>The late-night show <span class=\"link\">was temporarily preempted</span> last week following comments Kimmel made during a Sept. 15 monologue regarding the assassination of conservative activist Charlie Kirk.</p><p>\"We hit some new lows over the weekend with the MAGA gang trying to characterize this kid who murdered Charlie Kirk as anything other than one of them, and doing everything they can to score political points from it,\" Kimmel said at the time. </p><p>In a Sept. 17 interview, Federal Communications Commission Chair Brendan Carr called Kimmel's remarks \"some of the sickest conduct possible,\" and said there was a \"path forward for suspension over this.\" Within hours of Carr's comments, two major station owners, Nexstar and Sinclair, announced they were preempting Kimmel's show indefinitely from their affiliates, while ABC also announced that it was \"indefinitely\" suspending the show.</p>\n\n<p>Nexstar has a deal pending to purchase fellow station operator Tegna <span class=\"link\">for $6.2 billion</span>, and needs the FCC's approval for it to go through.  </p><p>While ABC announced Monday that it had made the decision to bring Kimmel back to the airwaves, both Nexstar and Sinclair <span class=\"link\">said this week</span> that the show will continue to be preempted indefinitely.</p><p>Nexstar said it is \"continuing to evaluate the status\" of the show. It operates 33 ABC affiliates, while Sinclair runs 38 ABC stations. According to Disney, the two media companies account for ABC stations in about 23% of the U.S. market, including in large cities such as Nashville and Seattle.</p><p>In his monologue Tuesday, while he did not issue a blanket apology over his comments, Kimmel said that \"it's important to me as a human, and that is, you understand that it was never my intention to make light of the murder of a young man. I don't think there's anything funny about it.\"</p><p>In a Sept. 17 Truth Social post following Kimmel's suspension, Mr. Trump — who has railed against late-night hosts for years going back to his first administration, and has specifically criticized their ratings — wrote on Truth Social that \"[t]he ratings challenged Jimmy Kimmel Show is CANCELLED.\"</p><p>Before the show aired Tuesday, Mr. Trump again took to social media to write that \"I can't believe ABC Fake News gave Jimmy Kimmel his job back. The White House was told by ABC that his Show was cancelled!\"</p>\n<p class=\"content__meta--contributors\">\nAimee  Picchi\n                  \n        contributed to this report.\n    </p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Deadly shooting at Dallas ICE facility investigated by FBI as targeted attack",
      "link": "https://www.cbsnews.com/news/dallas-police-ice/",
      "source": "CBS News",
      "pub_time": "2025-09-24T20:41:16-04:00",
      "description": "One person was killed and two people are in critical condition after a shooting at a U.S. Immigration and Customs Enforcement (ICE) field office in Dallas, authorities said.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>One person was killed and two people are in critical condition after a shooting at a U.S. Immigration and Customs Enforcement (ICE) field office in Dallas on Wednesday morning, according to the U.S. Department of Homeland Security. </p><p>Acting ICE director Todd Lyons identified the shooter as 29-year-old <span class=\"link\">Joshua Jahn</span>. He died of a self-inflicted gunshot wound, authorities said. </p><p>All three of the victims shot were detainees of the facility, federal authorities said. </p><p>DHS issued a correction Wednesday afternoon after previously reporting that two people were killed and one person was in critical condition.</p><p>The facility is located along I-35E, just southwest of Dallas Love Field Airport.</p>\n\n<p>Dallas police said officers responded to an assist officer call at the facility around 6:40 a.m. An initial law enforcement report indicated the gunman was positioned at an elevated location. The gunman opened fire from the rooftop of an attorney's office across the street from the ICE Detention facility, on Empress Street.    </p><p>Just after 10 a.m., ICE said the scene was secured. According to ICE, the shooter opened fire on the facility, firing \"indiscriminately at the building and those in the sallyport.\"</p><p>\"Early evidence that we've seen from rounds that were found near the suspected shooter contain messages that are anti-ICE in nature,\" said Joe Rothrock, the special agent in charge of the FBI's Dallas field office.</p><p>FBI Director Kash Patel posted a photo and wrote, \"One of the unspent shell casings recovered was engraved with the phrase 'ANTI ICE.'\" </p>\n\n<p>The Dallas Field Office serves as a temporary holding facility for some detainees. Between January 20 and mid-June, an average of 47 people were held there each day, spending roughly seven hours in detention, according to a CBS News analysis of ICE data compiled by the Vera Institute of Justice and the Deportation Data Project.</p><p>The Mexican Consulate in Dallas has confirmed that one of the victims who was shot is a Mexican national.    </p><h2>August bomb threat at same Dallas ICE facility</h2><p>Wednesday's shooting was <span class=\"link\">not the first security threat at the Dallas ICE facility</span>, according to DHS. </p><p>Approximately one month earlier, DHS reported that a man, later identified as 36-year-old Bratton Dean Wilkinson, a U.S. citizen, approached the field office's reporting entrance and claimed to have a bomb in his backpack. </p><p>Wilkinson allegedly showed a security officer what he described as a \"detonator\" strapped to his wrist, prompting a shelter-in-place order at the Dallas ICE facility, DHS said. The officer immediately contacted 911, and local law enforcement responded with a bomb squad. Wilkinson was taken into custody and later charged with making terroristic threats, DHS said.</p><h2>DHS Secretary blames anti-ICE rhetoric for the Dallas shooting</h2><p>Department of Homeland Security Secretary Kristi Noem condemned the violence and called for a national reckoning on the rhetoric surrounding ICE. Federal officials labeled the incident a targeted assault on law enforcement. </p><p>In a strongly worded statement, Noem said:  </p><blockquote><p>\"Our prayers are with the families of those killed and our ICE law enforcement. This vile attack was motivated by hatred for ICE. For months, we've been warning politicians and the media to tone down their rhetoric about ICE law enforcementbefore someone was killed. This shooting must serve as a wake-up call to the far-left that their rhetoric about ICE has consequences. Comparing ICE Day-in and day-out to the Nazi Gestapo, the Secret Police, and slave patrols has consequences. The men and women of ICE are fathers and mothers, sons and daughters. They get up every morning to try and make our communities safer. Like everyone else, we just want to go home to our families at night. The violence and dehumanization of these men and women who are simply enforcing the law must stop. We are praying for the victims and their families.\"</p></blockquote><p>Noem also ordered DHS to immediately begin increasing security at ICE facilities across the country.  </p>\n\n<h2>State, federal lawmakers react to shooting</h2><p>Local, state and federal lawmakers <span class=\"link\">reacted to the shooting</span>, calling on violence against ICE agents to stop.</p><p>\"My hearts and prayers go out to my officers and agents, [that's] my biggest concern as well as everyone in that area but this just shows the violence has been increased against ICE officers and agents,\" acting ICE Director Todd Lyons said in an interview with CNN.      </p><p>Sen. Ted Cruz was in Dallas Wednesday morning. He repeatedly said that politically motivated violence needs to stop.</p><p>Texas Gov. Greg Abbott expressed his support for ICE, saying the state fully supports ICE.     </p><p>\"Both the Texas Dept. of Public Safety &amp; Texas National Guard work closely with ICE. This assassination will NOT slow our arrest, detention, &amp; deportation of illegal immigrants,\" he said on X. \"We will work with ICE &amp; the Dallas Police Dept. to get to the bottom of the assassin's motive. We will offer ICE additional support to assist their operations.\"    </p><p>Texas Department of Transportation cameras near the facility showed a heavy first responder presence with dozens of units.    </p><p>\"Please join me in prayer for the injured and their families from this morning's active shooter incident at the ICE facility in Dallas,\" Dallas County Judge Clay Jenkins said on X. \"Violence and terror is never the answer to anything.\"      </p>\n\n<p>The Fort Worth Police Department also posted on X, condemning the violence.    </p><p>\"The violence that occurred in Dallas, TX this morning is uncalled for and moments like this are deeply disturbing as it creates more division in our community at a time when the focus needs to be on how we can come together,\" the post reads. \"We continue to ask our community that if you see something, say something.\"    </p><p>CBS News confirmed that a bomb threat was made to the same office on Aug. 25. A man was arrested and charged after he claimed to have a detonator. He's been detained for weeks.    </p><h2>    Second ICE facility attack in Texas in 2025    </h2><p>A <span class=\"link\">Fourth of July attack</span> at a Texas immigration detention center injured a police officer, who was shot in the neck.     </p><p>Attackers dressed in black military-style clothing opened fire outside the Prairieland Detention Center in Alvarado, southwest of Dallas, federal prosecutors said. At least 11 <span class=\"link\">people have been charged</span> in connection with the attack.    </p><h2>    Attack against CBP federal agents in McAllen, Texas     </h2><p>A man with an assault rifle fired dozens of rounds at federal agents as they were leaving a <span class=\"link\">U.S. Border Patrol facility in McAllen</span> on July 7.     </p><p>The man, identified as Ryan Louis Mosqueda, injured a police officer who responded to the scene before authorities shot and killed him. Police later found other weaponry, ammunition and backpacks inside his car.    </p>\n\n<p>\"The obsessive attack on law enforcement, particularly ICE, must stop,\" Vice President JD Vance said on X. \"I'm praying for everyone hurt in this attack and for their families.\"    </p>\n<p class=\"content__meta--contributors\">\nCamilo  Montoya-Galvez\n                  \n        contributed to this report.\n    </p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Syria's president warns Israel's actions could alienate U.S. allies",
      "link": "https://www.cbsnews.com/news/syria-president-ahmed-al-sharaa-israel/",
      "source": "CBS News",
      "pub_time": "2025-09-24T20:34:00-04:00",
      "description": "Syrian President Ahmed al-Sharaa told CBS News that Israel's actions put \"the interests of the U.S. and its strategic allies at risk.\"",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>Syrian President Ahmed al-Sharaa says Israel's military action in the region could be detrimental to the U.S. and may result in its allies turning away fromAmerica. </p><p>Al-Sharaa, who has past ties to al Qaeda and the Islamic State, spoke with Margaret Brennan, on assignment in Syria for \"60 Minutes,\" ahead of his historic address to the United Nations in New York. Al-Sharaa took power after <span class=\"link\">ousting</span> former Syrian ruler Bashar al-Assad following nearly 14 years of civil war. In December, the U.S. removed a $10 million bounty off al-Sharaa's head.In July, the <span class=\"link\">U.S. lifted</span> its terrorist designation of the rebel group he led.  </p><p>Al-Sharaa said Israel's <span class=\"link\">recent attack on Hamas leaders</span> who were in Qatar — a close U.S. ally — and <span class=\"link\">its airstrikes</span> on the grounds near Syria's presidential palace put \"the interests of the U.S. and its strategic allies at risk, pushing those allies to consider alternatives to America.\" </p><p>\"Bombing the presidential palace amounts to nothing less than a declaration of war on Syria,\" he told Brennan. \"What if the backyard of the White House was bombed? The United States would wage war against whoever targeted the White House backyard for the next 20 years.\" </p><p>Syria did not retaliate for those Israeli strikes. The U.S. launched a diplomatic effort led by U.S. special envoy to Syria Tom Barrack to help de-escalate tensions.</p>\n\n<p>\"There are borders and international standards that must be respected,\" he said. \"There are international laws, the United Nations and the Security Council that we turn to, to protect those standards. Otherwise, the world would fall into massive chaos.\" </p><p>On Wednesday, al-Sharaa became the first Syrian head of state to speak at the U.N. General Assembly in nearly 60 years. In his speech, he spoke of the brutality endured by the Syrian people under the Assad regime and described what he called a \"historic opportunity to bring stability, peace, and prosperity to Syria and the entire region.\" Healso warned of regional instability stemming from Israel's actions. </p>\n<p>In his nearly 10-minute speech, al-Sharaa told world leaders that Israeli policies and actions \"contradict\" the international community's support for Syria. He said Syria is committed to reaching a security agreement with Israel to lower tensions. </p><p>The U.S. has been trying to brokeran arrangementbetween Syria and Israel that is similar to a 1974 ceasefire agreement with the Assad regime. After the collapse of the Assad regime in December, Israel invaded territory in southernSyria and created what it calls a \"buffer zone\" beyond the lines of the 1974 agreement. Al-Sharaawants Israel to return any lands seized since the Assad regime fell, and to have U.N. peacekeepers monitor the new agreement. </p>\n\n<p>An Israeli official declined to comment on al-Sharaa's remarks but confirmed that negotiations with Syria are continuing. </p><p><em>Watch more of the interview this season on \"60 Minutes.\"</em></p><p><em>This story was reported by Margaret Brennan, Andy Court, Annabelle Hanflig, Omar Omar, and Camilla Schick, and produced for CBS Evening News by Justine Redman.</em></p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Travis Decker, accused of killing 3 daughters, declared dead by U.S. Marshals",
      "link": "https://www.cbsnews.com/news/travis-decker-dead-accused-killing-3-daughters-washington/",
      "source": "CBS News",
      "pub_time": "2025-09-24T19:38:00-04:00",
      "description": "Decker, a 32-year-old former Army soldier, was accused in May of killing his three daughters, 9-year-old Paityn Decker, 8-year-old Evelyn Decker and 5-year-old Olivia Decker.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>Prosecutors have moved to drop charges against Travis Decker, the man accused of killing his three young daughters earlier this year before disappearing and sparking a <span class=\"link\">monthslong manhunt</span>, after the U.S. Marshals Service informed them Decker is dead, court documents show. </p><p>Local law enforcement, however, said it is still waiting on DNA test results on remains that are believed to be Decker's that were <span class=\"link\">found in Washington state</span> last week. </p><p>The Chelan County Sheriff's Office said last week the remains, which were discovered Thursday, Sept. 18, were found in a remote wooded area south of Leavenworth, Washington.</p><p>Using a drone, authorities found a decomposed body with bone fragments spread around the hillside, along with clothing and other personal items, Sheriff Mike Morrison said last week. He said the body was found in a \"mountainous area\" that was not along a trail, and it was about a three-hour hike to get to the remains on foot. </p><p>Decker, a 32-year-old former Army soldier, was accused in May of killing his three daughters, 9-year-old Paityn Decker, 8-year-old Evelyn Decker and 5-year-old Olivia Decker. DNA testing confirmed he was the only suspect in the murders, police have said.</p>\n<p>The girls' mother alerted authorities on May 30 that he had not returned the three girls on time to her at her home in Wenatchee, Washington, following a scheduled visit, and a search was launched. The girls' bodies were found three days later at a campsite in the Cascade Mountains, along with Decker's truck. </p>\n\n<p>An autopsy determined their cause of death was suffocation, authorities said. </p><p>In September 2024, Decker's ex-wife, Whitney Decker, filed to modify their custody agreement. In a petition, she wrote that Decker's mental health issues had worsened and that he had become increasingly unstable. She also said he was often living out of his truck. </p><p>Decker, an Army infantryman from March 2013 to July 2021, had extensive training in navigation, survival and other survival skills, authorities previously said. Despite the continued search, police said in late June that they <span class=\"link\">believe he may have died</span> or left the area.   </p>\n<p class=\"content__meta--contributors\">\nNicole  Brown Chau and \n                                                  \n                                  Kierra  Frazier\n                  \n        contributed to this report.\n    </p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Trump alleges \"triple sabotage\" at U.N. after escalator and teleprompter freeze up",
      "link": "https://www.cbsnews.com/news/trump-un-escalator-teleprompter-united-nations-white-house/",
      "source": "CBS News",
      "pub_time": "2025-09-24T18:35:00-04:00",
      "description": "A malfunctioning escalator and teleprompter at the United Nations' headquarters drew President Trump's frustration.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>President Trump accused the United Nations of \"sabotage\" and demanded an investigation Wednesday after an escalator and teleprompter malfunctioned during his visit to U.N. headquarters — though the U.N. says a videographer from Mr. Trump's delegation may have triggered the escalator's safety shutoff. </p><p>Shortly after Mr. Trump and first lady Melania Trump entered U.N. headquarters in New York City on Tuesday to address world leaders at this year's General Assembly session, they stepped onto an escalator. But the machine ground to a halt almost immediately, forcing both Trumps to start climbing the stairs on their own, videos of his arrival show.</p><p>Later, as Mr. Trump began his speech to the General Assembly, he remarked that his teleprompter wasn't working. \"I can only say that whoever's operating this teleprompter is in big trouble,\" the president said, drawing laughs from the audience.</p><p>The president brought up the two mishaps later in his speech, framing them as metaphors for what he views as the incompetence of the United Nations — which he accused of offering up little more than \"empty words.\"</p><p>\"All I got from the United Nations was an escalator that, on the way up, stopped right in the middle. If the first lady wasn't in great shape, she would've fallen,\" the president said. \"These are the two things I got from the United Nations: a bad escalator and a bad teleprompter.\"</p>\n\n<p>In a Truth Social post a day later, Mr. Trump claimed the incidents were not a coincidence. He also leveled a third allegation that \"the sound was completely off\" during his speech. </p><p>\"A REAL DISGRACE took place at the United Nations yesterday — Not one, not two, but three very sinister events!\" the president wrote. \"This wasn't a coincidence, this was triple sabotage at the UN. They ought to be ashamed of themselves.\"</p><p>Mr. Trump pushed for an \"immediate investigation\" by the United Nations. </p>\n<p>White House press secretary Karoline Leavitt floated a similar explanation on Tuesday, writing in a post on X: \"If someone at the UN intentionally stopped the escalator as the President and First Lady were stepping on, they need to be fired and investigated immediately.\"</p>\n\n<p>Leavitt shared a screenshot from a Times of London article that reported U.N. workers had been overheard joking they might intentionally shut off escalators during Mr. Trump's visit and blame funding shortfalls. There is no evidence that U.N. staff followed through on those jokes.</p><p>The press secretary later told Fox News that the Secret Service is looking into the matter, telling host Jesse Watters that \"it doesn't look like a coincidence to me.\" A federal law enforcement source confirmed to CBS News that the Secret Service is looking into the escalator issue.</p><p>However, a U.N. spokesman said Tuesday the escalator may have suddenly stopped because of a videographer from the U.S. delegation who can be seen walking ahead of the president and first lady on the escalator, seemingly to film their arrival.</p><p>\"A subsequent investigation, including a readout of the machine's central processing unit, indicated that the escalator had stopped after a built-in safety mechanism on the comb step was triggered at the top of the escalator. The safety mechanism is designed to prevent people or objects accidentally being caught and stuck in or pulled into the gearing. The videographer may have inadvertently triggered the safety function described above,\" Stéphane Dujarric, a spokesman for U.N. Secretary-General António Guterres, said in a statement.</p><p>Separately, a U.N. official told CBS News that the White House operated the teleprompter for Mr. Trump when it malfunctioned during his speech. </p><p>CBS News has reached out to the White House for comment about the U.N.'s findings.</p><p>Mr. Trump's speech came as his second administration distances itself from the U.N., withdrawing the U.S. from agencies like the Human Rights Council and the World Health Organization. The administration has also cut its financial contributions to the U.N. and criticized its approach to Israel.</p>\n\n<p>\"The U.N. has such tremendous potential,\" the president said in his speech, \"but it's not even coming close to living up to that potential.\"</p>\n<p class=\"content__meta--contributors\">\nAaron  Navarro\n                  \n        contributed to this report.\n    </p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Seasonal hiring could fall to lowest level since 2009, analysis finds",
      "link": "https://www.cbsnews.com/news/seasonal-retail-hiring-on-track-to-fall-to-lowest-level-since-2009/",
      "source": "CBS News",
      "pub_time": "2025-09-24T18:05:40-04:00",
      "description": "Retailers are expected to hire fewer seasonal workers this year as tariffs and inflationary pressures roil the economy.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>Retailers around the U.S. are expected to sharply reduce the number of workers they add for the holidays, a shift from their usual seasonal hiring sprees to help cope with the annual crush of customers. </p><p>Outplacement firm Challenger, Gray and Christmas attributes the weak demand for extra workers this year to companies bearing the heavier costs from U.S. tariffs on foreign goods, as well as on rising inflation and their growing reliance on technology to improve efficiency. </p><p>The firm expects retail hiring fo the holidays to fall to its lowest level since 2009, when the economy was emerging from a recession caused by the global financial crisis. </p><p>\"Seasonal employers are facing a confluence of factors this year: tariffs loom, inflationary pressures linger, and many companies continue to rely on automation and permanent staff instead of large waves of seasonal hires,\" Andy Challenger, workplace expert and senior vice president of Challenger, Gray &amp; Christmas, said in a statement.</p><p>The weaker seasonal hiring forecast comes as the U.S. job market is faltering. Employers added <span class=\"link\">only 22,000 jobs in August</span>, falling far short of economists' expectations.</p>\n\n<p>Inflation has also edged up in recent months. The Consumer Price Index, which in March had sunk to an annual rate of 2.3%, in August <span class=\"link\">rose at a 2.9%</span> pace from a year ago.</p> <p>In the last quarter of 2024, retailers added just over 543,000 seasonal workers, down roughly 4% compared to 2023. Companies are projected to add fewer than 500,000 jobs during the last three months of 2025, according to Challenger. Such a figure would mark the smallest seasonal gain in 16 years. </p><p>Challenger pointed to fewer seasonal hiring announcements than usual from retailers as a sign they plan to hire fewer workers for the holidays.</p><p>\"While we could see a late hiring push if holiday sales surprise to the upside, the cautious pace of announcements so far suggests that companies are not betting on a big seasonal surge. This year may be more about doing more with less,\" Challenger said. </p>\n\n<p>Tariffs are causing some consumers to pull back on spending, recent data shows. An August survey of consumers from the University of Michigan found that most U.S. adults plan to spend less on goods that see tariff-driven price hikes. Just 24% of consumers surveyed said they expected to spend as usual on items that rise substantially in price, according to the report.</p><p>Tariffs have <span class=\"link\">already driven up the cost</span> of some categories of goods for U.S. consumers. For example, in August, audio equipment rose in price by 12% compared to one year earlier,  while the cost of household goods rose 10%, the latest Consumer Price Index report shows.</p><p>\"A wave of uncertainty is impacting not just retailers, but also consumers heading into the final quarter of the year. With hiring slowing across the board, Retailers may hire fewer workers themselves, while many of their shoppers slow spending,\" Challenger added. </p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Rihanna shares first photo of Rocki, baby No. 3 with A$AP Rocky",
      "link": "https://www.cbsnews.com/news/rihanna-gave-birth-rocki-irish-mayers/",
      "source": "CBS News",
      "pub_time": "2025-09-24T17:58:00-04:00",
      "description": "Rocki Irish Mayers was born on Sept. 13, according to Rihanna's caption on Instagram.",
      "image_url": "",
      "content": "<html><body><div><article class=\"content content-article lazyload\" data-index=\"0\" data-path=\"/news/rihanna-gave-birth-rocki-irish-mayers/\" id=\"article-0\">\n\n\n<section class=\"content__body\">\n<p>Rihanna has given birth to Rocki Irish Mayers, the singer announced Wednesday, as she revealed the first image of her newborn.</p><p>The photo posted to her social media showed the 37-year-old artist and beauty mogul holding her daughter. Rocki is Rihanna's third child with rapper A$AP Rocky, whose real name is Rakim Mayers. Rocki was born on Sept. 13, Rihanna wrote on Instagram. </p><p>Another image Rihanna shared Wednesday showed two small pink boxing gloves with long pink ribbons.</p><p>The power couple shared in May, <span class=\"link\">during the Met Gala</span>, that they were expecting their third child. </p><p>\"It feels amazing, you know,\" A$AP Rocky, who served as gala co-chair, told reporters at the time. \"And I'm glad everybody's happy for us 'cause we definitely happy, you know.\"</p>\n\n<p>Rihanna and A$AP Rocky have mostly kept their family life private, only occasionally sharing images of their kids online, such as when they welcomed their <span class=\"link\">first baby boy, RZA, in May 2022</span> and <span class=\"link\">Riot Rose in September 2023</span>. </p>\n\n</section>\n</article>\n</div></body></html>"
    },
    {
      "title": "Trump says skipping Tylenol while pregnant has \"no downside.\" Doctors disagree.",
      "link": "https://www.cbsnews.com/news/trump-tylenol-pregnant-fever-pain-risks/",
      "source": "CBS News",
      "pub_time": "2025-09-24T17:25:00-04:00",
      "description": "Doctors worry President Trump's message of \"tough it out\" will harm women and their babies, as high fever and severe pain can be dangerous during pregnancy.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>Many doctors and public health officials are taking issue with President Trump's claim that there's \"no downside\" to avoiding acetaminophen during pregnancy and his suggestion that expecting mothers should \"tough it out\" when it comes to fevers.</p><p>Acetaminophen, the active ingredient in Tylenol and many cold and flu medications, is used to reduce pain and fever in pregnancy. </p><p>\"Don't take it. There's no downside in not taking it,\" Mr. Trump said during <span class=\"link\">an announcement Monday</span> that linked the use of the drug during pregnancy to an increased risk of autism in children without giving new evidence and ignoring data that shows there is not a causal relation.</p><p>The Food and Drug Administration is \"strongly recommending that women limit Tylenol use during pregnancy unless medically necessary,\" he said. \"That's, for instance, in cases of extremely high fever that you feel you can't tough it out, you can't do it. I guess there's that. It's a small number of cases, I think. But if you can't tough it out, if you can't do it, that's what you're going to have to do. You'll take a Tylenol.\"</p><p>In an open letter to physicians released after Mr. Trump's announcement, FDA Commissioner Marty Makary was more cautious than the president, writing, \"clinicians should consider minimizing the use of acetaminophen during pregnancy for routine low-grade fevers.\" </p>\n\n<p>But doctors worry the suggestion to \"tough it out\" will harm women and their babies, as high fever and pain can be dangerous during pregnancy.</p><p>\"The messaging of 'tough it out' is something that unfortunately we have said to women in health care in this country for far too long,\" Dr. Lucky Sekhon, an OB/GYN and infertility specialist in New York City, told CBS News.</p><p>There's also a concern patients may turn to other pain medications that are proven to be unsafe during pregnancy. Makary noted in his letter that \"acetaminophen is the safest over-the-counter alternative in pregnancy among all analgesics and antipyretics.\" (Antipyretics are drugs that reduce fever.)</p><p>In a statement, Kenvue, the maker of Tylenol, said, \"Independent, sound science clearly shows that taking acetaminophen does not cause autism,\" calling it \"the safest pain reliever option for pregnant women as needed throughout their entire pregnancy.\" </p>\n\n<p>\"Without it, women face dangerous choices: suffer through conditions like fever that are potentially harmful to both mom and baby or use riskier alternatives,\" the company said.</p><h2>The risks of fever during pregnancy</h2><p>Medical experts warn that fevers during pregnancy can cause problems for a developing baby. </p><p>Especially in early pregnancy, fevers are associated with cardiac issues, cleft lip, cleft palate and central nervous system abnormalities, Dr. Steven Fleischman, president of the American College of Obstetricians and Gynecologists, told CBS News after Mr. Trump's announcement.</p><p>\"The idea that we're going to let someone with a fever 'tough it out' may have much worse implications for a pregnant woman than taking a dose of acetaminophen to bring that fever down,\" he said. \"I think that's not really an appropriate way to handle medical issues in pregnancy.\"</p><p>Dr. Céline Gounder, CBS News medical contributor and editor-at-large for public health at KFF Health News, echoed it's important to not let fevers go untreated due to the risk of brain development issues in the baby.</p><p>\"Fever and infections during pregnancy can cause neurodevelopmental disorders including potentially autism,\" she said. \"I worry that this will scare women and that pregnant women may avoid Tylenol even when it's entirely appropriate, for example, to treat a fever.\"</p><p>Internal medicine physician Dr. Shoshana Ungerleider saidscience does not support the administration's claims.</p>\n\n<p>\"What's far riskier is leaving a fever untreated during pregnancy which can harm both mom and baby, so Tylenol remains the safest option we have in those situations,\" she said. </p><h2>Why Tylenol or acetaminophen is advised</h2><p>Gounder said she's concerned that expectant mothers with a fever or pain may turn to other options that would be less safe. </p><p>\"Will women end up taking other medications like aspirin or ibuprofen during pregnancy? Those actually can be dangerous, especially in the third trimester, you can end up with kidney issues, cardiac issues in the baby,\" she said.</p><p>Fleischman agreed that acetaminophen is the safest option.</p><p>\"You should not, under any circumstances, avoid taking acetaminophen if you have a fever early in pregnancy, if you have a headache, if you have some other condition in pregnancy, we want you to take that medication,\" he told CBS News. \"The overwhelming evidence that we have seen over the last 20 years does not show causation for acetaminophen causing autism.\"</p><p>That research, he explained, includes a large study published last year which analyzed data on 2.5 million pregnancies and found no increased risk of autism in children whose mothers took acetaminophen. </p><p>The lead author of that study, Viktor H. Ahlqvist, PhD, of the Karolinska Institutet in Sweden, said in an interview that acetaminophen continues to be \"the recommended option\" for use during pregnancy. </p>\n\n<p>He shared the concern that \"alternatives to acetaminophen in the U.S. might be other medications with less-safe profiles, such as opioids or other things to manage pain. We do know that these have serious consequences when used in pregnancy, both for the mom and for the baby.\"</p><p>These doctors are not alone. Health experts from <span class=\"link\">around the world</span> have pushed back against the Trump administration's claims about acetaminophen and autism.</p><p>The European Union's European Medicines Agency said Tuesday there is \"no new evidence\" that would require changes to the current recommendations for use of acetaminophen, also called paracetamol outside the U.S.</p><p>\"Paracetamol remains an important option to treat pain or fever in pregnant women,\" Steffen Thirstrup, EMA's chief medical officer, said in the statement. \"Our advice is based on a rigorous assessment of the available scientific data and we have found no evidence that taking paracetamol during pregnancy causes autism in children.\"</p><h2>What should pregnant women do?</h2><p>Pregnant patients should consult with their doctor on what's the best for them, but Fleischman pointed out that acetaminophen is only used when necessary. </p><p>\"You don't take Tylenol just for fun. … It's not like a [daily] vitamin, and we would never treat it that way,\" he said. \"Patients are told to use acetaminophen when they have a fever, when they have a headache or other pain symptoms in pregnancy which require treatment.\" </p><p>The medication is generally recommended for a fever above 100.4, Fleischman explained. </p>\n\n<p>\"We know that higher fevers are definitely associated with more issues but if your temperature is above 100.4, taking acetaminophen to bring that down is definitely advised,\" he said. </p><p>A single extra-strength dose, which is 500 mg, should be \"more than adequate,\" he added, but said it can be repeated if needed. </p><p>\"As always, we want our patients to consult with their health care provider before using any medications, but all of the data shows that it's safe and there is no data that shows Tylenol causes autism,\" Dr. Veronica Gillispie-Bell, a board-certified obstetrician-gynecologist, told CBS News.</p><p>She shared concerns over the FDA initiating a label change on Tylenol and acetaminophen to warn of a possible association with autism.</p><p>\"I think it will make our moms scared to take Tylenol, and the repercussions, again, for those moms that are having fever and those moms that are having pain, those repercussions can be very detrimental. And it's really shameful when we know that Tylenol is safe and again we have no studies showing that it causes autism,\" Gillispie-Bell said. </p>\n<p class=\"content__meta--contributors\">\nRamy  Inocencio\n                  \n        contributed to this report.\n    </p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Judge won't reinstate 8 government watchdogs fired by Trump",
      "link": "https://www.cbsnews.com/news/judge-government-watchdogs-inspector-generals-fired-by-trump/",
      "source": "CBS News",
      "pub_time": "2025-09-24T17:00:00-04:00",
      "description": "Eight former inspectors general who were fired by President Trump in January sued to get their jobs back.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p><em>Washington — </em>A federal judge on Tuesday declined to reinstate a group of internal watchdogs at eight federal agencies who were fired by President Trump earlier this year, but she wrote that the president broke the law when he ousted them without notifying Congress and providing justification for the removals.</p><p>U.S. District Judge Ana Reyes declined the officials' request for an order allowing them to return to their jobs as inspectors general unless Mr. Trump removes them in a way that complies with federal law. Reyes said the plaintiffs, eight former government watchdogs, failed to show that they had suffered irreparable harm as a result of their firings.</p><p>She noted that even if the officials were reinstated to their roles, as they asked to be, Mr. Trump could remove them again after 30 days by providing notice and a rationale to Congress, requirements laid out in the Inspector General Act.</p><p>\"The Court recognizes Plaintiffs' exceptional service as IGs, marked by decades of distinguished leadership across multiple administrations. They sacrificed much to take on the role of an IG and its many demands — no doubt including substantial time away from family and far larger paychecks available in the private sector,\" Reyes wrote in a 20-page decision. \"They deserved better from their government. They still do. Unfortunately, this Court cannot provide Plaintiffs more.\"</p><p>Still, she said that Mr. Trump violated that law when he fired the internal agency watchdogs without telling Congress or laying out the reasons for the removals.</p>\n\n<p>\"President Trump violated the IGA. That much is obvious,\" Reyes wrote.</p><p>The inspectors general who sued were among a group of 17 whom <span class=\"link\">Mr. Trump fired en masse</span> days after returning to the White House in January. They worked at the Small Business Administration and Departments of Agriculture, Defense, Education, Health and Human Services, Labor, State, and Veterans Affairs. Inspectors general <span class=\"link\">are tasked with investigating</span> wrongdoing and rooting out fraud and waste at government agency. They work independently from the agencies they oversee, and typically serve across Democratic and Republican administrations.</p><p>The officials were informed of their firings through an email from the White House's Personnel Office, which stated that \"due to changing priorities,\" they were terminated from their respective positions \"effective immediately.\"</p><p>But the removals failed to comply with federal law, which required the president to provide Congress with 30-day notice and \"case-specific reasons\" for removing an inspector general, the top Republican and Democrat on the Senate Judiciary Committee said in a letter to Mr. Trump.</p>\n\n<p>The senators asked the president to provide and required notice and information \"immediately.\" But Reyes noted in her decision there has not been a response.</p><p>The inspectors general <span class=\"link\">filed a lawsuit</span> challenging the removals in mid-February, arguing that the president violated the Inspector General Act and acted outside of his authority by dismissing them without notifying Congress and providing a rationale. They asked the court to reinstate them to their positions and are seeking back pay.</p><p>Since then, Mr. Trump has nominated new candidates to serve as inspectors general for five of the agencies, and the Senate confirmed one, at the Department of Veterans Affairs, last month.</p><p>The firings are part of a broader effort by Mr. Trump to reshape the federal government. He has fired numerous officials appointed by former President Joe Biden to serve at independent agencies, actions that have sparked legal battles.</p><p>The Supreme Court has so far allowed the president to oust officials at four agencies and is currently weighing a bid by the Trump administration to fire Lisa Cook from the Federal Reserve's Board of Governors.</p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "RadioShack buyers ran a Ponzi scheme, SEC alleges",
      "link": "https://www.cbsnews.com/news/sec-rev-ponzi-scheme-tai-lopez-alex-mehr/",
      "source": "CBS News",
      "pub_time": "2025-09-24T16:00:35-04:00",
      "description": "The buyers of distressed brick-and-mortar companies like RadioShack and Modell's Sporting Goods, are accused of running a Ponzi scheme.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>A pair of e-commerce entrepreneurs who bought a number of well-known retail brands — including RadioShack, Modell's Sporting Goods and Pier 1 Imports — out of bankruptcy are accused of running a Ponzi scheme. </p><p>The Securities and Exchange Commission on Monday accused Alex Mehr and Tai Lopez, founders of the Miami-based Retail Ecommerce Ventures (REV), of defrauding investors out of approximately $112 million.</p><p>Through their holding company, Mehr and Lopez acquired distressed brick-and-mortar companies in order to turn them into successful, online-only brands. Dress Barn and Linens 'n Things were also among their acquisitions. </p><p>REV acquired RadioShack in 2020, three years after the nearly century-old electronics chain filed for its second bankruptcy. RadioShack <span class=\"link\">first filed</span> for Chapter 11 protection in 2015. </p><p>Modell's Sporting Goods filed for bankruptcy in <span class=\"link\">March 2020</span>, during which time it also announced it would be closing all of its stores. REV bought the Modell's brand name and assets in August 2020. Pier 1 Imports — which still exists as an online store — declared bankruptcy in early 2020. REV acquired its trademark name and assets later that same year.</p>\n\n<p>The SEC's suit alleges that between 2020 and 2022, Mehr and Lopez, \"made material misrepresentations\" to hundreds of investors about the bankrupt retailers they had acquired. For example, to entice individuals to invest in their acquisitions, they said their portfolio companies were \"on fire\" and that \"cash flow is strong.\" They also told prospective backers that money raised for a company would only be used for that specific firm. That proved not to be the case, according to the SEC's lawsuit, which was filed Monday in the U.S. District Court for the Southern District of Florida.</p><p>\"Contrary to these representations, while some of the REV Retailer Brands generated revenue, none generated any profits,\" the suit states. \"Consequently, in order to pay interest, dividends and maturing note payments, Defendants resorted to using a combination of loans from outside lenders, merchant cash advances, money raised from new and existing investors, and transfers from other portfolio companies to cover obligations.\" </p><p>Neither Mehr nor Lopez immediately responded to CBS News' request for comment. </p><p>The SEC alleges that at least $5.9 million of returns paid to investors were actually Ponzi-like payments funded by other investors, as opposed to companies' profits. </p>\n\n<p>Additionally, the federal regulatory agency claims that Mehr and Lopez allocated $16 million worth of investments for their own use, according to the filing. </p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Americans will soon have fingerprints scanned when they go to most of Europe",
      "link": "https://www.cbsnews.com/news/americans-travel-europe-fingerprints-scan-entry-exit-system/",
      "source": "CBS News",
      "pub_time": "2025-09-24T15:21:00-04:00",
      "description": "Authorities in Europe will phase in new security measures for Americans and other international travelers over a roughly six-month period starting next month.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>Americans traveling to Europe will soon have their fingerprints scanned and picture taken when they arrive in countries like <span class=\"link\">France</span>, <span class=\"link\">Italy</span> and Spain under new regulations being rolled out across the continent starting next month. Those who don't provide such biometric data will be told au revoir, arrivederci or adiós.</p><p>The change comes as the European Union rolls out its new Entry/Exit System for not just Americans but all visitors from outside Europe's Schengen Area, a group of countries that allows people in the zone to travel across borders freely without going through customs checks.</p><p>The new system will be introduced gradually over a roughly six-month period starting Oct. 12. It will eventually replace passport stamps, according to the EU.</p><h2>What new requirements will Americans see under Europe's Entry/Exit System?</h2><p>In addition to the fingerprint scan and being photographed, Americans will have to provide details from their passports like their full name and date of birth. The system will also collect when and where they're entering and leaving the Schengen Area.</p><p>\"U.S. citizens traveling to most European countries should expect new automated border checks and to have their biodata digitally collected upon arrival and departure,\" the State Department said in a social media post.</p>\n<p>Travelers who refuse to provide their biometric data through the Entry/Exit System will be denied entry to the region. The system will also keep track of people who were denied entry. As of now, fingerprints of children younger than 12 years old will not be collected, authorities said.</p>\n\n<p>The changes aim to increase security in the Schengen Area, according to the EU. The system will help authorities track who enters and leaves the area and crack down on people who stay longer than they're allowed.</p><p>Americans with passports that are valid for at least six months can generally stay in the Schengen Area for up to 90 days over a 180-day period, according to the State Department. People who want to stay longer or seek employment in Europe may need a visa from the country they're visiting.</p>\n<p>Files containing people's personal data will be kept for about three years after their departure, according to the EU. If no exit was recorded, the data will be kept for five years. Exemptions are available to family members of EU citizens and some non-EU nationals.</p><p>The EU said the new system has been in the works for nearly a decade as Europe saw a <span class=\"link\">mass migration</span> of people fleeing Africa and the Middle East for the continent. The expected unveiling of the changes comes on the heels of President Trump's criticism of European leaders' immigration policies in his address at the U.N. General Assembly in New York. </p>\n\n<p>\"Your countries are going to hell,\" Mr. <span class=\"link\">Trump said</span> Tuesday. \"It's time to end the failed experiment of open borders.\"</p><h2>Where will Europe's new Entry/Exit System be used?</h2><p>The system will be used in 29 countries, most of which are in the EU. Four nations that aren't in the bloc — Iceland, the small principality of Liechtenstein, Norway and Switzerland — will also implement the new requirements. Two EU members, Cyprus and Ireland, will not.</p>\n<p>Here's a complete list of the countries that will use the new system:</p><ul><li>Austria</li><li>Belgium</li><li>Bulgaria</li><li>Croatia</li><li>Czechia</li><li>Denmark</li><li>Estonia</li><li>Finland</li><li>France</li><li>Germany</li><li>Greece</li><li>Hungary</li><li>Iceland</li><li>Italy</li><li>Latvia</li><li>Liechtenstein</li><li>Lithuania</li><li>Luxembourg</li><li>Malta</li><li>Netherlands</li><li>Norway</li><li>Poland</li><li>Portugal</li><li>Romania</li><li>Slovakia</li><li>Slovenia</li><li>Spain</li><li>Sweden</li><li>Switzerland</li></ul><p>The U.K. officially <span class=\"link\">separated from the EU</span> in 2020 after being part of the bloc for 47 years. While it isn't part of the new system, the U.K. started requiring international travelers earlier this year to get an electronic travel authorization to visit the country, which includes Northern Ireland. </p><p>Each application for an authorization costs 16 pounds, or about $22, and lasts two years or until the traveler's passport expires, whichever comes first.</p><p>According to the State Department, Americans won't need an authorization if they're transferring through the U.K. on their way to another country and won't pass through border control. Travelers are urged to check with their airline if they are unsure.</p>\n<p class=\"content__meta--contributors\">\nTaylor  Johnston\n                  \n        contributed to this report.\n    </p>\n\n</section>\n</div></body></html>"
    }
  ]
}