{
  "title": "CBS News",
  "link": "https://www.cbsnews.com/",
  "description": "Latest news from CBS News",
  "items": [
    {
      "title": "Trump crackdown highlights judge vacancy crisis pushing D.C. courts to brink",
      "link": "https://www.cbsnews.com/news/dc-court-vacancies-trump-crime-crackdown/",
      "source": "CBS News",
      "pub_time": "2025-09-24T06:00:18-04:00",
      "description": "The D.C. courts have for years been hampered by judicial vacancies that have led to a backlog of cases and slowed the administration of justice.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p><em>Washington — </em>The Trump administration has touted its crime crackdown in Washington, D.C., in recent weeks, with increased arrest numbers and reduced violent crime. But the surge of resources to the nation's capital hasn't extended to its courts, which have been hampered by judicial vacancies that have led to a backlog of cases and slowed the administration of justice.</p><p>The crisis in the district's courts has persisted for years due to a high volume of open seats for judges. But whether, and when, it subsides rests with the president and Senate under the structure established by Congress more than 50 years ago. </p><p>Today, there are 13 vacancies on the D.C Superior Court, the district's trial court, and another two judges are on extended medical leave. By January, another two sitting judges are set to retire, which would leave 15 of the Superior Court's 62 seats unfilled.</p><p>On the D.C. Court of Appeals, two of its nine seats are open. One of those has been empty since November 2013, and neither have nominees awaiting approval by the Senate.</p><p>\"With vacancy rates nearing 25% on the trial court, we are set up to fail those who are depending on us for fair and timely legal outcomes,\" said Douglas Buchanan, spokesman for the D.C. Courts. \"Now, in today's reality, our ability to operate is simply not sustainable. It's the case today, and it only stands to grow worse for those we serve.\"</p>\n\n<h2>\"A lot of different gears\"</h2>\n<p>The vacancy crisis underscores the unique position the district holds as the nation's capital. While judges are elected by voters or appointed by governors in other jurisdictions, the president nominates and the Senate confirms judges to the local courts in D.C., just like they do for federal courts.</p><p>It's a process that Congress itself created under the District of Columbia Home Rule Act of 1973. The law established a seven-member Judicial Nomination Commission, which submits a list of three candidates to fill each vacancy on the Superior Court and Appeals Court. The president then selects a person from that list to nominate for Senate confirmation.</p><p>\"That requires a lot of different gears to all mesh up together when the District of Columbia doesn't even have a single senator in that room to say, 'Hey, this is important to the district,'\" said Joe Musso, president of the Trial Lawyers Association of Washington, D.C.</p><p>In recent years, presidents have <span class=\"link\">prioritized confirmations</span> to the federal courts, with Mr. Trump and President Joe Biden <span class=\"link\">appointing more than 230 federal judges</span>. But filling the vacancies on the D.C. courts has not been as important.</p>\n\n<p>In December, the Senate had a chance to approve 10 of Biden's picks to the local courts, but the nominees were blocked. Mr. Trump can now fill those seats with his own nominees.</p><p>For its part, the Judicial Nomination Commission has submitted to the president a list of candidates for every existing vacancy on the Superior Court and Appeals Court. </p><p>Mr. Trump, meanwhile, has made four nominations to the D.C. Superior Court, and one is poised for a vote by the full Senate after advancing out of the Homeland Security and Governmental Affairs Committee in July. Two of the president's four nominees are for vacancies that have existed since 2020.</p><p>\"President Trump has been focused on filling vacancies in Superior Court and I strongly agree,\" Jeanine Pirro, the U.S. attorney for the District of Columbia, said in a statement to CBS News. \"Not having enough judges is not only bad for the District, the prosecutors, and the attorneys, it's bad for those individuals who are awaiting a trial that will impact their civil liberties.\"</p><p>While the Senate Judiciary Committee oversees nominations to the federal courts, the Homeland Security and Governmental Affairs Committee handles confirmation hearings for picks to the D.C. courts. </p><p>A spokesman for Sen. Rand Paul, a Kentucky Republican who chairs the Homeland Security Committee, told CBS News that the panel is processing the three other nominations \"according to our standing rules and procedures and will announce a hearing at the appropriate time.\"</p><p>Still, it's unclear whether there is broad appetite in the Senate to move the president's picks for the D.C. courts, particularly as lawmakers face a fast-approaching Sept. 30 deadline to fund the government and are under pressure to approve a backlog of Mr. Trump's executive branch nominees.</p>\n\n<p>Meanwhile, cases filed in the Superior Court continue to stack up. In the criminal division, trials for people accused of the most serious felony offenses are being scheduled into late 2027 and early 2028, Buchanan said.</p><p>\"This is not fair to the victims of these very serious crimes, nor to the defendants who stand accused and in custody while they await their day in court,\" he said.</p><h2>An \"urgent\" crisis</h2>\n<p>Mr. Trump's crackdown on D.C. came in response to what he claimed is rampant crime that has made the nation's capital a dangerous place to live and visit, despite data showing that crime had been falling in recent years. Last month, the president <span class=\"link\">deployed the National Guard</span> to the district and placed the Metropolitan Police Department under federal control for 30 days, authority granted to him under the Home Rule Act.</p><p>While the 30-day takeover of the local police department <span class=\"link\">expired on Sept. 10</span>, National Guard troops will <span class=\"link\">remain on district streets</span> through November. Muriel Bowser, the mayor of D.C., has said local police will continue close coordination with federal law enforcement indefinitely. </p><p>As part of Mr. Trump's plans to address what he says is a \"crime emergency\" in the capital, the president signed an executive order last month that calls on prosecutors to pursue federal charges and <span class=\"link\">pretrial detention</span> for people arrested in the district.</p><p>But government lawyers with the U.S. Attorney's Office in D.C, led by Pirro, have <span class=\"link\">struggled to secure indictments</span> in a string of recent cases. In at least one of those, involving a now-fired <span class=\"link\">Justice Department employee</span> accused of <span class=\"link\">throwing a sandwich</span> at a federal officer, prosecutors filed a misdemeanor charge, which doesn't require a grand jury indictment.</p><p>Pirro's office also prosecutes felony offenses and most misdemeanors committed by adults in the local trial court. From January through March, the most recent data publicly available, there was a slight uptick in felony prosecutions and cases charged in the Superior Court compared to the first three months of 2024.</p>\n\n<p>But the president's efforts to tamp down on crime and the alleged perpetrators are meeting a court system that has for years lacked a full complement of judges to hear and adjudicate cases.</p><p>\"You're looking at criminal defendants who are sitting in jail on nothing more than a charge, and they're presumed innocent under the Constitution,\" Musso said.</p><p>The ballooning number of cases filed in the Superior Court began years before Mr. Trump's crackdown. From 2021 to 2024, the trial court saw an 83% increase in new case filings, data shows. For 2025, the Superior Court is on track to either meet or exceed the 56,627 new cases from last year.</p><p>For the criminal division, there were nearly 40% more felony cases filed between 2022 and 2023, and roughly 51% more misdemeanor cases brought by the U.S. Attorney's Office, according to data from the court.</p><p>In a branch of the Civil Division that handles most civil disputes, the number of cases on judges' calendars has nearly doubled to roughly 500.</p><p>\"This is urgent,\" said Tianna Gibbs, a law professor at American University in Washington who studies access to justice issues. \"We have a lot on the line: the administration of justice, access to justice and public confidence in the courts as a forum that can fairly and efficiently resolve their disputes.\"</p><p>Meg McKinney, a family law attorney who practices in D.C., said the high number of vacancies is a problem across the Superior Court, but she believes the impact is more acutely felt in the Criminal and Family Court Operations divisions.</p>\n\n<p>\"You're already dealing with families who have a fair amount of crisis or dysfunction, and they're basically just twisting in the wind while they make their way through the court system,\" she said.</p><p>In the family court, there were between four and six vacancies throughout 2024, and a 46% spike in new or reopened cases from 2020 to 2024, according to an annual report to Congress submitted in March. In its Domestic Relations Branch, which processes cases for divorce, custody and adoptions, among other areas, initial hearings are taking place before a magistrate judge to help ensure families can get into court quickly. </p><p>But even for the small number of cases that go to trial, it can take more than a year to get a trial date, and securing consecutive days on the calendar is difficult. The wait for an actual decision may be even longer, since the time available for judges to write opinions is sparse.</p><h2>\"It feels like D.C. has been forgotten\"</h2>\n<p>Mr. Trump has heralded the operation in D.C. as a success, and <span class=\"link\">crime in the district has dropped</span> significantly since he deployed National Guard troops and other federal law enforcement officers to the district. But local officials have urged the president and the federal government to assist D.C. in other ways.</p><p>\"We have 15 vacancies in the Superior Court, which we need to go down to the Congress for approval. We have two vacancies in the Court of Appeals which we need to go down,\" Bowser, the mayor, told MSNBC in an interview last month. \"So anytime you have a backlog in the courts you have delayed justice and people are less safe.\"</p><p>Eleanor Holmes Norton, a Democrat who represents D.C. in the House as a nonvoting delegate, warned last month that the D.C. courts are facing a \"perpetual vacancy crisis\" because of Senate inaction. She said the number of open seats on the Superior Court is \"significantly impeding D.C.'s ability to try criminal cases in court, harming public safety and access to justice.\"</p><p>Norton introduced legislation in July that would give the D.C. Council authority over the jurisdiction and organization of the local courts. She has also proposed plans that would allow judicial nominees to the D.C. courts to be appointed without approval by the Senate after a 30-day congressional review period.</p>\n\n<p>But D.C. officials have been sounding the alarm about the vacancy crisis for years, though their appeals for help have gone unanswered. Letters sent from members of the D.C. Council, legal organizations and even sitting D.C. judges have not moved the White House or Senate to action.</p><p>\"It feels like a problem where the grievance is not going to get to the person who has control of moving the levers in the process,\" said Gibbs, the American University law professor. \"It feels like D.C. has been forgotten in this way and there's no way to appeal to the powers that be to address the problem.\"</p><p>Lawyers in the district pin the blame on its lack of representation in the Senate, which has left residents without a voice to pressure senators to act.</p><p>\"No other jurisdiction has to go through all the hoops to get the courthouse filled with reasonable arbiters of the facts and the law,\" Musso said. \"And when it does, it has to appeal to a Senate that has no representation.\"</p><p>Some senators in neighboring states have taken up the cause. In the last Congress, Sen. Tom Carper, a Democrat from Delaware, and senators from Virginia and Maryland introduced legislation that would streamline the nomination and confirmation process for D.C. judicial picks. But the Senate didn't act on the plan, and Carper retired last year.</p><p>Carper told CBS News in an interview before his term ended that \"the way we treat the District of Columbia, especially with respect to selection of the judges, is, I think, shameful.\"</p><p>\"We basically say, you know, 'You can come up with all the names within the district of who you think ought to be a judge, and we'll take our good old time to figure out if we're ever going to confirm some of these judges,'\" Carper said.</p>\n\n<p>That approach by the Senate has led to concerns that its delays in confirming D.C. judicial nominees is damaging the public's trust in the judicial system.</p><p>\"The issue is that there's just this divide where the people who do have control over the process don't understand the impact that the delay in confirmations is having on D.C. families. And then the D.C. families don't understand how the process is working,\" Gibbs said. \"In their eyes, the delay is the problem of the court. Families begin to view the court as a broken system that doesn't meet the commitment that it has to the public, which is to administer justice in a way that is efficient, that is fair, that allows families to have the opportunity to be heard before the court.\"</p><p>The Republican-controlled House has begun to take legislative steps related to the D.C. courts, and it has moved swiftly to exert its control over the district. GOP Rep. Pete Sessions of Texas introduced legislation earlier this month that would dismantle the D.C. Judicial Nomination Commission, and the House approved it in a party-line vote last week. It's unclear whether it would garner the 60 votes needed in the Senate to advance.</p><p>In a letter to Congress, the members of the commission said D.C.'s judicial nomination process is \"one of the best nonpartisan processes\" in the nation and noted that Mr. Trump engaged in it during his first term and earlier this month with his nominations.</p><p>\"The Commission process has been effective for over 50 years, working with both Republican and Democratic administrations,\" members wrote in a Sept. 9 letter. \"Our process is carefully designed to ensure that the over 700,000 residents of our city have a voice in judicial appointments, while also respecting the President's authority in nominating individuals for the critical role of judicial service in the District of Columbia.\"</p><p>But allies of Mr. Trump and The Heritage Foundation, a conservative think tank, have denounced the seven-member commission as composed of \"leftists\" and said the judicial appointment scheme, which was codified by Congress in 1973, is questionable under the Constitution. Members of the panel are appointed by the president, mayor, D.C. Council, D.C. Bar and the chief judge of the U.S. district court in the district.</p><p>The member tapped by the chief judge in D.C. is <span class=\"link\">Judge Tanya Chutkan</span>, who presided over the <span class=\"link\">criminal case against the president</span> brought by then-special counsel Jack Smith involving his alleged attempt to hold onto power after the 2020 election. The <span class=\"link\">charges were dropped</span> in November after Mr. Trump won the election.</p>\n\n<p>While the House moved swiftly on Sessions' plan for the nomination commission, there's been no action on Norton's proposal related to the D.C. courts, and the Senate Homeland Security and Governmental Affairs has not scheduled hearings for Mr. Trump's nominees.</p><p>For stakeholders who have watched the vacancies in the D.C. courts languish for years, successfully securing an appointment to the D.C. courts appears to be a daunting task, requiring cooperation between three different bodies: the Judicial Nomination Commission, the president and the Senate.</p><p>But Musso said the consequences of continued inaction are severe.</p><p>\"When you're waiting years for justice, those years are filled with angst and difficulty and stress that you would otherwise not have but for these delays,\" he said. \"Real people are involved here. Real human beings need our justice system.\"</p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Super Typhoon Ragasa pummels Hong Kong after killing 14 people in Taiwan",
      "link": "https://www.cbsnews.com/news/super-typhoon-ragasa-china-hong-kong-taiwan-deaths/",
      "source": "CBS News",
      "pub_time": "2025-09-24T05:14:48-04:00",
      "description": "Densely populated Hong Kong is being slammed by its most powerful storm in years, with Super Typhoon Ragasa packing hurricane-force winds and a dangerous storm surge.",
      "image_url": "",
      "content": "<html><body><div><article class=\"content content-article lazyload\" data-index=\"0\" data-path=\"/news/super-typhoon-ragasa-china-hong-kong-taiwan-deaths/\" id=\"article-0\">\n\n\n\n<section class=\"content__body\">\n<p>Super Typhoon Ragasa pummeled Hong Kong on Wednesday morning with a ferocity not witnessed in the city for years. Ragasa brought hurricane-force winds, torrential rain and a storm surge that left a trail of destruction in densely populated Hong Kong.</p><p>A river of sea water crashed through the lobby of a luxury hotel, sending people and glass flying.</p><p>In neighboring Taiwan, Ragasa had already brought rains heavy enough to breach a dam, unleashing a wall of water that killed 14 people downstream and washed away a bridge.</p>\n<p>Hundreds of thousands of people had to be evacuated from low lying areas in southern China as what's been dubbed by local media the \"King of Storms\" lashed the coastline.</p><p>A weather station in the town of Chuandao recorded a gust of about 150 mph on Wednesday afternoon, according to The Associated Press, setting a local record. At that strength the typhoon would likely be the equivalent of a strong <span class=\"link\">Category 3 or a Category 4 hurricane</span>.</p><p>My own family and I live close to the water in Hong Kong, and it was too close for comfort as a violent storm surge turned a normally calm estuary into a menacing threat.</p>\n\n<p>We thought we'd passed the worst of the storm — high tide had come and gone — but then suddenly the huge surge of water rose toward us, with waves crashing into our front yard. In some areas the waves were higher than lamp posts.</p>\n<p>The flooding trapped me and my children for a while, but we were lucky, managing to weather the storm and, thanks to piles of sandbags, keep our home dry.</p><p>Not everyone in the city of some 7.5 million people was as fortunate to walk away unscathed.</p><p>Super Typhoon Ragasa was heading toward southern China's Guandong Province on Wednesday, where almost 2 million people had been relocated to higher ground.</p>\n\n<p>The storm is forecast to lose some of its intensity as it continues on its path Wednesday, but already it has been one of the most powerful storms seen across the globe this year.</p>\n\n</section>\n</article>\n</div></body></html>"
    },
    {
      "title": "Author of bestseller on opioids in Appalachia helps women fight addiction",
      "link": "https://www.cbsnews.com/news/barbara-kingsolver-author-opioids-appalachia/",
      "source": "CBS News",
      "pub_time": "2025-09-24T05:00:16-04:00",
      "description": "Barbara Kingsolver won a Pulitzer Prize for her bestselling novel about Appalachia's drug crisis. She invested some of the proceeds into a home for women trying to beat substance use disorders.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p><em>Pennington Gap, Va.</em> — On a Saturday evening in June, people of this rural region gathered at the historic Lee Theatre to celebrate the founding of Higher Ground Women's Recovery Residence.</p><p><span class=\"link\">Author Barbara Kingsolver</span> opened the facility in January with royalties from her Pulitzer Prize-winning novel, \"Demon Copperhead,\" whose plot revolves around Appalachia's opioid crisis. The home offers a supportive place for people to stay while learning to live without drugs. Kingsolver had asked the women now living there to join her on stage.</p><p>Kingsolver, who grew up in Appalachia, suggested the women share with the audience what they were most proud of having gained from their first weeks at Higher Ground. But she learned they were more eager to brag on one another.</p><p>Supporters say Higher Ground provides stability and a reentry point after leaving jail, prison, or a treatment center. It offers a range of services and support in an area devastated by addiction to painkilling pills and other types of opioids. Most fundamentally, it's a true home, with one- and two-person bedrooms, a communal kitchen, and a den. Residents say they have found affirmation from a cohort of women who understand how addiction can demoralize a person and estrange them from family and community.</p>\n<p>Ronda Morgan, a resident, said her family has always been in her corner. But while she was serving a jail sentence for drug possession, she told herself, \"I'm sick of them having to do time with me.\" She was ready for recovery. Her daughter, who's a nurse, told her about Higher Ground, the first facility of its kind in sprawling, rural Lee County. Morgan learned she could live there for up to two years to gain the footing that had eluded her in three-plus decades of addiction.</p>\n\n<p>What she didn't anticipate was the kinship she forged with her housemates — among them, Syara Parsell — and with Higher Ground's staff.</p><p>Parsell, 35, one of Higher Ground's first residents, said that in her time there she's received help finding employment and enrolling in community college courses.</p><p>From the staff and Kingsolver, Parsell said, she has received judgment-free support. \"Together,\" she said, \"we figure it out.\"</p>\n<p>Traditional treatment facilities typically operate under highly structured medical supervision. Recovery houses, like Higher Ground, offer a more relaxed environment, helping move a resident \"toward being an independent, fully functional, self-reliant human being,\" said Marvin Ventrell, CEO of the National Association of Addiction Treatment Providers.</p>\n\n<p>\"Recovery occurs in the community,\" he said. But reentry must be approached delicately. \"When addiction occurs with a human being, it also occurs within a family social structure.\" If a person in early recovery returns to a family that's unprepared, that person's chances of success \"are severely diminished.\"</p><p>For Kingsolver, the opioid crisis became a focal point for what she hoped would be \"the great Appalachian novel.\" The epidemic \"has changed so much of the texture of this place,\" devastating families and communities.</p><p><span class=\"link\">Pharmaceutical companies</span> targeted central Appalachia for sales of what they falsely claimed were addiction-resistant prescription opioids. Kingsolver wanted to \"cast my net back over all of the extractive industries that have come to this place, taken out what was good, and left behind a mess.\"</p><p>\"The way I put it is, 'They came to harvest our pain when there was nothing else left,'\" she said.</p><p>In research for \"Demon Copperhead,\" she immersed herself in the stories of people who've navigated addiction and those who care and advocate for them.</p><p>The novel has been an enormous success, having sold more than 3 million copies and earning far more than her previous works. Kingsolver decided to dedicate hundreds of thousands of dollars to address the crisis that has overwhelmed the region where she was raised — and to which she returned full-time in 2004.</p>\n<p>Again, she set about listening. Drawing on a wide range of expertise, she determined that a women's recovery home was the wisest investment.</p>\n\n<p>Joie Cantrell works as a public health nurse in harm reduction for the Virginia Department of Health, supporting policies and practices to curb the negative effects of drug use, and serves as Higher Ground's board chair. She had long recognized the need for just such a home.</p><p>\"That was the part that was missing,\" Cantrell said. Too often, when someone would come out of a treatment facility or incarceration, \"we lost them. They fell back into the same old patterns.\" She said the region sorely needed a safe, stable environment where women could recalibrate.</p><p>By August, the home reached its capacity of seven women. It's right in town, \"which is so important,\" Kingsolver said, \"because in this part of the country we have no public transportation.\"</p><p>Parsell has long suffered from social anxieties; drugs were her escape. Here, her housemates embraced her. They've offered the support she'd never experienced.</p><p>\"Every two seconds, someone's like, 'Syara's here!'\" she said. \"I'm very grateful for it.\" If there's an issue in the house, \"one of the seven of us has the solution.\"</p><p>Four residents are employed outside the home, one is enrolled in community college classes, one is completing her GED with plans to continue her education, and everyone volunteers in the community. Crafting classes are offered. Family members visit.</p><p>\"They're living life,\" said Subrenda Huff, who was filling in while director Liz Brooks took maternity leave.</p>\n<p>Morgan said she accomplished more in a month at Higher Ground than she had in years. That includes applying for identification documents, taking budgeting classes, and seeking permanent housing. It includes sharing upkeep duties in the house.</p>\n\n<p>Such was Kingsolver's vision. But, she said, \"here's what I didn't expect: The community embraced this with loving arms. I thought maybe people would say, 'I don't want this in my backyard.'\"</p><p>Most of the furniture was donated. Kingsolver's quarter-million or so social media followers have been instrumental in that. \"But it's not just book clubs in Switzerland or in California; it's people in Pennington Gap,\" she said. Church groups have donated \"quilts, bedside lamps, things to hang on the walls just to make it homey.\"</p><p>Before the facility opened, local folks volunteered to pull weeds, take down an old fence, and put up a new one. Kingsolver said the well of support \"has been just endless. It's been deep, and loving, and a wonder to see.\"</p><p>Higher Ground, with only one paid staff member, has estimated yearly operating costs of $120,000, Cantrell said. Residents are charged $50 a week. Ventrell said that fees at other recovery houses vary widely but that $2,500 a month is an approximate average.</p><p>\"We want them to focus on saving money and paying any restitution or fines they may have from past charges,\" Cantrell said. \"Some may be focused on repaying child support they may owe.\"</p><p>Higher Ground receives no federal or state <span class=\"link\">funding</span>. Donations continue to pour in. And Kingsolver recently bought the building next door with plans to open a thrift shop, which would be a source of additional income for the home and offer retail work experience for its residents.</p><p>Supporters aspire to open more Higher Ground homes elsewhere in the region.</p>\n\n<p>What these women are gaining, Kingsolver said, \"is not just sobriety, but belief in themselves.\"</p><p><em>KFF Health News</em><em> is a national newsroom that produces in-depth journalism about health issues and is one of the core operating programs at </em><em>KFF</em><em> — the independent source for health policy research, polling, and journalism.</em></p>\n<aside class=\"component list recirculation component--type-recirculation component--type-recirculation-collection\">\n<div class=\"component__heading-wrapper\">\n<h3 class=\"component__title\">America's Opioid Epidemic\n                          \n                More\n                <svg aria-hidden=\"true\" class=\"icon__caret-right\" viewbox=\"0 0 32 32\">\n\n</svg>\n\n</h3>\n</div>\n</aside>\n</section>\n</div></body></html>"
    },
    {
      "title": "Mexican national, former DACA recipient dies in ICE custody after arrest in August",
      "link": "https://www.cbsnews.com/news/mexican-national-dies-in-ice-custody-adelanto/",
      "source": "CBS News",
      "pub_time": "2025-09-24T04:03:47-04:00",
      "description": "The 39-year-old man was scheduled for surgery on an abscess when he died, ICE officials said.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>A Mexican national and former DACA recipient died in the custody of U.S. Immigration and Customs Enforcement on Sunday, according to federal authorities. </p><p>Ismael Ayala-Uribe, 39, was arrested by ICE agents on Aug. 17 during an enforcement operation, said a news release from ICE. He was transferred to the Adelanto ICE Processing Center on Aug. 22 for immigration proceedings.</p><p>While detained, agents say that Ayala was evaluated by an on-call medical provider on Sept. 18. He was provided medication, according to ICE, and returned to his dormitory before he was later referred to the hospital on Saturday for further evaluation of an abscess on his buttock. </p><p>Ayala was scheduled for surgery and was \"hypertensive and displayed normal tachycardia,\" the release said. At around 1:50 a.m., hospital staff declared Ayala unresponsive, and less than an hour later, he was pronounced dead despite attempted lifesaving measures, according to ICE.</p><p>While speaking with CBS News, Ayala's mother said that he died after suffering cardiac arrest.</p>\n\n<p>\"Saturday was the last time I visited him,\" Lucia Ayala told CBS News in Spanish. \"He looked very pale and his hands appeared red.\" </p>\n<p>The San Bernardino County Sheriff's Department is also investigating the manner and cause of death, they told CBS News Los Angeles.</p><p>Ayala's family said that he was in good health when he was transferred to Adelanto. They told Ayala to receive medical care, as they could see he was sick when they visited him every Saturday after he was detained in Fountain Valley, an Orange County suburb. He allegedly told them that he wasn't provided medical care by facility officials. </p><p>He is the 14th detainee to die in ICE custody since President Trump took office in January, and the first-known death in California's immigration detention centers.</p>\n\n<p>In a statement, ICE stated that emergency care is not denied for detainees in custody. </p><p>\"ICE remains committed to ensuring that all those in its custody reside in safe, secure and humane environments,\" said the statement. \"Comprehensive medical care is provided from the moment individuals arrive and throughout the entirety of their stay.\"</p><p>ICE said it notified the Department of Homeland Security and the Consulate of Mexico of the death, among other government agencies. </p><p>In June, Democratic members of Congress toured the Adelanto detention facility amid reports of deteriorating conditions, lack of access to food, water, and medication. Rep. Luz Rivas of California was among the group and in a statement said \"the conditions we saw inside the Adelanto ICE Detention Center prove that Donald Trump's policies are putting our most vulnerable in harm's way.\"</p><p>In an emotional interview, Ayala says her son was loved by his family, friends and his long-time car wash clients. </p><p>The Mexican national worked at a car wash in the Los Angeles area for over 15 years, but was detained by federal agents on Aug. 17 during an immigration enforcement operation. Ayala-Uribe was transferred to Adelanto. </p><p>The Obama-era Deferred Action for Childhood Arrivals policy, <span class=\"link\">or DACA</span>, is the federal program that allowed undocumented immigrants brought to the U.S. as children to live and work in the country without fear of deportation.</p>\n\n<p>Ayala-Uribe was brought to the U.S. at the age of four and became a DACA recipient in 2012. In 2016, his DACA renewal was denied. Ayala-Uribe was convicted of his first DUI in 2015 and sentenced to three years probation, according to ICE. He was convicted of his second DUI in 2019 and sentenced to 120 days in jail and five years of probation. </p><p>Ayala-Uribe's detention occurred as car wash locations have become targets for the Trump administration's crackdown on illegal immigration in L.A. According to the executive director of the Clean Carwash Worker Center, at least 247 carwash workers were detained from June to September in the L.A. area, with 81 car wash businesses raided. </p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "United Airlines briefly grounds all flights across U.S. and Canada",
      "link": "https://www.cbsnews.com/news/united-airlines-ground-stop-us-canada-connectivity-issue/",
      "source": "CBS News",
      "pub_time": "2025-09-24T02:46:05-04:00",
      "description": "United Airlines asked the FAA to issue a ground stop for its flights in the U.S. for the second time in less than two months, citing a technical problem.",
      "image_url": "",
      "content": "<html><body><div><article class=\"content content-article lazyload\" data-index=\"0\" data-path=\"/news/united-airlines-ground-stop-us-canada-connectivity-issue/\" id=\"article-0\">\n\n\n<section class=\"content__body\">\n<p>All United Airlines flights departing in the U.S. and Canada were briefly suspended Tuesday night, as the airline asked the Federal Aviation Administration to issue a ground stop over an unspecified technological issue.</p><p>United, which grounded its flights for about half an hour, said it had \"experienced a brief connectivity issue just before midnight Central time on Tuesday, but has since resumed normal operations.\"</p><p>It was the second time in less than two months that the U.S. airline had requested a halt to its departures over an unspecified technical glitch. In early August, <span class=\"link\">United flights were subjected to ground stop</span> across major U.S. airports including Newark, Denver, Houston and Chicago, which lasted several hours. </p>\n<p>The airline said at the time that it was a \"technology issue,\" which caused widespread delays throughout its network.</p>\n\n</section>\n</article>\n</div></body></html>"
    },
    {
      "title": "Jimmy Kimmel delivers first monologue since show was taken off the air",
      "link": "https://www.cbsnews.com/news/jimmy-kimmel-first-monologue-since-suspension/",
      "source": "CBS News",
      "pub_time": "2025-09-24T00:34:00-04:00",
      "description": "Jimmy Kimmel returned to his late-night show just less than a week after network broadcaster ABC pulled \"Jimmy Kimmel Live!\" over remarks he made about the assassination of conservative activist Charlie Kirk.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>Jimmy Kimmel <span class=\"link\">returned to his</span> long-running late-night show Tuesday, less than a week after network broadcaster ABC pulled \"Jimmy Kimmel Live!\" over remarks he made about <span class=\"link\">the assassination</span> of conservative activist Charlie Kirk. </p><p>\"It's been overwhelming...I've heard from all the people in the world over the last six days,\" Kimmel joked to open his monologue, going on to thank all those who came out in his defense, including conservatives. </p><p>\"Most of all, I want to thank the people who don't support my show and what I believe, but support my right to share those beliefs anyway,\" Kimmel said. \"I never would have imagined that Ben Shapiro, Clay Travis, Mitch McConnell, Rand Paul, even my old pal Ted Cruz, who believe it or not said something very beautiful on my behalf. It takes courage for them to speak out against this administration. They did and they deserve credit for it.\"</p><p>The Walt Disney Company, which owns ABC, had announced Monday that Kimmel would return to the air. </p><p>It followed a political and media firestorm that began after the comedian addressed Kirk's slaying in a Sept. 15 monologue, saying: \"We hit some new lows over the weekend with the MAGA gang trying to characterize this kid who murdered Charlie Kirk as anything other than one of them, and doing everything they can to score political points from it.\"</p>\n\n<p>An emotional Kimmel on Tuesday said that \"it's important to me as a human, and that is, you understand that it was never my intention to make light of the murder of a young man. I don't think there's anything funny about it,\" noting that he had taken to social media following Kirk's killing to send his condolences to Kirk's family. </p><p>Kimmel didn't issue a blanket apology for his monologue remarks last week, but said he understood how it was offensive to some. </p><p>\"Nor was it my intention to blame any specific group for the actions of what was obviously a deeply disturbed individual,\" Kimmel said of the suspected gunman. \"That was really the opposite of the point I was trying to make. But I understand that to some, that felt either ill-timed or unclear, or maybe both. And for those who think I did, point a finger, I get why you're upset. If the situation was reversed, there's a good chance I'd have felt the same way.\"</p><p>Kimmel gave a brief explanation for what took place behind the scenes between himself and ABC's brass.</p>\n\n<p>\"I was not happy when they pulled me off the air on Wednesday,\" Kimmel said. \"I did not agree with that decision, and I told them that, and we had many conversations. I shared my point of view, they shared theirs. We talked it through, and at the end, even though they didn't have to, they really didn't have to, this is a giant company…they welcomed me back on the air.\"</p><p>On Tuesday night, before the show aired on the East Coast, Mr. Trump wrote on Truth Social, \"I can't believe ABC Fake News gave Jimmy Kimmel his job back. The White House was told by ABC that his Show was cancelled!\" </p><p>He went on, \"I think we're going to test ABC out on this. Let's see how we do. Last time I went after them, they gave me $16 Million Dollars,\" Mr. Trump said in reference to his defamation lawsuit last year against ABC News over remarks made by anchor George Stephanopoulos, which the network <span class=\"link\">settled in December</span> by agreeing to contribute $15 million to Mr. Trump's presidential foundation and museum, and another $1 million toward Mr. Trump's legal fees.</p><p>\"This one sounds even more lucrative,\" Mr. Trump wrote Tuesday. \"A true bunch of losers!\"</p><p>Kimmel told his audience Tuesday that the president \"made it very clear he wants to see me and the hundreds of people who work here fired from our jobs. Our leader celebrates Americans losing their livelihoods because he can't take a joke.\"</p><p>\"One thing I did learn from Lenny Bruce and George Carlin and Howard Stern, is that a government threat to silence a comedian the president doesn't like, is anti-American,\" he added. </p><p>In a Sept. 17 interview with right-wing podcaster Benny Johnson, Federal Communications Commission Chair Brendan Carr called Kimmel's remarks \"some of the sickest conduct possible,\" and said there was a \"path forward for suspension over this.\"</p>\n\n<p>\"The FCC is going to have remedies we could look at,\" Carr told Johnson. \"We can do this the easy way or the hard way.\"</p><p>Within hours of that interview, station operator Nexstar announced it would preempt Kimmel's show over the remarks. Nexstar owns and operates more than 200 stations nationwide, including more than two dozen ABC affiliates. Nexstar has a deal pending to purchase Tegna, a smaller rival, <span class=\"link\">for $6.2 billion</span>, and needs the Federal Communications Commission to approve it. </p><p>A Nexstar spokesperson told CBS News last week that the decision to preempt Kimmel's show was \"made unilaterally by the senior executive team at Nexstar, and they had no communication with the FCC or any government agency prior to making that decision.\"</p><p>ABC later said that it was \"indefinitely\" suspending the show. </p><p>Another major station owner, Sinclair Broadcast Group, also said last week that it was pulling Kimmel's show.</p><p>Despite its return to ABC on Tuesday night, both Nexstar and Sinclair said they would <span class=\"link\">continue to preempt</span> Kimmel's show.</p><p>Sinclair on Monday night posted a statement on X saying it will preempt \"Jimmy Kimmel Live!\" across its ABC affiliate stations and will be \"replacing it with news programming\" beginning Tuesday night. \"Discussions with ABC are ongoing as we evaluate the show's potential return,\" Sinclair said. </p>\n\n<p>Nexstar on Tuesday said it will continue to preempt \"Jimmy Kimmel Live!\" and \"monitor the show as it returns to ABC.\"</p><p>Regarding Carr, Kimmel on Tuesday showed the audience a social media post that the FCC chair wrote in May 2022 in which he said, \"Political satire is one of the oldest and most important forms of free speech. It challenges those in power while using humor to draw more people in to the discussion. That's why people in influential positions have always targeted it for censorship.\"  </p> <p>Disney on Monday did not delve into the details of what led to its decision to allow Kimmel's show to resume, only saying in a statement that the initial suspension was \"to avoid further inflaming a tense situation at an emotional moment for our country,\" calling his comments \"ill-timed and thus insensitive.\"</p><p>\"We have spent the last days having thoughtful conversations with Jimmy, and after those conversations, we reached the decision to return the show on Tuesday,\" Disney said.</p><p>The temporary removal of Kimmel's show sparked a nationwide debate over issues of free speech and censorship. Many in the Hollywood community rallied to Kimmel's side, with more than 400 celebrities — including actors Tom Hanks and Meryl Streep — signing an open letter with the American Civil Liberties Union that criticized the move as \"a dark moment for freedom of speech in our nation.\"</p><p>Conservatives upset with Kimmel's comments about Kirk praised the decision, including President Trump, who congratulated ABC on his Truth Social platform \"for finally having the courage to do what had to be done.\" </p><p>Mr. Trump <span class=\"link\">also speculated</span> last week whether networks that cover him negatively should have their broadcast licenses revoked. </p>\n\n<p>\"They give me only bad publicity or press,\" the president told reporters on Sept. 18. \"I mean, they're getting a license. I would think maybe their license should be taken away. It will be up to Brendan Carr.\"</p><p>But one prominent conservative, Republican Sen. Ted Cruz of Texas, was specifically critical of Carr's comments to Johnson. </p><p>\"I gotta say, that's right out of 'Goodfellas,'\" <span class=\"link\">Cruz said</span> Friday on his podcast. \"That's right out of a mafioso coming into a bar, going, 'nice bar you have here, it'd be a shame if something happened to it.'\" </p><p>Kimmel's show, which launched in 2003, tapes in front of a studio audience on Hollywood Boulevard in Los Angeles. The guests for Tuesday's show included actor Glen Powell and singer Sarah McLachlan. </p>\n<p class=\"content__meta--contributors\">\nJoe  Walsh, \n                                                  \n                                  Aimee  Picchi, \n                                                  \n                                  Kathryn  Watson and \n                                                  \n                                  Mary  Cunningham\n                  \n        contributed to this report.\n    </p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "White House suggests U.N. escalator mishap with Trump \"doesn't look like a coincidence\"",
      "link": "https://www.cbsnews.com/news/trump-un-escalator-teleprompter-united-nations-white-house/",
      "source": "CBS News",
      "pub_time": "2025-09-23T23:20:00-04:00",
      "description": "A malfunctioning escalator and teleprompter at the United Nations' headquarters drew President Trump's frustration.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>A malfunctioning escalator and teleprompter at the United Nations' New York City headquarters drew President Trump's frustration on Tuesday — though the U.N. says a videographer from Mr. Trump's delegation may have triggered the escalator's safety shutoff.</p><p>Shortly after Mr. Trump and first lady Melania Trump entered U.N. headquarters to address world leaders at this year's General Assembly session, they stepped onto an escalator. But the machine ground to a halt almost immediately, forcing both Trumps to start climbing the stairs on their own, videos of his arrival show.</p><p>Later, as Mr. Trump began his speech to the General Assembly, he remarked that his teleprompter wasn't working. \"I can only say that whoever's operating this teleprompter is in big trouble,\" the president said, drawing laughs from the audience.</p><p>The president brought up the two mishaps later in his speech, framing them as metaphors for what he views as the incompetence of the United Nations — which he accused of offering up little more than \"empty words.\"</p><p>\"All I got from the United Nations was an escalator that, on the way up, stopped right in the middle. If the first lady wasn't in great shape, she would've fallen,\" the president said. \"These are the two things I got from the United Nations: a bad escalator and a bad teleprompter.\"</p>\n<p>White House press secretary Karoline Leavitt later floated a different explanation, writing in a post on X: \"If someone at the UN intentionally stopped the escalator as the President and First Lady were stepping on, they need to be fired and investigated immediately.\"</p>\n\n<p>Leavitt shared a screenshot from a Times of London article that reported U.N. workers had been overheard joking they might intentionally shut off escalators during Mr. Trump's visit and blame funding shortfalls. There is no evidence that U.N. staff followed through on those jokes.</p><p>The press secretary later told Fox News that the Secret Service is looking into the matter.</p><p>\"When you put all of this together, it doesn't look like a coincidence to me,\" Leavitt said on Fox News' \"Jesse Watters Primetime.\" \"And if we find that these were U.N. staffers who were purposefully trying to trip up, literally trip up, the president and the first lady of the United States, well, there better be accountability for those people.\"</p><p>However, a U.N. spokesman said Tuesday the escalator may have suddenly stopped because of a videographer from the U.S. delegation who can be seen walking ahead of the president and first lady on the escalator, seemingly to film their arrival.</p>\n\n<p>\"A subsequent investigation, including a readout of the machine's central processing unit, indicated that the escalator had stopped after a built-in safety mechanism on the comb step was triggered at the top of the escalator. The safety mechanism is designed to prevent people or objects accidentally being caught and stuck in or pulled into the gearing. The videographer may have inadvertently triggered the safety function described above,\" Stéphane Dujarric, a spokesman for U.N. Secretary-General António Guterres, said in a statement.</p><p>Separately, a U.N. official told CBS News that the White House operated the teleprompter for Mr. Trump when it malfunctioned during his speech. </p><p>A federal law enforcement source confirmed to CBS News that the Secret Service is looking into the matter.</p><p>CBS News has reached out to the White House for comment.</p><p>Mr. Trump's speech came as his second administration distances itself from the U.N., withdrawing the U.S. from agencies like the Human Rights Council and the World Health Organization. The administration has also cut its financial contributions to the U.N. and criticized its approach to Israel.</p><p>\"The U.N. has such tremendous potential,\" the president said in his speech, \"but it's not even coming close to living up to that potential.\"</p>\n<p class=\"content__meta--contributors\">\nAaron  Navarro\n                  \n        contributed to this report.\n    </p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Camp Mystic plans to reopen in Texas next summer after flood that killed 27",
      "link": "https://www.cbsnews.com/news/camp-mystic-plans-to-reopen-in-texas/",
      "source": "CBS News",
      "pub_time": "2025-09-23T23:16:24-04:00",
      "description": "Camp Mystic has announced that it plans to reopen one of its Texas sites, where 27 girls and counselors died in a July flood.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>Less than three months after the devastating and deadly flooding in the Texas Hill Country, Camp Mystic plans to reopen part of its camp.</p><p>The camp's owners announced plans to reopen the Cypress Lake location, which is separate from the part of the camp that flooded in July, killing 27 girls and counselors.</p><p>In an email sent Monday to the families of the victims and obtained by the Associated Press, the camp said when it reopens, its planning and procedures will follow the \"requirements of the camp safety legislation you bravely championed.\" About an hour later, the camp sent an email to the rest of the families announcing the decision.  </p><p>The email states, \"We are not only rebuilding the cabins and trails, but also a place where laughter, friendship and spiritual growth will continue to flourish.\"</p><p>The camp also announced that it will build a memorial to the girls who died in the flooding.</p>\n\n<p>\"In the memorial's design, we will strive to capture the beauty, kindness and grace they all shared, while focusing on the joy they carried and will always inspire in us all,\" the email said.</p><p>The announcement means that Camp Mystic Cypress Lake, a sister site that opened to campers in 2020, will reopen next summer. But the 99-year-old Camp Mystic Guadalupe was too damaged to open next summer, according to the camp.</p><p>The email said leaders are \"working with engineers and other experts to determine how we will implement the changes required\" under the newly passed bills.</p><p>The campers and counselors were swept to their deaths when fast-rising floodwaters of the Guadalupe River roared through the girls' summer camp in a low-lying area known as flash flood alley. All told, the destructive flooding in Texas on the Fourth of July killed at least 136 people and washed away homes and vehicles.</p>\n\n<p>Camp Mystic parents successfully pushed for Texas to pass bills aimed at preventing similar tragedies. The measures aim to improve the safety of children's camps by prohibiting cabins in dangerous parts of flood zones and requiring camp operators to develop detailed emergency plans, to train workers and to install and maintain emergency warning systems. One allocates $240 million from the state's rainy day fund for disaster relief, along with money for warning sirens and improved weather forecasting.</p><p>\"It will hurt my family forever that, for reasons I still do not know, these protections were not in place nor thought out thoroughly for my daughter and the rest of the girls here,\" he said. \"Please pass this bill, protect our kids and do not let their deaths be in vain.\"</p>\n<aside class=\"component list recirculation component--type-recirculation component--type-recirculation-collection\">\n<div class=\"component__heading-wrapper\">\n<h3 class=\"component__title\">Central Texas Flooding\n                          \n                More\n                <svg aria-hidden=\"true\" class=\"icon__caret-right\" viewbox=\"0 0 32 32\">\n\n</svg>\n\n</h3>\n</div>\n</aside>\n</section>\n</div></body></html>"
    },
    {
      "title": "Americans detained by immigration agents speak out about treatment by agents",
      "link": "https://www.cbsnews.com/news/us-citizens-arrested-immigration-enforcement-treatment-agents/",
      "source": "CBS News",
      "pub_time": "2025-09-23T20:55:00-04:00",
      "description": "Several U.S. citizens have filed legal claims against the government​, alleging they were wrongfully detained and racially profiled — some said they were beaten by federal officers.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>Days after federal immigration agents detained Cary Lopez Alvarado, a 23-year-old Los Angeles native and U.S. citizen, she gave birth to a baby girl. </p><p>Lopez Alvarado and her now 3-month-old child are among some Americans who have been caught in the middle of the <span class=\"link\">Trump administration's immigration enforcement</span> and forced to prove their <span class=\"link\">citizenship</span> to gain their release from detention.</p><p>\"And they told me, OK, your baby is gonna be born here, but you're from Mexico, right?\" Alvarado recounted of the June arrest to CBS News. \"And I told them like, 'No, I was born here and I speak English.'\"</p><p>Alvarado says she was handcuffed and detained for over eight hours with a chain around her belly. Once she was released, Alvarado says she went straight to the hospital with cuts and bruises. She was also already in labor.</p><p>\"At the hospital, they had told me that I was already having contractions every two minutes,\" she said.</p>\n\n<p>Lopez Alvarado's boyfriend was also detained. He has not seen his newborn and was later deported to Guatemala. </p><p>The Department of Homeland Security on Tuesday announced that it is on pace to deport nearly 600,000 undocumented immigrants by the end of 2025.</p><p>Lopez Alvarado, seven other Americans and one green card holder have <span class=\"link\">filed joint legal claims against the U.S. government</span>, alleging they were wrongfully detained and racially profiled — some claim they were beaten by federal officers.</p><p>\"What they're doing is they're stopping, detaining, arresting, putting people in federal custody and then asking questions later,\" said their lawyer, Michael Carrillo.</p>\n\n<p>Juan Rivas, one of the defendants who has a green card, has been working as a day laborer for more than 20 years. Despite having his legal documents on him, Rivas says he was detained at a <span class=\"link\">Home Depot parking lot</span> in Los Angeles on the Fourth of July.</p><p>\"I was ready to show them when they started hitting me and threw me on the floor,\" Rivas said.</p><p>CBS News has reached out to the Department of Homeland Security for comment but has not received a response.</p><p>As immigration raids have increased across California and other parts of the country, immigration lawyers and advocates warn that a <span class=\"link\">recent Supreme Court decision</span> can put U.S. citizens at risk of being questioned or detained. Carrillo says he has been advising clients to carry their documents every time they leave their house.</p><p>Earlier this month, the high court agreed to freeze a district court's temporary restraining order that prevented federal immigration authorities from stopping people in Southern California without reasonable suspicion that they are in the U.S. unlawfully. That order barred officials from relying solely on certain factors like a person's race or occupation as the basis for a detentive stop.  </p><p>\"Where's my due process? Allow me to present my ID, don't just throw me to the wall. Don't just twist my arm,\" said <span class=\"link\">Brian Gavidia</span>, a U.S. citizen who was confronted by federal agents outside the car dealership he owns in L.A.</p><p>Gavidia told CBS Los Angeles that the agent took both his phone and Real ID. He said his friend started filming and agents released Gavidia after they verified his citizenship. He now says he regrets voting for President Trump.</p>\n\n<p>\"I truly believed it was the worst of the worst, not Americans, not our day laborers, not our farmworkers,\" Gavidia said, referring to Mr. Trump's and other administration officials' <span class=\"link\">vow to deport undocumented immigrants with violent criminal records</span>. </p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Zelenskyy says he's surprised after Trump argues Ukraine can regain all its land",
      "link": "https://www.cbsnews.com/news/zelenskyy-surprised-trump-ukraine-territory-russia-putin/",
      "source": "CBS News",
      "pub_time": "2025-09-23T20:14:00-04:00",
      "description": "President Trump said Ukraine is \"in a position to fight and WIN all of Ukraine back in its original form\" — a shift that President Volodymyr Zelenskyy said took him by surprise.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>Ukrainian President Volodymyr Zelenskyy said Tuesday he was surprised by President Trump's post arguing the Eastern European country could regain all of its territory captured by Russia. </p><p>Mr. Trump wrote in a Truth Social post that Zelenskyy's forces are \"in a position to fight and WIN all of Ukraine back in its original form\" with Europe's help.  The unexpected remarks — which called the Russian military a \"paper tiger\" — came after Mr. Trump met with Zelenskyy for about an hour Tuesday on the sidelines of <span class=\"link\">the United Nations General Assembly</span> in New York City.</p><p>The comments appear to mark a dramatic shift for Mr. Trump, who <span class=\"link\">said last month</span> he expected \"some swapping of territories\" as part of an eventual Russia-Ukraine ceasefire deal. Russia occupies large parts of eastern Ukraine, including territories captured in 2014 and in the current war that began with Russia's invasion of Ukraine in February 2022.</p><p>Asked later Tuesday by Fox News' Bret Baier if he was surprised by the U.S. president's about-face, Zelenskyy laughed and responded, \"a little bit.\"</p><p>Zelenskyy said he and Mr. Trump had a positive conversation on Tuesday, and he believes Mr. Trump's position on territorial swaps has changed.</p>\n\n<p>\"I think he understands for today that we can't just swap territories. It's not fair,\" he said.</p><p>During their meeting on Tuesday, Mr. Trump told reporters that Zelenskyy was \"putting up one hell of a fight,\" and he believes the \"biggest progress\" is that the Russian economy is \"terrible.\" But the U.S. leader <span class=\"link\">didn't appear optimistic</span> about a quick resolution to the war, telling reporters, \"It looks like it's not going to end for a long time.\"</p><p>Mr. Trump has pressed both Russia and Ukraine to reach a ceasefire deal to end their more than three-year-long war, which began when Russia invaded Ukraine in February 2022. </p><p>But a deal has remained elusive as both sides' public positions remain far apart. The Kremlin has <span class=\"link\">pushed Zelenskyy</span> to fully withdraw from large swaths of eastern Ukraine, an idea Zelenskyy has rejected as unfair and unconstitutional. Meanwhile, Ukraine has sought international security guarantees to deter another Russian attack if the current conflict ends.</p>\n\n<p>Mr. Trump has lashed out at both Zelenskyy and Russian President Vladimir Putin at various points. He <span class=\"link\">met with Putin in Alaska last month</span>, but he has criticized the Russian leader for continued strikes on Ukraine, and said last week that Putin had \"really let me down.\"</p><p>The U.S. president also pressed NATO countries earlier this month to stop buying Russian oil and to impose hefty tariffs on China, which has remained aligned with Russia, writing that those moves could \"be of great help in ENDING this deadly, but RIDICULOUS, WAR.\"</p><p>Separately, Mr. Trump said Tuesday that he believes NATO countries should shoot down Russian aircraft that enter their airspace, after <span class=\"link\">Russian drones entered Poland</span> earlier this month and <span class=\"link\">Russian fighter jets allegedly entered Estonian airspace</span>.</p><p>At other points, though, Mr. Trump and Zelenskyy have had a rocky relationship. An Oval Office meeting between the two leaders earlier this year <span class=\"link\">descended into a shouting match</span>, and Mr. Trump has occasionally blamed Zelenskyy for the war.</p><p>During his interview with Fox News on Tuesday, Zelenskyy said he believes his relationship with his American counterpart has improved.</p><p>\"I think we have better relation[s] than before,\" Zelenskyy said. \"I think we didn't have close relation[s] because we didn't have, maybe, time. I don't know.\"</p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Nexstar to continue preempting \"Jimmy Kimmel Live!\" after ABC return",
      "link": "https://www.cbsnews.com/news/nexstar-jimmy-kimmel-live-preempt-abc-sinclair-charlie-kirk/",
      "source": "CBS News",
      "pub_time": "2025-09-23T19:49:33-04:00",
      "description": "Nexstar on Tuesday said it will monitor the late-night show as it returns to ABC tonight.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>Nexstar Media on Tuesday said it will continue to preempt \"Jimmy Kimmel Live!\" on its television stations when the late-night show returns tonight after an <span class=\"link\">almost week-long hiatus on ABC</span>. </p><p>Nexstar's move parallels that of local TV station owner Sinclair, which on Monday said it would also continue to preempt the show after it returns to ABC. Both Nexstar and Sinclair own ABC-affiliated television stations.</p><p>On Tuesday, Nexstar said it will \"monitor the show as it returns to ABC.\"</p><p>Last week, ABC had indefinitely preempted the show following comments Kimmel made on the show in response to <span class=\"link\">the shooting death</span> of conservative activist <span class=\"link\">Charlie Kirk</span>. The decisions by Nexstar and Sinclair, two of the largest owners of TV affiliates, mean \"Jimmy Kimmel Live!\" won't appear tonight on dozens of ABC stations in cities across the U.S. </p><p>The two corporations collectively control about a quarter of ABC affiliates. Nexstar operates 33 ABC affiliates, with its largest market represented by WKRN-TV in Nashville. Sinclair runs 38 ABC stations, including KOMO-TV in Seattle. </p>\n\n<p>At the same time, Nexstar has a <span class=\"link\">$6.2 billion deal pending to purchase Tegna</span>, a smaller rival, and requires approval from the Federal Communications Commission to move forward with the acquisition.</p> <p>Last week, a Nexstar spokesperson told CBS News that the decision was \"made unilaterally by the senior executive team at Nexstar, and they had no communication with the FCC or any government agency prior to making that decision.\"</p><p>In its Tuesday statement, Nexstar said it stands by its decision last week to preempt the show \"pending assurance that all parties are committed to fostering an environment of respectful, constructive dialogue in the markets we serve.\"</p><p>It added, \"In the meantime, we note that 'Jimmy Kimmel Live!' will be available nationwide on multiple Disney-owned streaming products, while our stations will focus on continuing to produce local news and other programming relevant to their respective markets.\"</p>\n\n<p>Guests scheduled to appear on Kimmel's show on Tuesday include actor Glen Powell and singer Sarah McLachlan. </p>\n<p class=\"content__meta--contributors\">\n<span class=\"byline__author__text\">The Associated  Press</span>\n                  \n        contributed to this report.\n    </p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "World experts reject Trump's claims about Tylenol, autism link",
      "link": "https://www.cbsnews.com/news/world-health-experts-trump-tylenol-autism-link/",
      "source": "CBS News",
      "pub_time": "2025-09-23T19:48:14-04:00",
      "description": "Health organizations from around the globe are joining the chorus of experts rejecting the Trump administration's claim that acetaminophen during pregnancy can be associated with an increased risk of autism.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>Health experts from around the globe are joining the chorus of doctors and organizations pushing back against the <span class=\"link\">Trump administration's announcement Monday</span> linking the use of acetaminophen — the active ingredient in Tylenol and many cold and flu medications — during pregnancy to an increased risk of autism in children.</p><p>\"Effective immediately, the FDA will be notifying physicians that the use of acetaminophen during pregnancy can be associated with a very increased risk of autism,\" President Trump said at a news conference with Health and Human Services Secretary Robert F. Kennedy Jr. and others.</p><p>In a statement Tuesday, the European Union's European Medicines Agency said there is currently \"no new evidence\" that would require changes to the current EU recommendations for use of acetaminophen, also commonly called paracetamol outside the U.S.</p><p>\"Paracetamol remains an important option to treat pain or fever in pregnant women,\" Steffen Thirstrup, EMA's chief medical officer, said in the statement. \"Our advice is based on a rigorous assessment of the available scientific data and we have found no evidence that taking paracetamol during pregnancy causes autism in children.\"</p><p>The United Kingdom's Medicines and Healthcare products Regulatory Agency said Tuesday, \"taking paracetamol during pregnancy remains safe.\"</p>\n\n<p>\"There is no evidence that taking paracetamol during pregnancy causes autism in children,\" the agency's chief safety officer Dr. Alison Cave said in the statement. </p><p>In a combined statement, Australia's chief medical officer and the country's medicine regulator, the Therapeutic Goods Administration, said they were joining \"other global medicines regulators, leading clinicians and scientists worldwide in rejecting claims regarding the use of paracetamol in pregnancy, and the subsequent risk of development of ADHD or autism in children.\"</p><p>\"Robust scientific evidence shows no causal link between the use of paracetamol in pregnancy and autism or ADHD, with several large and reliable studies directly contradicting these claims,\" the statement continued. </p><p>While sharing a statement from Spain's Ministry of Health that stated paracetamol can be used during pregnancy, the country's minister of health, Mónica García, called out Mr. Trump specifically for misinformation and lack of evidence. </p>\n\n<p>\"Trump's new crusade is against paracetamol during pregnancy, ignoring all scientific evidence,\" she wrote on X. \"This denialism only sows alarm and misinformation. It's better to listen to health authorities than to the person who suggested injecting bleach against COVID,\" referring to <span class=\"link\">a remark Mr. Trump made</span> in 2020. </p><p>A World Health Organization spokesperson said Tuesday that evidence of a link between the use of paracetamol during pregnancy and autism \"remains inconsistent,\" according to Reuters.</p><p>International-based studies have been part of the evidence that shows acetaminophen use during pregnancy is safe.</p><p>In a major study published last year, for example, researchers followed nearly 2.5 million children in Sweden over 25 years and found that acetaminophen use during pregnancy did not increase the risk of neurodevelopmental disorders in children.</p><p>In the U.S., organizations — including one that represents those who treat pregnant patients, the American College of Obstetricians and Gynecologists — have countered the claimed link, saying there's \"no clear evidence.\"</p><p>The Consumer Healthcare Products Association, which represents some of the largest makers of over-the-counter medications, including acetaminophen, said, \"Safety is the top priority for manufacturers,\" and \"the well-established profile of acetaminophen is supported by decades of research and real-world use.\"</p><p>And the Autism Science Foundation said in a statement that any association between acetaminophen and autism is based on \"limited, conflicting, and inconsistent science.\"</p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Ryan Routh guilty in Trump assassination attempt, tries to stab himself after verdict",
      "link": "https://www.cbsnews.com/news/ryan-routh-verdict-guilty-trump-assassination-attempt/",
      "source": "CBS News",
      "pub_time": "2025-09-23T19:42:11-04:00",
      "description": "Ryan Routh was found guilty of all five charges, which included attempted assassination of a major presidential candidate and assaulting a federal officer.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>A Florida jury on Tuesday found <span class=\"link\">Ryan Routh</span> guilty of an assassination attempt against then-presidential candidate Donald Trump. </p><p><span class=\"link\">Routh represented himself</span> in the trial. He was found guilty of all five charges, which included attempted assassination of a major presidential candidate and assaulting a federal officer. </p><p>Routh was arrested in September 2024 at Mr. Trump's golf course. A Secret Service agent testified last week that he spotted Routh before the then-presidential candidate came into view. Routh aimed his rifle at the agent, who opened fire, causing Routh to drop his weapon and flee without firing a shot, the agent said.</p><p>After the verdict was read, Routh apparently tried to harm himself, possibly using a pen that was on his desk, to stab himself in the neck. His daughter cried out during the incident and U.S. marshals eventually tackled him. </p><p>It was the second assassination attempt against Mr. Trump in 2024, after shots were fired in a separate incident at a Pennsylvania rally. A bullet grazed Mr. Trump's ear in that incident. </p>\n\n<p>Attorney General Pam Bondi said in a statement that the guilty verdict against Routh \"illustrates the Department of Justice's commitment to punishing those who engage in political violence,\" and Deputy Attorney General Todd Blanche said the verdict sends \"a clear message\" that an \"attempt to assassinate a presidential candidate is an attack on our Republic and on the rights of every citizen.\" </p><p>A federal district judge will determine his sentence. He faces life in prison.</p><p>In a nearly hourlong closing argument on Tuesday, Routh said that there was no intent to kill because the trigger was never pulled, the gun was never fired and that no one was hurt, so \"no crime.\"  </p><p>\"I wanted to kill, my actions within the community and toward my co-workers and family should show my obvious non-violence and gentleness,\" Routh said. Speaking about himself in the third person, he said the shooting was never going to happen because it was \"never in his heart.\" </p>\n\n<p>But prosecutors said Routh spent weeks plotting to kill Mr. Trump, who was then running for president. Prosecutors laid out Routh's actions ahead of the incident, saying \"those aren'tcoincidences … that's a plan,\" prosecutor Christopher Brown said in his closing argument. </p><p>\"He had a loaded round in the chamber and the safety off,\" Brown said. \"We don't have to prove motive, but you already have it. You only have to decide intent.\" </p><p>Prosecutors also alleged in court filings that Routh attempted to acquire an anti-aircraft weapon to <span class=\"link\">shoot down Mr. Trump's plane</span>.</p><p>Routh had initially submitted a witness list that included Mr. Trump, as well as Columbia activists Mahmoud Khalil and Mohsen Mahdawi — to whom his connections are unclear — and several prominent authors. Judge Aileen Canon had rejected many of these potential witnesses.</p><p><em>Jacob Rosen, Daniel Shepherd and The Associated Press contributed to this report. </em></p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Disney raising streaming prices for Disney+, Hulu and ESPN",
      "link": "https://www.cbsnews.com/news/disney-streaming-price-hikes/",
      "source": "CBS News",
      "pub_time": "2025-09-23T15:48:00-04:00",
      "description": "Disney joins streaming rivals in hiking the monthly cost of both ad-free and ad-supported subscriptions.",
      "image_url": "",
      "content": "<html><body><div><article class=\"content content-article lazyload\" data-index=\"0\" data-path=\"/news/disney-streaming-price-hikes/\" id=\"article-0\">\n\n\n<section class=\"content__body\">\n<p>Disney is raising the prices of its streaming services, joining competitors such as Apple and Netflix in hiking subscription costs for their streaming platforms. </p><p>Beginning Oct.21, the cost of an adverstisement-support Disney+ plan will jump from from $9.99 a month to $11.99, while an ad-free plan will rise to $18.99 a month, up from $15.99, the entertainment giant announced Tuesday. </p><p>A bundled plan that includes Disney+ and Hulu with ads will cost an extra $2, rising to $12.99 a month, while the ad-free subscription will run $19.99. A subscription offering Disney+, Hulu and ESPN Select with ads will rise from $16.99 per month to $19.99; without ads, that package will cost $29.99 a month, up from $26.99.</p><p>In its August earnings statement, Disney said its flagship Disney+ platform added 1.8 million new subscribers in the third quarter and how has 128 million subscribers. </p><p>As of last month, 46% of Americans were watching TV and movies on streaming platforms, compared to roughly 23% on cable and 19% on legacy networks, according to Nielsen.</p>\n\n<p>Streaming costs have also jumped of late, with <span class=\"link\">Apple</span>, Comcast-owned <span class=\"link\">Peacock</span> and <span class=\"link\">Netflix</span> all raising their subscription prices this year. Those services compete with Paramount+, a streaming platform owned by Paramount Skydance, which is the parent company of CBS.</p>\n\n</section>\n</article>\n</div></body></html>"
    },
    {
      "title": "MLB approves robot umpires as part of challenge system in 2026",
      "link": "https://www.cbsnews.com/news/mlb-robot-umpires-2026-season-challenge-system/",
      "source": "CBS News",
      "pub_time": "2025-09-23T14:42:00-04:00",
      "description": "Human plate umpires will still call balls and strikes, but teams can challenge two calls per game and get additional appeals in extra innings.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p><span class=\"link\">Robot umpires</span> are getting called up to the big leagues next season.</p><p>Major League Baseball's 11-man competition committee on Tuesday approved use of the Automated Ball/Strike System in the major leagues in 2026.</p><p>Human plate umpires will still call balls and strikes, but teams can challenge two calls per game and get additional appeals in extra innings. Challenges must be made by a pitcher, catcher or batter — signaled by tapping their helmet or cap — and a team retains its challenge if successful. Reviews will be shown as digital graphics on outfield videoboards.</p><p>Adding the robot umps is likely to cut down on ejections. MLB said 61.5% of ejections among players, managers and coaches last year were related to balls and strikes, as were 60.3% this season through Sunday. The figures include ejections for derogatory comments, throwing equipment while protesting calls and inappropriate conduct.</p><p>Big league umpires call roughly 94% of pitches correctly, according to UmpScorecards.</p>\n<p>ABS, which utilizes Hawk-Eye cameras, has been tested in the minor leagues since 2019. The independent Atlantic League trialed the system at its 2019 All-Star Game and MLB installed the technology for that year's Arizona Fall League of top prospects. The ABS was tried at eight of nine ballparks of the Low-A Southeast League in 2021, then moved up to Triple-A in 2022.</p>\n\n<p>In 2019, Fred DeJesus became the first umpire in a regular-season game to use ABS. He remembers the first pitch he tested – it was a strike – and how he was hesitant about the new technology at first.</p><p>\"Initially, it was like, no way, we're not doing this. I spent way too much money trying to learn the craft of calling balls and strikes,\" he <span class=\"link\">told CBS News</span> in 2021.</p><p>At Triple-A at the start of the 2023 season, half the games used the robots for ball/strike calls and half had a human making decisions subject to appeals by teams to the ABS.</p><p>MLB switched Triple-A to an all-challenge system on June 26, 2024, then used the challenge system this year at 13 spring training ballparks hosting 19 teams for a total of 288 exhibition games. Teams won 52.2% of their ball/strike challenges (617 of 1,182) challenges.</p>\n\n<p>At Triple-A this season, the average challenges per game increased to 4.2 from 3.9 through Sunday and the success rate dropped to 49.5% from 50.6%. Defenses were successful in 53.7% of challenges this year and offenses in 45%.</p><p>ABS was used in this year's All-Star Game as well and has generally received positive reviews, CBS Sports reported. Four of five challenges of plate umpire Dan Iassogna's calls were successful in July.</p><p>Teams in Triple-A do not get additional challenges in extra innings. However, the proposal approved by the MLB on Tuesday included a provision granting teams one additional challenge each inning if they don't have challenges remaining.</p><p>MLB has experimented with different shapes and interpretations of the strike zone with ABS, including versions that were three-dimensional. Currently, it calls strikes solely based on where the ball crosses the midpoint of the plate, 8.5 inches from the front and the back. The top of the strike zone is 53.5% of batter height and the bottom 27%.</p><p>This will be MLB's first major rule change since sweeping adjustments in 2024. Those included a pitch clock, restrictions on defensive shifts, pitcher disengagements such as pickoff attempts and larger bases.</p><p>The challenge system introduces ABS without eliminating pitch framing, a subtle art where catchers use their body and glove to try making borderline pitches look like strikes. Framing has become a critical skill for big league catchers. While there was concern that full-blown ABS would make some strong defensive catchers obsolete, not everyone considers the skill a good thing.</p><p>\"The idea that people get paid for cheating, for stealing strikes, for moving a pitch that's not a strike into the zone to fool the official and make it a strike is beyond my comprehension,\" former manager Bobby Valentine said.</p>\n\n<p>Texas manager Bruce Bochy, a big league catcher from 1978-87, maintained old-school umpires such as Bruce Froemming and Billy Williams never would have accepted pitch framing. He said they would have told him: \"'If you do that again, you'll never get a strike.' I'm cutting out some words.\"</p><p>Management officials on the competition committee include Seattle chairman John Stanton, St. Louis CEO Bill DeWitt Jr., San Francisco chairman Greg Johnson, Colorado CEO Dick Monfort, Toronto CEO Mark Shapiro and Boston chairman Tom Werner.</p><p>Players include Arizona's Corbin Burnes and Zac Gallen, Detroit's Casey Mize, Seattle's Cal Raleigh and the New York Yankees' Austin Slater, with the Chicago Cubs' Ian Happ at Detroit's Casey Mize as alternates. The union representatives make their decisions based on input from players on the 30 teams.</p><p>Bill Miller is the umpire representative.</p><p>The competition committee can unilaterally implement on-field rule changes with 45 days' notice to the MLB Players Association, according to CBS Sports. </p>\n</section>\n</div></body></html>"
    },
    {
      "title": "\"Nightmare bacteria\" cases are rising in the U.S., researchers say",
      "link": "https://www.cbsnews.com/news/nightmare-bacteria-drug-resistant-cases-increase-cdc-report/",
      "source": "CBS News",
      "pub_time": "2025-09-23T14:27:04-04:00",
      "description": "Government scientists say infection rates from drug-resistant \"nightmare bacteria\" have been increasing dramatically.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>Infection rates from drug-resistant \"nightmare bacteria\" rose almost 70% between 2019 and 2023, according to a new report from Centers for Disease Control and Prevention scientists.</p><p>Bacteria that are difficult to treat due to the so-called NDM gene primarily drove the increase, CDC researchers wrote in an article published Monday in the Annals of Internal Medicine. Only two antibiotics work against those infections, and the drugs are expensive and must be administered through an IV, researchers said. </p><p>Bacteria with the gene were once considered exotic, linked to a small number of patients who received medical care overseas. Though the numbers are still small, the rate of U.S. cases jumped more than fivefold in recent years, the researchers reported.</p><p>\"The rise of NDMs in the U.S. is a grave danger and very worrisome,\" said David Weiss, an Emory University infectious diseases researcher, in an email.</p><p>It's likely many people are unrecognized carriers of the drug-resistant bacteria, which could lead to community spread, the CDC scientists said. </p>\n\n<p>That may play out in doctors' offices across the country, as infections long considered routine and easy to treat — like urinary tract infections — could become chronic problems, said Dr. Maroya Walters, one of the report's authors.</p><p><span class=\"link\">Antimicrobial resistance</span> occurs when germs such as bacteria and fungi gain the power to fight off the drugs designed to kill them. The misuse of antibiotics was a big reason for the rise — unfinished or unnecessary prescriptions that didn't kill the germs made them stronger.</p><p>In recent years, the CDC has drawn attention to \"<span class=\"link\">nightmare bacteria</span>\" resistant to a wide range of antibiotics. That includes carbapenems, a class of antibiotics considered a last resort for treatment of serious infections.</p><p>Researchers drew data from 29 states that do the necessary testing and reporting of carbapenem-resistant bacteria.</p>\n\n<p>They counted 4,341 cases of carbapenem-resistant bacterial infections from those states in 2023, with 1,831 of them the NDM variety. The researchers did not say how many of the infected people died.</p><p>The rate of carbapenem-resistant infections rose from just under 2 per 100,000 people in 2019 to more than 3 per 100,000 in 2023 — an increase of 69%. But the rate of NDM cases rose from around 0.25 to about 1.35 — an increase of 460%, the authors said.</p><p>A researcher not involved in the study said the increase is probably related to the COVID-19 pandemic.</p><p>\"We know that there was a huge surge in antibiotic use during the pandemic, so this likely is reflected in increasing drug resistance,\" said Dr. Jason Burnham, a Washington University researcher, in an email.</p><p>The CDC's count is only a partial picture. </p><p>Many states are not fully testing and reporting cases. Even in states that do, cases tend to be among hospital patients sick enough to warrant special testing. Many hospitals also aren't able to do the testing needed to detect certain forms of genetic resistance.</p><p>The CDC researchers did not have data from some of the most populous states, including California, Florida, New York and Texas, which means the absolute number of U.S. infections \"is definitely underestimated,\" Burnham said.</p>\n\n<p>This is not the first study to report a rise. A CDC report published in June noted an increase in NDM cases in New York City between 2019 and 2024. </p>\n</section>\n</div></body></html>"
    }
  ]
}