{
  "title": "CBS News",
  "link": "https://www.cbsnews.com/",
  "description": "Latest news from CBS News",
  "items": [
    {
      "title": "Animal rights groups question NIH's commitment to reduce primate research",
      "link": "https://www.cbsnews.com/news/animal-rights-groups-trump-administration-monkeys-medical-research/",
      "source": "CBS News",
      "pub_time": "2025-09-26T05:00:06-04:00",
      "description": "Animal rights advocates want to know why the National Institutes of Health quietly approved millions in new funding for dozens of primate experiments since President Trump took office.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p><em>This story is part of a collaboration with The Post and Courier of Charleston, South Carolina.</em></p><p>A federal health agency that has promised to scale back its animal research has drawn the attention of animal rights advocates who want to know why it quietly approved millions in new funding for dozens of primate experiments since President Trump took office.</p><p>\"The NIH's rhetoric about reducing animal testing doesn't match reality,\" said Justin Goodman, senior vice president of White Coat Waste, an organization that has described the Trump Administration's commitment to drastically reduce animal testing as a \"watershed moment\" in its fight to end the practice.</p><p>His group is highlighting the new spending to add pressure on National Institutes of Health director Jay Bhattacharya, one of several federal officials who promised that the agency will stop funding all but the most essential animal research and implement alternative testing methods. That decision — highly controversial in the world of medical research — comes at a moment when animal rights advocates have unprecedented leverage within the U.S. government through their close alliances with the president and Health and Human Services Secretary Robert F. Kennedy Jr.</p><p>NIH did not respond to requests for comment. In April, Bhattacharya said the initiative to steer projects to alternative tests \"marks a critical leap forward for science, public trust, and patient care.\"</p>\n\n<p>One of the new projects is a kidney transplant study that will use about 99 monkeys at a cost of about $10,000 each, bought from a South Carolina primate farm. That operation gained global attention last year when federally-owned <span class=\"link\">research monkeys escaped</span> into a rural town.</p><p>Monkeys from Alpha Genesis will be used in new kidney research at the University of Pittsburgh that involves doing transplants in monkeys and euthanizing them at the study's conclusion. The project got $1.4 million in July from the National Institute of Allergy and Infectious Diseases. The study is slated to receive $10.1 million through 2030, according to funding documents.</p><p>The university said in a statement its researchers are \"grateful for the federal support and closely follow all regulations and industry standards, including continual evaluation of the suppliers of animal models that, at this time, remain necessary to our ability to achieve medical breakthroughs that save human lives. </p><p>White Coat Waste has catalogued about $91 million in spending on animal research in recent months and provided details of the kidney project funding.The group has used Freedom of Information Act requests and spending documents to compile a list of more than 70 projects receiving money through the National Institutes of Health, despite promises to cut back on the funding.</p>\n\n<p>Animal rights groups have estimated that the federal government spends as much as $20 billion a year on research involving dogs, cats, monkeys and other animals. NIH is the biggest funder.</p><p>Some controversial animal projects were cut from the budget as the Department of Government Efficiency under Elon Musk focused on wasteful spending. A <span class=\"link\">joint investigation by CBS News</span> and The Post and Courier found nearly $28 million in cancelled federal grants.</p><p>Animal rights groups and some scientists have questioned the scientific value of animal experiments, which are often inconclusive. But patients rely on drugs and medical procedures under development for new treatments.</p><p>Primates have been used for decades to test new medications and treatments before they move to clinical trials in humans.</p><p>Alpha Genesis has regularly supplied monkeys for studies that hope to one day improve human tolerance for transplanted organs. But it came under criticism last year after the dramatic monkey escape and a regulatory lapse that led to the deaths of 22 research monkeys from apparent carbon monoxide poisoning. Whistleblowers inside the monkey farm reported the fatalities to People for the Ethical Treatment of Animals, an animal rights group, which alerted a federal animal protection agency. Greg Westergaard, the company president, did not respond to a message.</p><p>White Coat Waste also discovered in March that NIAID would continue funding for the operations of Morgan Island, a remote barrier island popularly known as \"Monkey Island\" where the federal agency keeps up to 4,000 rhesus monkeys destined for research.</p><p>U.S. Rep. Nancy Mace, a South Carolina Republican, has called for a shutdown of the island, which is managed by Alpha Genesis, and recently inserted language into a House appropriations bill demanding that NIH explain its continued use.</p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "BMW recalling more than 196,000 cars in U.S. over potential fire risk",
      "link": "https://www.cbsnews.com/news/bmw-recalling-more-than-196000-cars-in-u-s-over-potential-fire-risk/",
      "source": "CBS News",
      "pub_time": "2025-09-26T04:50:53-04:00",
      "description": "Tens of thousands of BMW vehicles, and some Toyotas, are being recalled due to an engine starter relay that can corrode, increasing the risk of a fire.",
      "image_url": "",
      "content": "<html><body><div><article class=\"content content-article lazyload\" data-index=\"0\" data-path=\"/news/bmw-recalling-more-than-196000-cars-in-u-s-over-potential-fire-risk/\" id=\"article-0\">\n\n\n<section class=\"content__body\">\n<p>Almost 200,000 BMWs, along with some Toyota Supras, are being recalled in the U.S. by the German automaker due to the potential for a short circuit in their starters that could increase the risk of a fire, the National Highway Traffic Safety Administration said Friday.</p><p>A total of 196,355 vehicles in the U.S. will be subject to the recall, the vast majority of them BMWs made between 2019 and 2022, in which NHTSA said \"the engine starter relay may corrode, causing the relay to overheat and short circuit,\" increasing the risk of a fire.</p><p>NHTSA said in its notice that BMW of North America was recalling certain 2019-2021 BMW 330i, 2019-2022 BMW Z4, 2020-2022 BMW 530i, X3, X4, Toyota Supra, 2021-2022 BMW 430i, 430i Convertible, and 2022 BMW 230i vehicles, and that letters would go out to owners from November 14 to inform them of the issue. </p><p>From that day, vehicle owners will also be able to search online at NHTSA.gov/recalls, ­­entering either their unique Vehicle Identification Number (VIN), or the year, make and model of their vehicle to confirm whether it is subject to the recall.</p><p>\"Owners are advised to park their vehicles outside and away from structures until the remedy is complete\" NHTSA said in its notice of the recall on Friday. \"Dealers will replace the engine starter, free of charge.\"</p>\n\n<p>The agency, part of the Department of Transportation, said owners could also contact BMW's U.S. customer service line directly at 1-800-525-7417 with questions. </p><p>The recall notice comes just over a year after <span class=\"link\">BMW announced a recall</span> of more than 720,700 vehicles in North America because they were equipped with an electric water pump that could short circuit as a result of faulty installation, posing a fire hazard. </p>\n\n</section>\n</article>\n</div></body></html>"
    },
    {
      "title": "Dr. Oz says \"of course\" pregnant women should take Tylenol if a doctor says so",
      "link": "https://www.cbsnews.com/news/dr-oz-says-of-course-pregnant-women-should-take-tylenol-if-a-doctor-says-so/",
      "source": "CBS News",
      "pub_time": "2025-09-26T00:31:00-04:00",
      "description": "President Trump's announcement this week about an alleged link between Tylenol and autism has drawn pushback from medical experts.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>Dr. Mehmet Oz told CBS News chief Washington correspondent Major Garrett on \"The Takeout\" Thursday the Trump administration is not advising pregnant women to avoid taking Tylenol under any circumstances — as President Trump's <span class=\"link\">announcement this week</span> about an alleged link between the painkiller and fever reducer and autism draws pushback from medical experts.</p><p>Oz — a former surgeon and television personality who leads the Centers for Medicare and Medicaid Services, an agency that is under the Department of Health and Human Services — said that if a pregnant woman develops a high fever, a doctor will likely encourage her to take acetaminophen, the active ingredient in Tylenol, because <span class=\"link\">fevers can pose health risks</span>.  And studies show acetaminophen is the safest medication to treat fevers in pregnant women. </p><p>\"The concern here is that I believe most women get low-grade fevers, they stub their toe, they have little aches and pains, and they think it's perfectly safe to throw a couple paracetamol or acetaminophen or Tylenol when they're pregnant, and I don't think that's the case,\" Oz said.</p><p>On Monday, Food and Drug Administration Commissioner Marty Makary released an open letter to physicians that said acetaminophen use during pregnancy \"may be associated with\" an increased risk of conditions like autism. </p><p>The letter noted that \"while an association between acetaminophen and autism has been described in many studies, a causal relationship has not been established.\"</p>\n\n<p>Makary's letter was also more tempered than Mr. Trump's comments during a news conference earlier this week in which the president said there's \"no downside in not taking\" Tylenol. </p><p>\"Acetaminophen is the safest over-the-counter alternative in pregnancy among all analgesics and antipyretics,\" Makary wrote in his letter. </p><p>There is concern among the medical community that, as a result of the FDA's announcement Monday, that some patients could turn to other pain medications that are proven to be unsafe during pregnancy. </p><p>\"You should not, under any circumstances, avoid taking acetaminophen if you have a fever early in pregnancy, if you have a headache, if you have some other condition in pregnancy, we want you to take that medication,\" Dr. Steven Fleischman, president of the American College of Obstetricians and Gynecologists, told CBS News following the FDA's announcement. \"The overwhelming evidence that we have seen over the last 20 years does not show causation for acetaminophen causing autism.\"</p>\n\n<p>In a statement in response to the FDA's announcement, Kenvue, the maker of Tylenol, said, \"Independent, sound science clearly shows that taking acetaminophen does not cause autism,\" calling it \"the safest pain reliever option for pregnant women as needed throughout their entire pregnancy.\" </p><p>Oz also addressed Makary's announcement that the agency will approve the prescription drug leucovorin, which is derived from folic acid, to treat autism in children. Specialists say <span class=\"link\">leucovorin can be helpful</span> in treating some autism cases, but it is not a universal remedy.</p><p>\"The key question is, if you, as a researcher on those trials, had a child, would you give that child leucovorin?\" Oz said he asked of researchers studying leucovorin. \"And when I asked the doctors on those trials, they said yes.\"</p><p>Autism has become more prevalent in children born in the U.S. over the past 25 years, according to data from the U.S. Centers for Disease Control and Prevention, but there is no scientific consensus as to why.</p><p>Oz said that when he, Makary and Jay Bhattacharya, director of the National Institutes of Health, were asked by the White House to examine the issue, they found two \"clues,\" not conclusions, that pointed to leucovorin as a possible treatment option for autistic children, and acetaminophen as a medication pregnant women should be cautious about taking.  </p><p>\"These are things that we believe, that if you're fully transparent about, you'll rebuild trust with the American people,\" Oz said. \"Just tell people what you know.\" </p><p>Oz argued that Mr. Trump was right in pushing for the FDA to both approve leucovorin and make its Tylenol recommendation — even though there is no consensus in the medical community and no definitive evidence supporting either move — because he believes the FDA has an obligation to be transparent. </p>\n\n<p>But Oz was clear that patients should consult their doctors first before making a decision. </p><p>\"The Tylenol issue is whether or not we should warn moms, who are pregnant today, about a problem that we may not know fully the answer to — 'Is Tylenol a problem during pregnancy?'  — for another five years,\" Oz said. \"Well, what about the kid today? Are you going to take the Tylenol or not. Well I think the answer is, the best prudent answer, of course take it if a doctor says you need it. But don't take it on your own without thinking twice about it.\" </p><p>Oz also indicated that he would not advise a pregnant family member to take Tylenol without talking to their physician first.   </p><p>\"We're guarded in saying we don't have all the answers,\" he said. \"But if it's my family, I'm not going to have my pregnant daughter take acetaminophen if she doesn't need to be on it without certainly talking to a doctor about it.\"</p>\n<p class=\"content__meta--contributors\">\nSara  Moniuszko and \n                                                  \n                                  Dr. Céline  Gounder\n                  \n        contributed to this report.\n    </p>\n</section>\n</div></body></html>"
    },
    {
      "title": "A grand jury charged Comey with 2 counts — but rejected a third. Here's what they say.",
      "link": "https://www.cbsnews.com/news/comey-trump-grand-jury-2-criminal-counts-rejects-a-third-heres-what-they-say/",
      "source": "CBS News",
      "pub_time": "2025-09-26T00:11:35-04:00",
      "description": "President Trump's Justice Department charged former FBI Director James Comey with lying to Congress — revisiting controversies over the FBI's Trump-Russia probe from nearly a decade ago.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>President Trump's Justice Department <span class=\"link\">charged former FBI Director James Comey</span> on Thursday with lying to Congress, an unprecedented step against a longtime Trump foe that revisits controversies over the FBI's Trump-Russia probe from nearly a decade ago.</p><p>A grand jury in Northern Virginia voted to indict Comey on two counts: making a false statement to Congress and obstructing a congressional proceeding. In an unusual move, the grand jury voted against indicting him on an additional charge of making a false statement.</p><p>The criminal charges revolve around a Senate hearing in September 2020, when lawmakers grilled Comey — who was fired by Mr. Trump three years earlier — about how he handled the FBI's 2016 investigations into pro-Trump election meddling by Russia and Hillary Clinton's use of a private email server. Both election-year probes have drawn Mr. Trump's ire for years.</p><p>The five-year statute of limitations for charges out of that hearing would have expired next week.</p><p>Comey asserted in an Instagram video that he is innocent.</p>\n\n<p>In a statement, Attorney General Pam Bondi said the indictment \"reflects this Department of Justice's commitment to holding those who abuse positions of power accountable for misleading the American people.\"</p><h2>Count 1: Comey accused of lying about media leaks</h2><p>The first count against Comey that was approved by the grand jury accuses him of breaking a federal law that makes it a crime to make \"any materially false, fictitious, or fraudulent statement or representation\" to a federal body, including Congress.</p><p>The charge hinges on a combative back-and-forth between the former FBI director and Republican Sen.Ted Cruz of Texas during the Sept. 30, 2020, Senate hearing.</p><p>In the hearing, Cruz pressed Comey on whether he had ever authorized another FBI staffer to serve as an anonymous source in any media reports about the bureau's 2016 investigations involving Mr. Trump and Hillary Clinton. </p>\n\n<p>Comey had answered no to a similar question during another Senate hearing in 2017. But Cruz said in the 2020 questioning that former FBI Deputy Director Andrew McCabe — another Trump foe — has \"publicly and repeatedly stated that he leaked information to the Wall Street Journal and that you were directly aware of it and that you directly authorized it,\" referring to an article about an FBI investigation into the Clinton Foundation.</p><p>\"Now, what Mr. McCabe is saying and what you testified to this committee cannot both be true. One or the other is false,\" the senator said to Comey. \"Who's telling the truth?\"</p><p>\"I can only speak to my testimony. I stand by the testimony,\" replied Comey.</p><p>Thursday's indictment alleges that this statement is false because Comey \"then and there knew, he in fact had authorized [an unnamed person] to serve as an anonymous source in news reports regarding an FBI investigation.\"</p><p>A 2018 report by the Justice Department inspector general's office says Comey and McCabe discussed the Wall Street Journal article after it came out, but gave investigators competing stories about their meeting. Comey told the watchdog that McCabe \"led him to believe\" that McCabe hadn't authorized the release of any information to the Journal. But McCabe said he told Comey a day after the article was published that he'd approved the release himself, and Comey replied that it was a good idea.</p><p>The report says \"the overwhelming weight of that evidence supported Comey's version of the conversation,\" and McCabe \"lacked candor\" in his conversation with Comey.</p><p>McCabe later told \"<span class=\"link\">60 Minutes</span>\" he did not intentionally mislead the inspector general.</p>\n\n<p>McCabe was fired in 2018, <span class=\"link\">days before</span> he was set to retire.</p><h2>Count 2: Obstructing a congressional proceeding</h2><p>Comey was also indicted Thursday for allegedly trying to \"influence, obstruct and impede\" an investigation by the Senate Judiciary Committee by \"making false and misleading statements.\" The indictment does not say what alleged false statement led to the obstruction charge.</p><h2>Grand jury rejects a charge against Comey</h2><p>A majority of the Alexandria, Virginia-based grand jury that reviewed the Comey matter voted not to charge him with one of the three counts presented by prosecutors, according to a form that was signed by the grand jury's foreperson and filed in court Thursday.</p><p>In order for federal prosecutors to criminally indict somebody, they need to convince most members of a 23-person grand jury that they have \"probable cause\" to believe a crime was committed — a much lower bar than the one needed to convict somebody.</p><p>It's very rare for grand juries to decline an indictment. In the 2016 fiscal year, federal prosecutors declined to bring charges against somebody because the grand jury didn't return an indictment only six times, out of more than 150,000 suspects who were investigated that year, according to a Justice Department report.</p><p>In recent months, however, grand juries in Washington, D.C., have rejected several requests for indictments by the Justice Department, including a possible felony charge against a person who was <span class=\"link\">accused of throwing a sandwich at a federal agent</span>. Former federal prosecutor Brendan Ballou <span class=\"link\">told CBS News</span> earlier this month that trend \"suggests that the administration has absolutely destroyed its credibility with jurors.\"</p><p>The unsuccessful count against Comey would have accused him of illegally making false statements to Congress during a line of questioning by Republican Sen. Lindsey Graham of South Carolina in September 2020.</p>\n\n<p>Graham had asked Comey if he remembered getting a lead from the intelligence community in September 2016 that alleged Hillary Clinton's campaign \"was going to create a scandal regarding Trump and Russia\" in order to distract from her use of a private email server. </p><p>Comey replied: \"That doesn't ring a bell\" — which the Justice Department called false.</p><p>The allegation about Clinton's campaign first surfaced in 2020, when it was declassified by Mr. Trump's Director of National Intelligence John Ratcliffe. Clinton campaign officials denied the accusation to Justice Department special counsel John Durham, a Trump-era prosecutor tasked with reviewing the Russia probe. But Durham said in a 2023 report that FBI investigators looking into possible Trump-Russia ties should've paid more attention to the claims.</p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Former FBI Director James Comey indicted on 2 counts",
      "link": "https://www.cbsnews.com/news/former-fbi-director-james-comey-indicted-trump-doj/",
      "source": "CBS News",
      "pub_time": "2025-09-25T23:34:13-04:00",
      "description": "President Trump's Justice Department has brought criminal charges against James Comey, indicting him on two counts, though a federal grand jury rejected one count.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p><em>Washington</em> — Former FBI Director James Comey was indicted Thursday on two counts, marking a major escalation in President Trump's efforts to target his political opponents and use the Justice Department as part of his campaign to seek retribution against his most ardent critics.</p><p>Comey was charged with one count of making false statements and one count of obstruction of justice, related to Senate testimony he gave almost five years ago. A majority of grand jurors did not approve indicting him on an additional count of lying to Congress, according to court papers — an unusual development since grand juries rarely reject charges.</p><p>In a statement, Attorney General Pam Bondi alleged that Comey \"obstructed a congressional investigation into the disclosure of sensitive information\" and made a false statement to Congress. </p><p>\"Comey stated that he did not authorize someone at the FBI to be an anonymous source. According to the indictment that statement was false,\" Bondi's statement read.</p><p>\"No one is above the law,\" Bondi wrote on X. \"Today's indictment reflects this Department of Justice's commitment to holding those who abuse positions of power accountable for misleading the American people. We will follow the facts in this case.\"</p>\n\n<p>Mr. Trump celebrated the indictment in a Truth Social post, calling the former FBI director — whom he fired in 2017 — \"One of the worst human beings this Country has ever been exposed to.\"</p><p>Comey asserted his innocence in a video on Instagram and said, \"there are costs to standing up to Donald Trump.\"</p><p>\"My heart is broken for the Department of Justice, but I have great confidence in the federal judicial system. And I'm innocent. So let's have a trial. And keep the faith,\" he said.</p><p>Comey's attorney, Patrick J. Fitzgerald, said in a statement: \"Jim Comey denies the charges filed today in their entirety. We look forward to vindicating him in the courtroom.\"</p>\n\n<p>Comey is set to be arraigned on the morning of Oct. 9 in Alexandria, Virginia. The case was assigned to U.S. District Judge Michael S. Nachmanoff, who was nominated by former President Joe Biden.</p><h2>Comey charges focus on testimony to Congress</h2><p>The indictment was returned in the Eastern District of Virginia as the clock ticked down on the five-year statute of limitations for charges arising out of his September 2020 testimony to Congress, which was set to expire Tuesday, Sept. 30. </p><p>Comey <span class=\"link\">appeared before the Senate Judiciary Committee</span> in 2020 to answer questions about the origins of the FBI's investigation into Russian meddling in the 2016 election, known as \"Crossfire Hurricane.\" The probe, which has frustrated Mr. Trump for years, was later taken over by special counsel Robert Mueller.</p><p>During that hearing, GOP Sen. Ted Cruz of Texas asked Comey about earlier testimony in 2017 denying having been an anonymous source or authorizing another FBI official to be an anonymous source for news reports about the FBI's investigations into Mr. Trump or Hillary Clinton. The probe involving Clinton examined her use of a private email server while serving as secretary of state.</p><p>Comey told Cruz in 2020 that he stood by his earlier testimony. </p><p>But a lawyer for Andrew McCabe, Comey's former deputy, said in 2018 that McCabe authorized the disclosure of information to a Wall Street Journal reporter in 2016 about the Clinton investigation with Comey's knowledge. The lawyer made the claim in response to an <span class=\"link\">investigation by the Justice Department's internal watchdog</span>, which found McCabe \"lacked candor\" when he told Comey, or led Comey to believe, that he had not authorized the disclosure.</p><p>Thursday's indictment called Comey's statement that he hadn't authorized anybody to serve as an anonymous source \"materially false, fictitious, and fraudulent.\"</p>\n\n<p>Comey testified before Congress from his home in McLean, Virginia, which is why the former FBI director was investigated in the state's eastern judicial district.</p><p>The charges come just days after the president <span class=\"link\">tapped his former defense lawyer</span> and White House aide, Lindsey Halligan, to temporarily lead the U.S. Attorney's Office for the Eastern District of Virginia. Halligan, who has no prosecutorial experience, took over as interim U.S. attorney following the <span class=\"link\">abrupt departure</span> of Erik Siebert amid apparent pressure from the president and his allies to bring criminal charges against New York Attorney General Letitia James.</p><p>The Comey indictment is signed only by Halligan, and no other rank-and-file prosecutors' names appear on the charging documents.</p><p>Halligan said in a press release, \"The charges as alleged in this case represent a breach of the public trust at an extraordinary level.\"</p><p>Siebert informed staff on Friday, Sept. 19, that he had resigned, an announcement that came after multiple sources told CBS News that prosecutors in his office were concerned Siebert could be removed for failing to prosecute James for alleged mortgage fraud. James has denied any wrongdoing. Mr. Trump has <span class=\"link\">said he fired Siebert</span>.</p><p>The president publicly voiced frustration to Attorney General Pam Bondi for the lack of action against Comey, James and Democratic Sen. Adam Schiff of California, another political opponent, and warned on social media it was \"killing our reputation and credibility.\" </p><p>\"They impeached me twice, and indicted me (5 times!), OVER NOTHING. JUSTICE MUST BE SERVED, NOW!!!\" Mr. Trump wrote on the social media platform Truth Social, referring to the federal and state criminal cases brought against him.</p>\n\n<p>He announced Halligan as his pick to lead the Eastern District of Virginia shortly after, writing she is \"fair, smart and will provide desperately needed, JUSTICE FOR ALL!\" </p><p>Comey and Mr. Trump have sparred for years. Comey served as FBI director from 2013 until <span class=\"link\">he was fired</span> by Mr. Trump in 2017, during the president's first White House term.</p><p>That firing ultimately set into motion <span class=\"link\">Mueller's special counsel investigation</span> into allegations that <span class=\"link\">Russia interfered</span> in the 2016 presidential election and that the Trump campaign coordinated with the Kremlin. Mr. Trump has repeatedly denounced those allegations as a \"hoax.\"</p><p>For his part, Comey has been a vocal critic of Mr. Trump since his firing, calling him \"morally unfit\" to be president <span class=\"link\">in a 2018 interview</span>.</p><p>Earlier this year, Comey <span class=\"link\">provoked an outcry</span> from the Trump administration after he briefly posted a photo on social media that administration officials alleged was a call for violence against Mr. Trump. As a result, Secret Service agents interviewed Comey for about an hour and a half. </p><p>In an interview, Mr. Trump said it was \"loud and clear\" that Comey was calling for his assassination, telling Fox News that any charges for the post should be left to Bondi. Comey denied advocating violence.</p><p>Since returning to the White House for a second term, the president has been engaged in wide-ranging efforts to go after his political opponents and has used different levers of the federal government to do so. His administration <span class=\"link\">revoked security clearances</span> from former President Joe Biden, former Vice President Kamala Harris and former Secretary of State Hillary Clinton, <span class=\"link\">among others</span>. He also <span class=\"link\">directed that security clearances</span> of 37 current and former national security officials be rescinded.</p>\n\n<p>Mr. Trump also <span class=\"link\">ended Secret Service protection</span> for Harris, former national security adviser <span class=\"link\">John Bolton</span>, and Biden's two children, <span class=\"link\">Hunter and Ashley Biden</span>.</p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Former FBI Director James Comey posts video statement, vows to fight charges",
      "link": "https://www.cbsnews.com/news/james-comey-video-statement-vows-fight-charges/",
      "source": "CBS News",
      "pub_time": "2025-09-25T22:46:07-04:00",
      "description": "James Comey posted a video to Instagram following the Justice Department's indictment on two charges, one count of making false statements and one count of obstruction of justice.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>Former FBI Director <span class=\"link\">James Comey was indicted</span> by the Justice Department on Thursday. He has been charged with one count of making false statements and one count of obstruction of justice, related to Senate testimony he gave almost five years ago. </p><p>In a video posted to Instagram following the indictment announcement, Comey asserted his innocence.</p><p>Comey, who was fired by President Trump in 2017, begins his video by saying he and his family \"have known for years that there are costs to standing up to Donald Trump, but we couldn't imagine ourselves living any other way.\"</p><p>\"We will not live on our knees, and you shouldn't either,\" he says. </p><p>\"Somebody that I love dearly recently said that fear is the tool of a tyrant, and she's right, but I'm not afraid, and I hope you're not either,\" Comey continues, appearing to reference his daughter, Maurene Comey, a former federal prosecutor in New York who helped prosecute Sean \"Diddy\" Combs and previously worked on the prosecutions of Jeffrey Epstein and Ghislaine Maxwell. <span class=\"link\">Maurene Comey was fired by the Justice Department</span> in July and said in a note to colleagues confirming her departure: \"Fear is the tool of a tyrant, wielded to suppress independent thought.\"</p>\n\n<p>James Comey says in the video Thursday night, \"I hope instead you are engaged, you are paying attention, and you will vote like your beloved country depends upon it, which it does.\" </p><p>\"My heart is broken for the Department of Justice, but I have great confidence in the federal judicial system, and I'm innocent. So let's have a trial and keep the faith,\" he adds.</p><p>In a Truth Social post on Thursday night, President Trump celebrated the former FBI director's indictment, calling Comey \"one of the worst human beings this Country has ever been exposed to.\"</p><p>James Comey's attorney, Patrick J. Fitzgerald, said in a statement: \"Jim Comey denies the charges filed today in their entirety. We look forward to vindicating him in the courtroom.\"</p>\n\n<p>A majority of grand jurors did not approve indicting James Comey on an additional count of lying to Congress, according to court papers — an unusual development since grand juries rarely reject charges.</p><p>The indictment was returned in the Eastern District of Virginia, just days before the five-year statute of limitations for charges arising out of his September 2020 testimony to Congress was set to expire on Tuesday. </p>\n<p class=\"content__meta--contributors\">\nJennifer  Jacobs, \n                                                  \n                                  Scott  MacFarlane, \n                                                  \n                                  Melissa  Quinn, \n                                                  \n                                  Jacob  Rosen and \n                                                  \n                                  Joe  Walsh\n                  \n        contributed to this report.\n    </p>\n</section>\n</div></body></html>"
    },
    {
      "title": "Tropical Storm Humberto forms in Atlantic. Maps show its forecast path.",
      "link": "https://www.cbsnews.com/news/humberto-map-forecast-national-hurricane-center/",
      "source": "CBS News",
      "pub_time": "2025-09-25T22:42:48-04:00",
      "description": "Tropical Storm Humberto could potentially bring some downstream impacts to parts of the Southeast U.S. coast from Florida up to North Carolina, the National Hurricane Center said.",
      "image_url": "",
      "content": "<html><body><div><article class=\"content content-article lazyload\" data-index=\"0\" data-path=\"/news/humberto-map-forecast-national-hurricane-center/\" id=\"article-0\">\n\n\n\n<section class=\"content__body\">\n<p>Tropical Storm Humberto formed Wednesday in the central tropical Atlantic, and it is expected to move northwest over the next several days, according to the National Hurricane Center. The storm is one of two systems swirling over the western Atlantic that could potentially bring some downstream impacts to parts of the Southeast U.S. coast, from Florida up to North Carolina, the director of the Miami-based hurricane center, Michael Brennan, said.</p><p>Currently, there are no coastal watches or warnings in effect. </p><h2>Tropical Storm Humberto forecast and path</h2><p>As of Thursday evening, Humberto was located about 470 miles northeast of the northern Leeward Islands. It was moving northwest at about 6 mph with maximum sustained winds of 60 mph.</p><p>\"Significant strengthening is forecast, and Humberto is expected to become a hurricane on Friday and a major hurricane this weekend,\" the hurricane center said on Thursday evening.</p>\n<p>Tropical-storm-force winds extend outward up to 90 miles from the center of Humberto.</p>\n\n<p>It is the eighth named storm of the 2025 Atlantic hurricane season. The tropical storm comes on the heels of <span class=\"link\">Hurricane Gabrielle</span>, which is not impacting land and is forecast to head farther out into the Atlantic.</p><h2>Another storm system brews over the Caribbean</h2><p>The hurricane center said it is also closely monitoring a second storm system over the northeast Caribbean in the Atlantic near Humberto.</p>\n<p>The system is likely to become a tropical depression late this week, forecasters said.</p><p>It is likely to bring heavy rains near Puerto Rico and the Dominican Republic through Wednesday before strengthening near the Bahamas, according to the NHC.</p>\n\n</section>\n</article>\n</div></body></html>"
    },
    {
      "title": "Alabama man convicted of killing store clerk in 1997 is executed by nitrogen gas",
      "link": "https://www.cbsnews.com/news/alabama-executes-geoffrey-todd-west-nitrogen-gas-1997-shooting-death-store-clerk/",
      "source": "CBS News",
      "pub_time": "2025-09-25T21:30:51-04:00",
      "description": "Alabama on Thursday night executed Geoffrey Todd West, 50, by nitrogen gas for the 1997 fatal shooting of Margaret Parrish Berry, 33.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>An Alabama man convicted of killing a woman during a 1997 gas station robbery was put to death Thursday after apologizing to his victim's family and pleas from the woman's son to spare his life. </p><p>Geoffrey Todd West, 50, was executed at William C. Holman Correctional Facility by <span class=\"link\">nitrogen gas</span>, a method <span class=\"link\">Alabama began using last year</span>. It was one of two executions of the night in the country, as <span class=\"link\">Texas put to death</span> a man convicted of killing his girlfriend's 13-month-old daughter.  </p><p>West was convicted of capital murder in the 1997 killing of Margaret Parrish Berry, 33. </p><p>West said \"No sir\" when asked by the warden if he had final words. Strapped to the gurney with a blue-rimmed gas mask covering his face, he gave a thumbs-up in the direction of his attorney as the execution began at about 5:56 p.m. </p><p>West's eyes were open as he appeared to gulp and struggle for breath during the first two minutes. His head rocked from side to side, his left fist curled up, and he appeared to slightly foam at the mouth. At about 6:01, he began to take a long series of breaths with long pauses in between before becoming still at about 6:07. He was pronounced dead at 6:22. </p>\n\n<p>In a final statement provided by his attorney, West said: \"I have apologized privately to the family of Margaret Parrish Berry, and am humbled by the forgiveness her son, Will, has extended.\"</p><p>He added that he was baptized in the Catholic Church this year and was \"at peace because I know where I am going.\" </p><p>Berry, the mother of two sons, was shot in the back of the head while lying on the floor behind the counter at Harold's Chevron in Etowah County on March 28, 1997.</p><p>Prosecutors said she was killed execution-style to ensure there was no witness. Court records state that $250 was taken from a cookie can that held the station's money. A jury voted 10-2 to recommend a death sentence.</p>\n\n<p>West, in an interview last week, did not deny killing Margaret Berry. He said that at age 50, he struggles to understand what he did as a young man. He and his girlfriend were desperate for cash and went to the station, where he once worked, to rob it.</p><p>\"There's not a day that goes by that I don't regret it and wish that I could take that back,\" West told AP by telephone. He said he wanted Berry's family to know he regrets what happened. </p><p>Will Berry urged Alabama's governor to commute West's sentence to life in prison. He said taking another life will not help his family. He exchanged letters with West ahead of the execution. </p><p>\"I forgive him and so does my dad. We don't want him to die,\" Will Berry said. </p><p>He was 11 when his mother was killed, and he said prosecutors urged the family to support a death sentence. Now a father and grandfather, Will Berry said time and faith have given him a different perspective. </p><p>Alabama Gov. Kay Ivey said in a Sept. 11 letter to Berry that she intended to let the execution go forward. She wrote that she appreciates his belief but said it is her duty to uphold Alabama law.</p><p>\"Almost 30 years ago, Margaret Parrish Berry went to work at the convenience store, but she would never get to return home. Geoffrey West went in with the intent to rob and kill, and he cowardly shot Ms. Berry in the back of the head,\" Ivey said in a statement issued after the execution. </p>\n\n<p>\"Tonight, the lawfully imposed death sentence has been carried out, justice has been served, and I pray for healing for all,\" the governor added. </p><p>Also in a statement Thursday, Will Berry expressed astonishment at the execution and offered condolences to West's loved ones. </p><p>\"From what we understand, he acted out of character that night. People he grew up with said he was a good person who got off track,\" Berry said. \"We pray that he gains peace when he meets his maker.\"</p><p>Berry and West asked to meet ahead of the execution, but the Alabama Department of Corrections denied the request, citing security regulations.</p><p>The Federal Defenders Office of the Middle District, which represented West, said in a statement that denying the meeting was a \"lost opportunity — for closure, for healing, for humanity.\"</p><p>\"The execution of Mr. West demands that we reflect as a society: on how we handle capital punishment, on how age and life circumstances are considered, on how we balance justice, mercy, and the possibility of redemption,\" his attorneys said in a statement. </p><p>The execution method used to put West to death involved strapping a gas mask to his face and forcing him to breathe pure nitrogen gas, depriving him of the oxygen needed to stay alive. </p>\n\n<p>Asked about West's movements during the execution. Corrections Commissioner John Hamm said he believes they were largely involuntary and things went \"just as expected, according to protocol.\" </p><p>Alabama became the first state to carry out a nitrogen gas execution in 2024. Nationally, the method has now been used in seven executions: six times in Alabama and once in Louisiana. </p>\n</section>\n</div></body></html>"
    },
    {
      "title": "$1.5 billion settlement approved over Anthropic's alleged use of pirated books",
      "link": "https://www.cbsnews.com/news/judge-approves-1-5-billion-dollar-settlement-anthropic-pirated-books/",
      "source": "CBS News",
      "pub_time": "2025-09-25T21:20:00-04:00",
      "description": "The settlement will pay authors and publishers about $3,000 for each of the approximately 465,000 books covered by the agreement.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>A federal judge on Thursday <span class=\"link\">approved a $1.5 billion settlement</span> between artificial intelligence company Anthropic and authors who allege nearly half a million books had been illegally pirated to train chatbots.</p><p>U.S. District Judge William Alsup issued the preliminary approval in San Francisco federal court Thursday after the two sides worked to address his concerns about the settlement, which will pay authors and publishers about $3,000 for each of the books covered by the agreement. It does not apply to future works.</p><p>\"This is a fair settlement,\" Alsup said, though he added that distributing it to all parties will be \"complicated.\" About 465,000 books are on the list of works pirated by Anthropic, according to Justin Nelson, an attorney for the authors.</p><p>\"We have some of the best lawyers in America in this courtroom and if anyone can do it, you can,\" Alsup said.</p><p>The Association of American Publishers called the settlement a \"major step in the right direction in holding AI developers accountable for reckless and unabashed infringement.\"</p>\n\n<p>\"Anthropic is hardly a special case when it comes to infringement. Every other major AI developer has trained their models on the backs of authors and publishers, and many have sourced those works from the most notorious infringing sites in the world,\" said Maria A. Pallante, president and CEO of the publisher group.</p><p>San Francisco-based Anthropic said it is pleased with the preliminary approval.</p><p>\"The decision will allow us to focus on developing safe AI systems that help people and organizations extend their capabilities, advance scientific discovery, and solve complex problems. As we've consistently maintained, the court's landmark June ruling that AI training constitutes transformative fair use remains intact. This settlement simply resolves narrow claims about how certain materials were obtained,\" said Aparna Sridhar, deputy general counsel at Anthropic.</p><p>The Authors Guild, meanwhile, said the settlement \"marks a milestone in authors' fights against AI companies' theft of their works. It sends a clear signal to AI companies that infringement of authors' rights comes at a steep price and will undoubtedly push AI companies towards acquiring the books they want legally, through licensing.\"</p>\n\n<p>A Monday filing sought to convince the judge that the parties have set up a system designed to get out robust notice to all authors and publishers covered by the agreement, ensuring they get their cut of the pot if they want to sign off on the settlement or opt out to protect their legal rights moving forward.</p><p>They also tried to assure him that the author and publishers group that cobbled the deal together are not doing any \"back room\" dealings that would hurt lesser-known authors.</p><p>Alsup's main concern centered on how the claims process will be handled in an effort to ensure everyone eligible knows about it so the authors don't \"get the shaft.\" He had set a Sept. 22 deadline for submitting a claims form for him to review before Thursday's hearing to review the settlement again.</p><p>The judge had raised worries about two big groups connected to the case — the Authors Guild and the Association of American Publishers — working \"behind the scenes\" in ways that could pressure some authors to accept the settlement without fully understanding it.</p><p>Attorneys for the authors said in Monday's filing they believe the settlement will result in a high claims rate, respects existing contracts and is \"consistent with due process\" and the court's guidance.</p><p>Alsup had <span class=\"link\">dealt the case a mixed ruling in June</span>, finding that training AI chatbots on copyrighted books wasn't illegal but that Anthropic wrongfully acquired millions of books through pirate websites to help improve its Claude chatbot.</p><p>Bestselling thriller novelist Andrea Bartz, who sued Anthropic with two other authors last year, said in a court declaration ahead of the hearing that she strongly supports the settlement and will work to explain its significance to fellow writers.</p>\n\n<p>\"Together, authors and publishers are sending a message to AI companies: You are not above the law, and our intellectual property isn't yours for the taking,\" she wrote.</p><p>Alsup also said in the courtroom Thursday that he plans to step down from the bench by the end of the year. President Bill Clinton nominated him for the federal bench in 1999.</p>\n</section>\n</div></body></html>"
    },
    {
      "title": "California bill sparked by waking baby could silence streaming ads nationwide",
      "link": "https://www.cbsnews.com/news/california-bill-waking-baby-silence-streaming-ads-nationwide/",
      "source": "CBS News",
      "pub_time": "2025-09-25T21:13:29-04:00",
      "description": "Believe it or not, an 8-month-old's sleep schedule is leading to a face-off between California lawmakers and the entertainment industry over loud commercials on streaming services.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>Believe it or not, an 8-month-old's sleep schedule is leading to a face-off between California lawmakers and the entertainment industry over loud commercials on streaming services.</p><p>California Senate Bill 576, introduced by state Senator Tom Umberg, would keep Netflix, Prime Video, and other streamers from blasting commercial volume way above the level of whatever show or movie you're watching.</p><p>Federal law already prohibits regular TV broadcasters from running commercials that are way louder than the program you're watching. However, streaming services weren't around when they passed the federal Commercial Advertisement Loudness Mitigation (CALM) Act back in 2010. So it doesn't apply to them.</p><p>Umberg's bill is trying to change that. The bill demonstrates the power of the California lawmakers to do something the federal government can't.</p><p>In a state this big, companies generally don't create one policy or product for California and another for everyone else. So as goes California, goes the nation.</p>\n\n<h2>Don't wake the baby!</h2><p>Little Samantha is accomplished beyond her years — well, months — and may be the youngest lobbyist in California history, even if she is more interested in chewing on her legislation than reading it.</p><p>Her parents, Zach and Rachel Keller, were doing what new parents do: settling in to watch TV after finally getting Samantha down for the night.</p><p>That is when a blaring commercial abruptly ended their moment of peace, waking Samantha again. </p><p>\"A lot of times, we have the volume so low that we just have subtitles running and still, the commercial ad volumes are so ear-piercing that it wakes her up,\" Rachel Keller said.</p>\n\n<p>They're not the only ones who are frustrated. Forum and forum, and review after review, people across the country are complaining about loud streaming commercials and ads.</p><p>Samantha's parents thought it was time to close that streaming loophole in the federal CALM Act. Zach Keller works for Senator Umberg.</p><p>\"I thought, 'I've got three kids, eight grandchildren. That's a good idea,' Umberg told CBS News California. \"I think it's one of the most popular bills in the legislature, but it's not popular with everyone.\"</p><p>The bill was unanimously passed by the state Senate and sailed through its Assembly committee. But it stalled before its final vote as the powerful Motion Picture Association fought hard to kill the bill, arguing it could hurt small independent streaming services.</p><p>Unlike the broadcasting cable networks, streaming ads come from several different sources and cannot necessarily or practically be controlled by streaming platforms.</p><p>\"'Are you kidding?' That's my response [to that]. They know which hand I use to basically control the remote. They can basically figure out how to make them within a normal range,\" Umberg said.</p><p>None of the streaming services responded to our emails, and the Motion Picture Association declined an interview.</p>\n\n<p>As for Samantha and her very tired parents, they hope this bill ultimately helps babies across the country sleep a little more soundly.</p><p>The bill is now on Gov. Gavin Newsom's desk. The question is: Will he sign it?</p><p>If signed by Newsom, the commercial volume restrictions for streaming services would go into effect on July 1, 2026.</p><p>Netflix co-founder Reed Hastings just donated $2 million to the governor's congressional redistricting ballot measure campaign. Newsom's office told us it \"does not typically comment on pending legislation.\"</p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Texas man executed for fatally beating 13-month-old girl during \"exorcism\"",
      "link": "https://www.cbsnews.com/news/texas-man-execution-beating-13-month-old-girl-exorcism/",
      "source": "CBS News",
      "pub_time": "2025-09-25T21:04:34-04:00",
      "description": "A Texas man was executed Thursday for killing his girlfriend's 13-month-old daughter in a torturous ordeal the couple said was part of an \"exorcism\" to expel a demon from the child's body.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>A Texas man was executed Thursday for killing his girlfriend's 13-month-old daughter in a torturous ordeal the couple said was part of an \"exorcism\" to expel a demon from the child's body.</p><p>Blaine Milam, 35, was pronounced dead at 6:40 p.m. following a lethal injection at the state penitentiary in Huntsville. He was condemned for the December 2008 <span class=\"link\">murder of Amora Carson</span> at his trailer in Rusk County in East Texas.</p><p>In a final statement, Milam thanked supporters as well as the prison chaplaincy for opening its faith-based programs to death row inmates.</p><p>\"If any of you would like to see me again, I implore all of you no matter who you are to accept Jesus Christ as your Lord and Savior and we will meet again,\" he said from the death chamber gurney. \"I love you all. Bring me home, Jesus.\"</p><p>As the lethal dose of sedative pentobarbital began flowing into his right hand and left arm, at 6:19 p.m. CDT, Milam grunted and gasped once, then began snoring quietly. After about two minutes, all sounds and movement stopped. Minutes later, he was declared dead.</p>\n\n<p>It was one of two executions carried out Thursday evening in the U.S. Geoffrey West was put to death in Alabama with nitrogen gas for fatally shooting a gas station employee during a 1997 robbery. The two executions brought the year's total to 33 death sentences carried out nationwide.</p><p>Milam had blamed his then-girlfriend, Jesseca Carson, for the killing and alleged she was the one who claimed the girl was possessed by a demon. She was tried separately from Milam and sentenced to life in prison without the possibility of parole after being convicted of capital murder for helping Milam. Both were 18 at the time.</p><p>Prosecutors said Milam savagely beat the girl and also bit, strangled, and mutilated her over a period of 30 hours. Court documents show a pipe wrench was among the evidence that tied Milam to the slaying.</p><p>A forensic pathologist who performed an autopsy found the child had multiple skull fractures along with broken arms, legs, ribs, and numerous bite marks. The pathologist testified at trial that he could not determine a specific cause of death because the girl had so many potentially fatal injuries.</p>\n\n<p>Rusk County District Attorney Michael Jimerson, who tried the case along with the Texas Attorney General's Office, told The Associated Press in 2019 that authorities initially treated Milam and Carson as grieving parents.</p><p>But Carson later told investigators Milam told her Amora was \"possessed by a demon\" because \"God was tired of her lying to Milam,\" according to court records.</p><p>Jimerson said at the time he still couldn't pinpoint a motive, believing the exorcism claim was just a way for Milam and Carson to cover up their crime.</p><p>The prosecutor witnessed the execution.</p><p>\"We will never know what Amora would have contributed to our world,\" Jimerson said Thursday evening after it was over. \"Answering the call for justice for the most helpless is a measure of a civilized people.\"</p><p>Among other observers was the child's grandfather, Richard Mutina. He declined to speak with reporters after the execution.</p><p>Milam was the fifth person put to death this year in Texas, historically the nation's busiest capital punishment state. Florida leads the nation this year with a record 12 executions conducted to date in 2025, with two more scheduled in the state by mid-October.</p>\n\n<p>The execution was carried out hours after the U.S. Supreme Court rejected Milam's final appeals.</p><p>Rebuffed previously by state and federal appeals courts, Milam's attorneys had asked the Supreme Court to block the execution, arguing his conviction was based in part on \"now-discredited\" bite mark evidence and other unreliable DNA evidence. They also argued he was intellectually disabled and thus ineligible for execution.</p><p>The Texas Attorney General's Office has said Milam's claims of an intellectual disability had been rejected previously by the courts. The attorney general's office also said in court documents that even if bitemark and DNA evidence were excluded, there was other evidence pointing to his guilt, including his efforts to hide evidence and a confession he made to a nurse after his arrest.</p><p>The use of bite mark evidence has been called into question in recent years, with a 2016 report by the President's Council of Advisors on Science and Technology saying bitemark analysis \"is clearly scientifically unreliable at present.\"</p><p>On Tuesday, the Texas Board of Pardons and Paroles denied Milam's request to commute his death sentence to a lesser penalty. Milam previously had execution dates in 2019 and 2021 <span class=\"link\">that were stayed</span>.</p>\n</section>\n</div></body></html>"
    },
    {
      "title": "We asked the candidates for California governor: What has Newsom done well?",
      "link": "https://www.cbsnews.com/news/california-governor-candidates-one-question/",
      "source": "CBS News",
      "pub_time": "2025-09-25T21:03:58-04:00",
      "description": "Julie Watts interviewed every candidate for California governor ahead of next year's election.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>What has the California Legislature and Gov. Gavin Newsom done well, and what could be done differently?</p><p>CBS News California Investigates correspondent Julie Watts asked each of the candidates running for California governor.</p><p>For this series, Watts interviewed 11 gubernatorial candidates, pressing them on more than a dozen issues that matter to voters.</p><p>Read on to see what each candidate thinks Newsom has done right and to learn what they'd do differently.</p><h2>  Toni Atkins  </h2>\n<p>Former California State Senate President Pro Tem Toni Atkins is one of the high-profile Democrats running to replace Gov. Newsom when he terms out in 2026. The San Diego resident praised Newsom's effort to go \"toe-to-toe\" with the Trump administration and Texas by redrawing California's congressional districts. Atkins also said that, if elected, one of her biggest priorities would be addressing health care. Watch Atkins' response here.</p>\n\n<h2>  Xavier Becerra  </h2>\n<p>Xavier Becerra, a former California attorney general who served as Health and Human Services secretary in the Biden administration, is another Democrat looking to replace Gov. Newsom in 2026. Becerra said Newsom deserves more credit for strengthening the state's economy and explained why California's redistricting effort is necessary. On what he'd do differently, Becerra said he would have acted more quickly than Newsom on addressing issues like with California's high-speed rail project and the statewide housing crisis. Watch Becerra's response here.</p><h2>  Chad Bianco  </h2>\n<p>Sheriff Chad Bianco of Riverside County is one of the Republicans running for California governor in 2026. Bianco said the only thing he believes Newsom has done well is \"acting like a Republican\" in what he says is the governor's bid for the White House. Bianco added that he couldn't think of a single thing the state Legislature has done right during his seven years as sheriff. Watch Bianco's response here.</p><h2>Ian Calderon</h2>\n<p>Ian Calderon, a business owner and former state Assembly majority leader, is running as a Democrat in California's 2026 gubernatorial race. Calderon praised Newsom for his efforts to address California's housing crisis and the legislature for focusing on addressing online safety for children. Calderon said he does believe the State of California has \"lost the plot,\" meaning that state leaders should focus more on California issues rather than what's going on in Washington, D.C. Watch Calderon's response here.</p><h2>  Stephen J. Cloobeck  </h2>\n<p>Another Democrat looking to replace Gov. Newsom in 2026 is business executive Stephen J. Cloobeck. Cloobeck said what he believes Newsom has done well as governor is be active in the public and communities. On why he's in the gubernatorial race, Cloobeck said he's \"sick and tired\" of the Trump administration \"making us look silly.\" Watch Cloobeck's response here.</p>\n\n<h2>  Steve Hilton  </h2>\n<p>Public policy expert Steve Hilton is one of the Republicans running for California governor. Hilton said the thing he most agrees with Newsom on is limiting smartphone use in schools. If elected, Hilton said he would work to improve California's rising housing costs, which he said he believes is the top reason why residents are leaving the state. Watch Hilton's response here.</p><h2>  Katie Porter  </h2>\n<p>Consumer protection attorney and law professor Katie Porter is among the long list of Democrats running to replace Gov. Newsom next year. Porter praised Newsom for making school lunches free through the governor's universal meals program. Porter said, if she were governor, she would work to bring down housing costs statewide. Watch Porter's response here.</p><h2>  Tony Thurmond  </h2>\n<p>California's Superintendent of Public Instruction Tony Thurmond said he is running for governor because \"California is at a critical inflection point\" that could lead to prosperity or further decline. Thurmond, a Democrat, lauded Gov. Newsom for being a creative thinker and for his investments in public education. Thurmond said, if elected, he would work to improve California's insurance crisis and create more affordable housing. Watch Thurmond's response here.</p><h2>  Antonio Villaraigosa  </h2>\n<p>Former Los Angeles Mayor Antonio Villaraigosa, a Democrat, said he is running for California governor to give the state a leader who is \"a proven problem solver.\" Villaraigosa criticized Newsom's decision to keep kids out of schools for as long as he did during the COVID-19 pandemic. Villaraigosa said two things Newsom and the state Legislature got right were health care and child care. Watch Villaraigosa's response here.</p><h2>  Butch Ware  </h2>\n<p>The only Green Party candidate running for governor is University of California professor Butch Ware. Ware said two of his biggest critiques of the Newsom administration are the governor's response to immigration raids across the state and his failure to address the homeless crisis. Ware said he doesn't agree with Newsom's use of social media to challenge the Trump administration, but appreciated the governor's effort to fight back. Watch Ware's response here.</p><h2>  Betty Yee  </h2>\n<p>Former State Controller Betty Yee is another Democrat running for California governor. Yee commended Gov. Newsom's ability to be present during key issues like the COVID-19 pandemic. On how she would improve upon Newsom's time as governor, Yee said she would improve California's fiscal accountability. Watch Yee's response here.</p><h2>  Leo Zacky  </h2>\n<p>Business owner Leo Zacky is one of the few Republicans in California's gubernatorial race. Zacky said he's running for governor to \"bring common sense solutions to save my home state.\" Zacy said there hasn't been a single thing Gov. Newsom or the state Legislature has done well over the last seven years. Zacky specifically criticized California for raising the minimum wage for fast food workers. Watch Zacky's response here.</p>\n<p>CBS News California Investigates correspondent Julie Watts moderated a recent gubernatorial education forum, hosted by Asian Pacific American Public Affairs  and Sacramento State University. You can watch the forum here.</p>\n\n<p>Subscribe to our CBS News California YouTube channels and follow us on social media to hear from each candidate on the issues that matter most to you.</p><p><strong>SUBSCRIBE &amp; FOLLOW</strong></p><p>Julie Watts, CBS News California Investigates: @JulieWattsTV INSTAGRAM, TIKTOK, YOUTUBE</p><p>CBS News Sacramento: @CBSSacramento INSTAGRAM, TIKTOK, YOUTUBE</p><p>CBS News San Francisco: @KPIXTV INSTAGRAM, TIKTOK, YOUTUBE</p><p>CBS News Los Angeles: @KCALNews INSTAGRAM, TIKTOK, YOUTUBE</p>\n<p>#CBSNewsCaliforniaInvestigates</p>\n<aside class=\"component list recirculation component--type-recirculation component--type-recirculation-collection\">\n<div class=\"component__heading-wrapper\">\n<h3 class=\"component__title\">CBS News California Investigates\n                          \n                More\n                <svg aria-hidden=\"true\" class=\"icon__caret-right\" viewbox=\"0 0 32 32\">\n\n</svg>\n\n</h3>\n</div>\n</aside>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Humberto could mingle with another storm to create rare Fujiwhara effect",
      "link": "https://www.cbsnews.com/news/humberto-another-developing-storm-fujiwhara-effect/",
      "source": "CBS News",
      "pub_time": "2025-09-25T20:55:00-04:00",
      "description": "Tropical Storm Humberto was on its way toward becoming a hurricane within a day or so over the central Atlantic, the National Hurricane Center said.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p><span class=\"link\">Tropical Storm Humberto</span>, the eighth named storm to emerge this hurricane season, is currently swirling over waters just north of the Caribbean. Although forecasts as of Thursday predict that Humberto won't ever touch land, there is a possibility it could interact with another system developing nearby in the western Atlantic. </p><p>That's an unlikely outcome, said CBS News meteorologist Nikki Nolan. But if such a collision does occur, it could produce what's called <span class=\"link\">the Fujiwhara effect</span>, a rare phenomenon in which two different storms merge and become entangled around a newly formed, common center. </p><p>How the process plays out depends on the characteristics of the storms involved, according to the National Weather Service. The forecasting agency describes the Fujiwhara effect on its website as \"an intense dance\" between two tropical storms that can happen when they get close enough to each other on their respective tracks to reach a common point and either join together or spin around each other for a period of time before continuing along their individual paths.  </p>\n<p>In the latter scenario, the storms involved must be comparably strong or large.</p><p>\"Typically when one system is stronger than the other, the smaller and weaker system will get overrun by the larger, stronger one and completely eliminate it,\" Nolan said. </p><p>Similar systems \"will dance around each other\" before going their separate ways, she continued, adding: \"Very rarely has a larger system absorbed a smaller one and become larger or stronger, but it is scientifically possible.\"</p>\n\n<p>Humberto grew into a tropical storm Wednesday night while traveling over open waters in the central tropical Atlantic. Forecasters expect it to move northwest over the next few days and strengthen along the way, the National Hurricane Center said in an advisory. It's one of two systems in the region that could potentially impact parts of the southeastern United States, including coastal areas from Florida to North Carolina, according to Michael Brennan, director of the hurricane center.</p><p>Officials at the center said Wednesday that they were monitoring a second storm churning near Humberto over the northeastern Caribbean, which would likely become a tropical depression later in the week and a tropical storm, named Imelda, over the weekend. That system is expected to strengthen as it tracks toward the Bahamas — driving up the chances of storm surge, wind and rainfall striking coastal parts of the southeastern U.S.</p><p>\"With the two tropical troubles currently north of the Caribbean, these two may interact under the Fujiwhara effect in the days ahead,\" said Nolan. However, because the developing system \"appears to be much weaker than Humberto and several miles away from it,\" an interaction between the two — if one even takes place at all — may not result in a tangled gravitational \"dance.\" </p><p>In the event Humberto and the second system do collide, it's possible the paths they're expected to travel will change, Nolan added, but only slightly.</p>\n\n<p>The National Hurricane Center said in an advisory Thursday morning that Humberto was on its way toward becoming a hurricane within a day or so over the central Atlantic. At the time, the storm was located about 465 miles east-northeast of the northern Leeward Islands and had maximum sustained winds of 50 mph.</p>\n<p class=\"content__meta--contributors\">\nNikki  Nolan\n                  \n        contributed to this report.\n    </p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "U.S. to impose tariffs on pharmaceutical drugs, furniture and heavy trucks",
      "link": "https://www.cbsnews.com/news/tariff-pharmaceutical-drugs-kitchen-cabinets-furniture-heavy-trucks/",
      "source": "CBS News",
      "pub_time": "2025-09-25T20:31:00-04:00",
      "description": "President Trump announced a 100% tariff on pharmaceutical drugs, a 50% tariff on kitchen cabinets and bathroom vanities, a 30% tariff on upholstered furniture and a 25% tariff on heavy trucks.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>President Trump announced Thursday that the U.S. would impose a new round of tariffs, including a 100% tariff on pharmaceutical drugs, a 30% tariff on upholstered furniture, a 50% tariff on kitchen cabinets and bathroom vanities, and a 30% tariff on heavy trucks. </p><p>In social media posts to Truth Social, Mr. Trump said the new tariffs would take effect Oct. 1. </p><p>Mr. Trump said in his posts that the 100% tariff on \"any branded or patented Pharmaceutical Product\" would not apply to companies building manufacturing plants in the U.S., which he defined as either \"breaking ground\" or being \"under construction.\"</p><p>In 2024, America imported nearly $233 billion in pharmaceutical and medicinal products, according to the Census Bureau. The prospect of prices doubling for some medicines could send shockwaves to voters <span class=\"link\">as health care expenses</span>, as well as the costs of Medicare and Medicaid, potentially increase.</p><p>Trump argued that foreign manufacturers of furniture and cabinetry were \"flooding\" the U.S. with their products and that tariffs must be applied \"for National Security and other reasons.\" </p>\n\n<p>The new tariffs on cabinetry could further increase the costs for homebuilders at a time when many people <span class=\"link\">seeking to buy a house</span> feel priced out by the mix of housing shortages and high mortgage rates.</p><p>Last month, Mr. Trump announced on social media that a \"major Tariff Investigation\" was being conducted on furniture coming into the U.S. and said that within the next 50 days, the investigation would be completed, and a tariff rate would be announced. </p><p>The president said the 25% tariff on \"all 'Heavy (Big!) Trucks' made in other parts of the world\" was \"in order to protect our Great Heavy Truck Manufacturers from unfair outside competition.\" </p><p>\"Large Truck Company Manufacturers, such as Peterbilt, Kenworth, Freightliner, Mack Trucks, and others, will be protected from the onslaught of outside interruptions,\" Trump posted.</p>\n\n<p>Throughout much of 2025, the Trump administration's broad tariffs defied predictions that they would fuel inflation, but that respite seems to have ended after <span class=\"link\">economic data this month showed</span> the duties are now driving prices upward. The Consumer Price Index in <span class=\"link\">August rose at a rate of 2.9%</span> from a year ago, up from an annual pace of 2.3% in April, when Mr. Trump <span class=\"link\">first launched a sweeping set</span> of import taxes.</p><p>Nor is there evidence that the tariffs are creating factory jobs or more construction of manufacturing facilities. Since April, the Bureau of Labor Statistics has reported that manufacturers cut 42,000 jobs and builders have downsized by 8,000.</p><p>\"There's no inflation,\" Mr. Trump told reporters Thursday. \"We're having unbelievable success.\"</p>\n</section>\n</div></body></html>"
    },
    {
      "title": "Democrats dismiss White House's shutdown layoff threat as \"intimidation\"",
      "link": "https://www.cbsnews.com/news/government-shutdown-layoffs-democrats/",
      "source": "CBS News",
      "pub_time": "2025-09-25T20:28:02-04:00",
      "description": "Democratic leaders dismissed the White House's recent threat that a government shutdown could spur large-scale layoffs of the federal workforce as \"intimidation.\"",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p><em>Washington — </em>Democratic leaders in Congress on Thursday dismissed the White House's recent threat that a government shutdown could spur large-scale layoffs of the federal workforce as \"intimidation,\" standing firm in their position ahead of the Oct. 1 funding deadline.</p><p>The White House's Office of Management and Budget <span class=\"link\">sent a memo</span> to federal agencies on Wednesday telling them to consider reduction-in-force notices, or layoffs, for employees in programs, projects or activities that received discretionary funding. The RIF notices would come in addition to any furlough notices directing federal workers to stay home from work without pay if Congress fails to extend government funding by the deadline. </p><p>Democrats in Congress framed the move as an intimidation tactic by the White House and OMB Director Russ Vought, and said they intend to barrel ahead with their push to secure wins on key health care priorities in exchange for keeping the government funded. </p><p>\"We will not be intimidated by Russ Vought, who's completely and totally out of control,\" House Minority Leader Hakeem Jeffries said at a news conference on Thursday. </p>\n<p>Senate Minority Leader Chuck Schumer shared a similar sentiment in a statement on Wednesday, calling the memo \"an attempt at intimidation.\"</p>\n\n<p>\"Donald Trump has been firing federal workers since day one — not to govern, but to scare,\" Schumer said. \"This is nothing new and has nothing to do with funding the government.\"</p><p>Democrats have repeatedly pushed for negotiations in the funding fight, looking to extract a more favorable outcome using one of their only points of leverage with Republican majorities in the House and Senate. Earlier this month, Democrats introduced a counteroffer to a GOP-led bill to keep the government funded that would also extend expiring health insurance subsidies. </p><p>The House approved a Republican measure to extend funding for seven weeks. Both the GOP bill and the Democrats' proposal fell short in the Senate, leading to the current stalemate.</p><p>After the House approved its bill, GOP leaders extended the lower chamber's break past the Oct. 1 deadline to fund the government, putting pressure on the Senate to approve their proposal. But Jeffries said on Thursday that the House-passed continuing resolution is \"dead on arrival\" in the Senate. He said it's \"unclear\" to him why House Republicans have left D.C. and have \"decided they don't even want to have a conversation with Democrats to reach a bipartisan agreement.\"</p>\n\n<p>\"Republicans control the House, the Senate and the presidency,\" Jeffries said. \"If the government shuts down, it's because they want the government to shut down.\"</p><p>Jeffries and Schumer had also pushed for a meeting with President Trump earlier this week. But Mr. Trump <span class=\"link\">canceled</span> the meeting, citing the Democrats' demands, saying \"no meeting with their Congressional Leaders could possibly be productive.\"</p><p>On Thursday, Jeffries said \"the Democratic position is clear: we will meet and sit down anytime, any place with anyone, including the president, who canceled the meeting because the Republicans have determined that they want to shut down the government and hurt the American people.\"</p>\n<p class=\"content__meta--contributors\">\nAaron  Navarro\n                  \n        contributed to this report.\n    </p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "White House tells agencies to prepare for layoffs if government shuts down",
      "link": "https://www.cbsnews.com/news/white-house-trump-layoffs-omb-government-shutdown/",
      "source": "CBS News",
      "pub_time": "2025-09-25T20:27:33-04:00",
      "description": "The Trump administration is raising the stakes as Congress faces a looming deadline to pass a government funding bill.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p><em>Washington </em>— The White House's Office of Management and Budget sent a memo to federal agencies Wednesday night telling them to prepare layoff plans if there is a government shutdown, increasing the stakes <span class=\"link\">ahead of Congress' Tuesday deadline</span> to pass a government funding bill. </p><p>The news was first reported by Politico.</p><p>The memo, obtained by CBS News, tells agencies to consider reduction-in-force notices — a federal term for layoffs — for employees in programs, projects or activities that have discretionary funding that stops on Oct. 1 or that don't have any alternative sources of funding. It also goes further and says that employees should get RIF notices if they're in programs or projects \"not consistent with the President's priorities.\" </p><p>The RIF notices would be in addition to any furlough notices directing federal workers to stay home from work without pay if there is a shutdown, the memo states. </p><p>\"Programs that did not benefit from an infusion of mandatory appropriations will bear the brunt of a shutdown, and we must continue our planning efforts in the event Democrats decide to shut down the government,\" the memo states. </p>\n\n<p>An OMB official said that several programs will continue regardless of a shutdown, including Social Security, Medicare, veterans' benefits, military operations, law enforcement, Immigration and Customs Enforcement, Customs and Border Protection and air traffic control. These are statutory federal programs and would not be impacted by any potential reductions-in-force.</p><p>\"We remain hopeful that Democrats in Congress will not trigger a shutdown and the steps outlined above will not be necessary. The President supports enactment of a clean CR to ensure no discretionary spending lapse after September 30, 2025, and OMB hopes the Democrats will agree,\" the memo ends with.  </p><p>During the last few major government shutdowns, the executive branch has temporarily furloughed staff who are deemed non-essential and asked people in critical jobs to keep working without pay. After the shutdown ends, federal workers are normally paid back for their missed paychecks. It's far less common for the government to consider permanent layoffs.</p><p>Bobby Kogan, a former OMB official during the Biden administration, said the mass firings would be \"an action of enormous self-harm inflicted on the nation, needlessly ridding the country of talent and expertise.\" </p>\n\n<p>\"It's also extortive. 'Give us what we want in a funding fight, or we'll hurt the country,'\" Kogan said in a statement. </p><p>Senate Minority Leader Chuck Schumer, a New York Democrat, called the memo \"an attempt at intimidation.\"</p><p>\"Donald Trump has been firing federal workers since day one — not to govern, but to scare. This is nothing new and has nothing to do with funding the government,\" he wrote, predicting that any laid-off workers will be hired back.</p><p>House Minority Leader Hakeem Jeffries, also a New York Democrat, wrote on X: \"We will not be intimidated by your threat to engage in mass firings. Get lost.\"</p><p>The current fiscal year ends on Tuesday, Sept. 30, meaning the government will enter a shutdown Wednesday if Congress doesn't pass a new funding package.</p><p>A Republican short-term funding bill that <span class=\"link\">passed the House</span> has failed to reach the 60 votes needed to advance in the Senate. With a 53-seat Senate majority, Republicans need to earn the support of at least seven Democrats to resolve the funding dispute. Meanwhile, Democrats are <span class=\"link\">asking for several concessions</span>, including a rollback of this year's Medicaid cuts and an extension to health insurance tax credits, in exchange for their votes.</p><p>On Tuesday, President Trump canceled a meeting with Democratic congressional leaders to negotiate on a short-term funding patch, saying that their demands were \"unserious and ridiculous.\" </p>\n\n<p>\"I have decided that no meeting with their Congressional Leaders could possibly be productive,\" he wrote on Truth Social.</p>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "Trump says he won't let Israel annex the West Bank",
      "link": "https://www.cbsnews.com/news/trump-says-he-wont-let-israel-annex-the-west-bank/",
      "source": "CBS News",
      "pub_time": "2025-09-25T18:22:00-04:00",
      "description": "President Trump said Thursday he will not let Israel annex the West Bank, an idea that has circulated among some hardliners in Benjamin Netanyahu's government.",
      "image_url": "",
      "content": "<html><body><div><section class=\"content__body\">\n<p>President Trump said Thursday he will not let Israel annex the occupied West Bank, an idea that has circulated among members of Israeli Prime Minister Benjamin Netanyahu's government.</p><p>\"I will not allow Israel to annex the West Bank,\" the president told reporters during an Oval Office event. \"There's been enough. It's time to stop now.\"</p><p>The president's comments come after several media outlets reported that Mr. Trump privately assured the leaders of Arab and majority-Muslim states this week that he would push back against any Israeli effort to annex the occupied territory.</p><p>In recent days, several Western countries — including <span class=\"link\">France</span>, the United Kingdom and Canada — have moved to recognize a Palestinian state, leading Netanyahu to pledge some kind of response. Some hardline members of Netanyahu's governing coalition have pressed the Israeli government to react by annexing much of the West Bank, though it's unclear whether Netanyahu will seek to take that step.</p><p>Netanyahu did not immediately publicly respond to Mr. Trump's comments.</p>\n\n<p>The West Bank — which Israel has occupied since 1967 — is home to millions of Palestinians and hundreds of thousands of Israeli settlers. Since the 1990s, the territory has been split up between areas where the Palestinian Authority has some degree of control and areas fully governed by the Israeli military. Most proposals for an independent Palestinian state have involved Israel ceding control over the vast majority of the West Bank.</p><p>If Israel annexed some or all of the West Bank, formally entrenching its control over the territory, it could make forming a Palestinian state virtually impossible. The move could also upset U.S.-allied Arab countries, some of which have sought to improve their relations with Israel.</p><p>Netanyahu has ruled out allowing a Palestinian state to be formed, calling the growing pressure on the issue an \"absurd prize for terrorism\" last weekend.</p><p>Netanyahu's government has faced increasing international pressure over its handling of the Israel-Hamas war, which has destroyed much of the Gaza Strip's infrastructure and killed more than 60,000 people, according to the Hamas-run Gaza Health Ministry, which does not specify how many of the dead were militants or civilians. The war began when Hamas-led militants attacked southern Israel on Oct. 7, 2023, killing some 1,200 people and taking 251 hostages.</p>\n\n<p>Mr. Trump has pressed Israel and Hamas to strike a ceasefire deal that could result in the remaining Israeli hostages being freed, but an agreement has remained elusive.</p>\n<aside class=\"component list recirculation component--type-recirculation component--type-recirculation-collection\">\n<div class=\"component__heading-wrapper\">\n<h3 class=\"component__title\">Crisis in the Middle East\n                          \n                More\n                <svg aria-hidden=\"true\" class=\"icon__caret-right\" viewbox=\"0 0 32 32\">\n\n</svg>\n\n</h3>\n</div>\n</aside>\n\n</section>\n</div></body></html>"
    },
    {
      "title": "New renderings show more details of White House ballroom under construction",
      "link": "https://www.cbsnews.com/news/donald-trump-white-house-ballroom-renderings-construction-details/",
      "source": "CBS News",
      "pub_time": "2025-09-25T16:03:00-04:00",
      "description": "The Trump administration announced in July that a 90,000-square-foot ballroom with a seated capacity for 650 people will be constructed in the White House's East Wing.",
      "image_url": "",
      "content": "<html><body><div><article class=\"content content-article lazyload\" data-index=\"0\" data-path=\"/news/donald-trump-white-house-ballroom-renderings-construction-details/\" id=\"article-0\">\n\n\n\n<section class=\"content__body\">\n<p><em>Washington — </em>New architectural renderings obtained by CBS News reveal in more detail the White House ballroom that is currently under construction.</p><p>The Trump administration <span class=\"link\">announced</span> in July that a 90,000-square-foot ballroom with a seated capacity for 650 people will be constructed in the White House's East Wing. White House press secretary Karoline Leavitt said the project would be paid for by private donors and the president himself, who has committed to disclosing donors' names.</p><p>The new ballroom will be significantly larger than the main White House building, which comprises about 55,000 square feet over the ground floor, state floor and residence. That does not include the East and West Wings.  </p><p>CBS News <span class=\"link\">reported</span> last week that corporate and individual donors have pledged nearly $200 million to cover construction costs, and fundraising is ongoing. Google, R.J. Reynolds, Booz Allen Hamilton, Lockheed Martin, Palantir and NextEra Energy have donated, sources told CBS News, and so have firms in the tech, manufacturing, banking and health industries.</p><p>Construction got underway on the South Lawn earlier this month. McCrery Architects PLLC is the architectural firm behind the project.</p>\n\n\n\n\n\n<p class=\"content__meta--contributors\">\nJennifer  Jacobs\n                  \n        contributed to this report.\n    </p>\n\n</section>\n</article>\n</div></body></html>"
    }
  ]
}