{
  "title": "Latest News",
  "link": "https://moxie.foxnews.com/google-publisher/latest.xml",
  "description": "Latest news from 1 sources",
  "items": [
    {
      "title": "MORNING GLORY: How will 'the news' cover Charlie Kirk's service?",
      "link": "https://www.foxnews.com/opinion/morning-glory-how-the-news-cover-charlie-kirks-service",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-23T05:00:39-04:00",
      "description": "The Christian memorial service for Charlie Kirk featured testimonies from Trump, Vance, and other officials, with potential long-term impact on millions of viewers worldwide.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>\"How do we cover that?\"</p><p>That had to have been the topic on the table at the Monday morning meeting of news network executives, producers and hosts, and probably will be today and for at least a week to come.  </p><p>I hope the producers and hosts have the courage to call it what it was: the most watched Christian service of witness and forgiveness, mourning and testimony as has ever been watched and listened to in history. </p><p>Look past the more than 100,000 people who attended in person and began to line up outside of Phoenix’s State Farm Stadium before dawn, a stadium which filled to the acceptable capacity of 70,000 and left tens of thousands in an adjacent arena or watching on their cellphones. </p><p>I haven’t seen any estimates of U.S. audience or online views, much less the international reach or the audience for clips during the days of echoing that will follow in the virtual world. The numbers will be enormous if there is even any way of compiling them. </p><p>That Sunday would be a unique day of mourning was already widely understood by the end of last week. President Donald Trump, Vice President JD Vance, Secretary of State Marco Rubio and Secretary of War Pete Hegseth would be the biggest names among the eulogists, along with the heartfelt tributes of Charlie’s friends and colleagues, teachers (Dr. Larry Arnn, president of Hillsdale College) and older mentors, (Dr. Ben Carson, elder statesman of the politically active evangelical conservative community) and of course, his colleagues at Turning Point USA plus an extraordinary musical backdrop from the world of Christian ministry and superb production values from a tested TPUSA team used to big events. </p><p>But what how will the media describe it?</p><p>Having dipped in and out of covering faith in America since 1990, with a couple of books and documentaries on the subject and a PBS series in 1996, \"Searching for God in America,\" I’m well aware that America’s newsrooms are not overflowing with journalists accustomed to the language of evangelical Christianity of any kind. </p><p>I’m multilingual when it comes to Christianity, describing myself for decades as an evangelical Roman Catholic Presbyterian, as I am a faithful member of Pope Leo XIV’s legions and an ordained elder in the Presbyterian Church, (U.S.A.) — one river, two banks and I’m welcomed on both. I’m just a \"mere Christian\" as C.S. Lewis put it. Not a theologian, but a lawyer-journalist who has covered world religions and made an effort to keep up with doctrinal arguments within my own, arguments which have consumed most of the past few decades. </p><p>More than 60% of Americans identify as Christians, according to Pew Research Center’s 2023-2024 survey. The world is currently home to more than 2.5 billion Christians. Whatever one makes of the faith, it is the primary shaping force of Western civilization. Whatever one makes of Christianity’s truth claims, Charlie and the vast majority of those who watched Sunday believe them, as I do. </p><p>But, much of post-modern media lacks basic fluency in the language used by many of the speakers Sunday. The vice president and secretaries of State and War made explicit testimonies to their belief in the objective truth of the life, death and resurrection of Jesus Christ. </p><p>Trump underscored Charlie’s role as an evangelist. </p><p>Erika Kirk made a heart-breaking and deeply moving public forgiveness of her husband’s assassin —perhaps the hardest of all Christian commandments which Jesus laid down in his famous Sermon on the Mount: \"I tell you, love your enemies and pray for those who persecute you, that you may be children of your Father in heaven.\" </p><p>At that moment, Erika Kirk was modeling the words of the first Christian martyr, St. Stephen, as he prayed for his persecutors, even as Jesus did for the Romans crucifying him in Jerusalem 2000 years ago. </p><p>So what is the impact going to be of Charlie’s murder and of his evangelical witness amplified by Sunday and a hundred or a thousand other commentaries like this one?</p><p>I don’t know and it would be foolish to guess. Here is an example of why. </p><p>The Christian view is a large one and its timelines are not \"news cycles.\" This year, for example, I had occasion to worship in an old Baptist church in Maine that had commissioned George Dana Boardman —\"Apostle to the Karens\" (yes, an actual ethic group in Myanmar) in 1825. </p><p>Boardman and his wife took ship to Calcutta 200 years ago, then on to what was then deemed Burma, learned the language for two years and spent three to four years evangelizing the people before George died of tuberculosis. An unremarkable life of a forgotten Christian missionary? Hardly. </p><p>There are hundreds, if not thousands, of \"Karen congregations\" around the world because of a missionary’s efforts 200 years ago. The Karen Baptist Convention (KBC) is a major denomination in Myanmar and a reliable source for figures there. More than a decade ago, the KBC included 1,829 churches with a membership of over 287,000 in Myanmar with hundreds more congregations in Thailand. There are hundreds of such churches in the US alone. George Boardman’s mission was unnoticed by most at the time. I doubt even many American Baptist Church folk know of him today. Religious \"coaching trees\" are very difficult to trace. But they are everywhere. </p><p>Point being: Nobody has any idea what Charlie’s life and his memorial service will mean in the hearts and minds of millions who watched it and how their lives will change as a result and thus change the lives of others. </p><p>But reporting on the size of the outreach is a start and asking authorities on faith for their assessment is so much more interesting and compelling than trying to smash the story into a \"political\" or \"cultural box.\" </p><p>The \"world-wide religious impact\" box of stories doesn’t get taken off the shelf very often — deaths of popes and conclaves are one of the few occasions that come to mind — but, the uniqueness of the Christian celebration of the life of Charlie Kirk ought to draw the attention of serious people. </p><p>There are hundreds of experts on whom networks and news platforms of all sorts can rely who are close at hand: Dr. Albert Mohler, Bishop Robert Barron, former Senator Ben Sasse and perhaps even Pope Leo XIV could be approached for assessment and comment.  </p><p>What I expect is that most news organizations will flee the scene or force it into a political moment because Charlie was assassinated for overtly political causes in a time of increasing political violence. </p><p>But the \"story\" is one that Christians routinely refer to as \"the greatest story ever told\" and one which we believe to be objectively true. Bravo to the outlets with the courage to grapple with the most consequential part of Charlie Kirk’s life: His impact on the infinite timeline of millions of human souls. </p><p><i>Hugh Hewitt is host of \"The Hugh Hewitt Show,\" heard weekday mornings 6am to 9am ET on the Salem Radio Network, and simulcast on Salem News Channel. Hugh wakes up America on over 400 affiliates nationwide, and on all the streaming platforms where SNC can be seen. He is a frequent guest on the Fox News Channel’s news roundtable hosted by Bret Baier weekdays at 6pm ET. A son of Ohio and a graduate of Harvard College and the University of Michigan Law School, Hewitt has been a Professor of Law at Chapman University’s Fowler School of Law since 1996 where he teaches Constitutional Law. Hewitt launched his eponymous radio show from Los Angeles in 1990.  Hewitt has frequently appeared on every major national news television network, hosted television shows for PBS and MSNBC, written for every major American paper, has authored a dozen books and moderated a score of Republican candidate debates, most recently the November 2023 Republican presidential debate in Miami and four Republican presidential debates in the 2015-16 cycle. Hewitt focuses his radio show and his column on the Constitution, national security, American politics and the Cleveland Browns and Guardians. Hewitt has interviewed tens of thousands of guests from Democrats Hillary Clinton and John Kerry to Republican Presidents George W. Bush and Donald Trump over his 40 years in broadcast, and this column previews the lead story that will drive his radio/ TV show today.</i></p></body></div></body></html>"
    },
    {
      "title": "CNN reporter says liberals should 'actively acknowledge' their role in cancel culture",
      "link": "https://www.foxnews.com/media/cnn-reporter-says-liberals-should-actively-acknowledge-role-cancel-culture",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-23T05:00:21-04:00",
      "description": "CNN host Abby Phillip said on Saturday that liberals need to recognize the role they played in pushing cancel culture years prior to Jimmy Kimmel’s suspension.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>CNN’s Abby Phillip said Saturday that liberals need to \"actively acknowledge\" their role in pushing cancel culture and censorship if they want the nation to move forward.</p><p>The \"Table for Five\" host and her panel discussed ABC’s suspension of late-night host Jimmy Kimmel after he made controversial comments regarding Turning Point USA founder Charlie Kirk’s alleged assassin, which triggered backlash from the Federal Communications Commission (FCC) and two major broadcast affiliate owners. </p><p>Though Phillip criticized Republicans for celebrating despite their push for free speech, she agreed with another panelist who argued liberals have been, by contrast, \"too censorious\" in the past. </p><p>\"I think that’s something more liberals should say,\" Phillip said. \"I think it would help. They should acknowledge, not just in passing, but actively acknowledge where things went wrong. That’s the only way to move forward, I think, in a way.\"</p><p>When asked what liberals should admit, Phillip said they must recognize that cancel culture was an issue before Kimmel’s suspension.</p><p>\"It was actually a thing, and it’s not just enough to say, well, my cancel culture was fine, but yours is wrong,\" Phillip said. \"There has to be an acknowledgment that, yeah, now I think everybody understands what free speech really looks like and what it means, and then you have to apply that thinking to what was happening four, five, six years ago in this country and say something about it.\"</p><p>CNN political commentator and former Biden official Ashley Allison disagreed with Phillip, saying that, unlike Republicans, a Democratic president did not attempt to \"cancel\" somebody.</p><p>\"Joe Biden wasn’t canceling somebody, Kamala Harris wasn’t canceling. It might’ve been individual citizens, and individual citizens actually have the ability to say, ‘I don’t like it’ and let their dollars, let their viewership, let their subscriptions [decide],\" Allison said.</p><p>Liberals and media commentators have attacked ABC and parent company Disney’s decision to suspend Kimmel’s show, claiming that they had capitulated to the Trump administration and its FCC to silence a Trump critic.</p><p>Though some conservative commentators celebrated Kimmel’s suspension, others expressed caution about potential government overreach.</p></body></div></body></html>"
    },
    {
      "title": "SEAN DUFFY: Trump's crime crackdown is giving Democratic leaders a blueprint to follow",
      "link": "https://www.foxnews.com/opinion/sean-duffy-trumps-crime-crackdown-giving-democratic-leaders-blueprint-follow",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-23T05:00:15-04:00",
      "description": "Sean Duffy highlight&apos;s Trump&apos;s Washington D.C. law enforcement surge success as model for addressing urban violence and increasing safety nationwide.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>The deadly stabbing of 23-year-old Iryna Zarutska on Charlotte’s light rail last month demonstrates everything President Donald Trump has warned about violent crime.</p><p>The 34-year-old suspect, Decarlos Brown Jr., had previously been arrested an astonishing 14 times. This career criminal, however, had been free to roam the streets thanks to Democrats controlling law enforcement in Charlotte at every level. Victims like Zarutska are sacrificed when crime goes unpunished. </p><p>As President Donald Trump’s transportation secretary, I've seen firsthand how leadership can transform chaos into order. From building an all-new air traffic control system to cleaning up D.C.’s Union Station, we've proven American decline isn’t inevitable; it’s a choice. Nowhere is this clearer than in the fight against crime. So I formally launched an investigation into the Charlotte transportation authorities’ safety and security plans. But we’re not just looking at North Carolina.</p><p>Anarchy has infected transit networks everywhere. Americans see it every day. But Trump’s decisive actions in Washington, D.C., demonstrate how, with the right policies, we can reclaim our cities from the grip of disorder. We will not sit by and wait for the next Iryna. That’s why today, I’ve also reminded leaders in Boston and Chicago that federal dollars come with strings attached. If local leaders want federal funding, they will meet federal safety standards. The status quo is unacceptable. America’s patience has run out.</p><p>Just last month, the president declared an emergency in our nation's capital, surging federal law enforcement officers to restore public safety. It was a direct response to skyrocketing crime rates that turned D.C. into a symbol of urban failure under years of Democratic mismanagement. By tapping agencies like the FBI, DEA and U.S. Marshals, and even deploying the National Guard, Trump showed crime isn't unstoppable — it's a policy failure to be reversed.</p><p>The results speak for themselves: within weeks, violent crime dropped, encampments cleared and even D.C.'s Democrat Mayor Muriel Bowser admitted the federal presence has helped. Trump's approach underscores a fundamental truth: crime and urban decay are choices. Leftist policies which prioritize criminals over victims — defunding police, lax prosecution and tolerance for open-air drug markets — have turned once-vibrant cities into war zones.</p><p>Homelessness, too, isn't just a social ill; it's exacerbated by the same permissive attitudes that allow tents to block sidewalks and public parks to become havens for addiction and disorder. Trump's surge in Washington proves cracking down on debauchery and prioritizing public order can turn the tide.</p><p>Even some Democrats are starting to realize this reality. Take Maryland Gov. Wes Moore, whose state has been plagued by Baltimore crime. For weeks, Moore sparred with the president over offers to send in the National Guard, calling the president's rhetoric \"performative\" while waving off federal help. Yet, just days ago, Moore did an about-face, ordering additional state police into Baltimore to fight local crime. He welcomed support from agencies like the FBI but drew the line at the Guard — perhaps to save face politically. Baltimore is a prime example of how blue-city policies have failed: high homicide rates, rampant drug use and homelessness that spills into streets, driving businesses and families away. Moore's move, while belated, implicitly concedes Trump's point: on-the-ground reinforcements work. If a leftist like Moore can admit the truth, why can't others?</p><p>It's time for accountability. Trump's surge in D.C. isn't just a win for the capital; it's a blueprint for the nation. Governors like Moore are quietly adopting it because the American people have been force-fed blue pills long enough. Minorities are not falling for the routine lie that crime cannot be lowered, while Republicans who are trying to fix the problem are unrepentant racists. There’s a reason Trump nearly doubled his support among Black voters last fall and increased the Hispanic share by a third since 2020. They are waking up and liberal politicians had better wake up soon. Blue-state leaders must choose: continue enabling chaos, or follow Trump's lead and make safety a priority. Our cities deserve better than excuses. They deserve action.</p><p>As we rebuild America's infrastructure under this administration, let's remember that safe streets are the foundation of prosperity. Crime is a blue pill choice — and it's one we can reject.</p></body></div></body></html>"
    },
    {
      "title": "Kamala Harris breaks silence on Biden dropout, admits she has regrets about her handling of situation",
      "link": "https://www.foxnews.com/media/kamala-harris-breaks-silence-biden-dropout-admits-she-has-regrets-about-her-handling-situation",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-23T03:00:51-04:00",
      "description": "Harris discusses her new book with Rachel Maddow, describing the unprecedented scenario of Biden&apos;s late withdrawal from the 2024 presidential race.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>Former Vice President Kamala Harris broke her silence on the chaos following former President Joe Biden’s decision to drop out of the 2024 race just three and a half months before Election Day.</p><p>Harris previewed her upcoming book \"107 Days\" with MSNBC’s Rachel Maddow Monday night describing Biden’s move as \"recklessness\" and admits she has regrets about not pushing him harder to reconsider.</p><p>\"So when I write this, it’s because I realize that I have and had a certain responsibility that I should have followed through on,\" Harris told Maddow. \"So when I talk about the recklessness, as much as anything, I’m talking about myself. There was so much at stake, and at the time I worried it would come off as being completely self-serving.\"</p><p>The comments marked the first time Harris has publicly admitted doubts about how she handled the political earthquake.</p><p>Harris says the decision left her with just over 100 days to strategize and face off against President Donald Trump.  She says the scenario was \"unprecedented.\"</p><p>Her last-minute entry left Democrats scrambling while Trump had been building his war chest for months and hammering down his opponent on the campaign trail.</p><p>She recalled how \"people who seemingly had nothing in common came together by the thousands with an A-level of optimism and, dare I say, joy about the possibilities for America.\"</p><p>Critics among her own political party questioned whether she could unite Democrats and win over independents with so little time left.</p></body></div></body></html>"
    },
    {
      "title": "Why ABC brings back Jimmy Kimmel today after its debacle over free speech",
      "link": "https://www.foxnews.com/opinion/why-abc-brings-back-jimmy-kimmel-today-after-its-debacle-over-free-speech",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-23T03:00:45-04:00",
      "description": "Amid free speech controversy, celebrity backlash, PR turmoil, and claims of government pressure, Disney and ABC were forced to end Jimmy Kimmel’s suspension.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>In the end, Disney and ABC had absolutely no choice but to rehire Jimmy Kimmel.</p><p>The reason the late-night host is returning to the air tonight is that this whole thing has been an utter PR debacle for ABC, and more personally for Disney chief Bob Iger, who even got whacked by his predecessor as CEO, Michael Eisner, accusing him of bowing to \"out-of-control intimidation.\"</p><p>I don’t think I’m going out on a limb in saying that Iger’s reputation is shattered forever.</p><p>The company became the poster child as a high-profile opponent of free speech — a deadly label for a news organization like ABC.</p><p>So the \"indefinite\" suspension is over.</p><p>I could sniff that things were moving in this direction when I learned the two sides were talking. And when Disney asked Kimmel for a second meeting the other day, I knew the only question was which day he’d be back.</p><p>Let’s revisit the dumb and inaccurate comment that got Kimmel in trouble. And remember, like Stephen Colbert, he is so vociferously anti-Trump that he surrendered half his audience:</p><p>\"We hit some new lows over the weekend with the MAGA gang desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them.\"  </p><p>First, it was beyond tone-deaf, with feelings rubbed so raw over Charlie Kirk’s assassination. And the killer is not \"MAGA,\" just another crazed lunatic who said he was acting out of \"hatred\" for Kirk, but also sympathetic to gays and transgender people like his roommate and romantic partner.</p><p>At the same time, there was pressure from the FCC, with Chairman Brendan Carr blundering by saying he would act on Kimmel if ABC didn’t. Even Carr’s allies, like Ted Cruz, said he sounded like a mob boss by declaring \"we can do it the easy way or the hard way.\"Nice little network you got here – be a shame if anything happened to it. Carr walked it back the next day.</p><p>What Kimmel said wasn’t the worst thing ever uttered on the air, and maybe in a month it would have passed unnoticed. But not so soon after the targeted assassination.</p><p>With that kind of blatant government pressure, ABC caved and took Kimmel off the air as he was about to tape last Wednesday’s show – and was said to be preparing an even tougher monologue about the Kirk killer. Again, he failed to read the electronic room.</p><p>It was downhill from there.</p><p>For anyone who believes in free speech – and that includes some Democrats who don’t agree with Kirk on just about anything–Disney and ABC were now the enemy.</p><p>Howard Stern, Kimmel’s closest friend – their families vacation together – said yesterday he had canceled his Disney+ subscription, as did Robin Quivers. After conferring with Kimmel, he said on his first live show since the suspension:</p><p>\"When the government says, 'I'm not pleased with you, so we're going to orchestrate a way to silence you,' it's the wrong direction for our country. It isn't good.\"</p><p>Stern called the suspension \"horrible\" and \"outrageous\" for such a \"big talent… You can't support this kind of a move. I don't care whether you like Jimmy or not. It's about freedom of speech. If ABC wanted to fire Jimmy because they didn't like him, or he had low ratings — they didn't want to fire him. They're being pressured by the United States government. We can't have that, not if we're going to have a democracy.\"</p><p>Howard has an awful lot of followers on Sirius XM that would take their cue from him. </p><p>Some 400 celebrities signed an ACLU letter calling this \"a dark moment for freedom of speech in our nation.\" These include Jennifer Aniston, Jason Bateman, Robert De Niro, Jane Fonda, Selena Gomez, Tom Hanks, Olivia Rodrigo, Ben Stiller, Jamie Lee Curtis, Julia Louis-Dreyfus, Maggie Gyllenhaal, Michael Keaton, Regina King, Diego Luna, Lin-Manuel Miranda, Natalie Portman, Maya Rudolph, Martin Short and Kerry Washington.</p><p>This is the kind of thing that Hollywood really cares about, the bold-faced names.</p><p>Kimmel is said to be concerned about the jobs of dozens of producers, staff members and contractors who would lose their livelihoods if the show was deep-sixed.</p><p>Disney made a point of saying in its statement that Kimmel was suspended because \"we felt some of the comments were ill-timed and thus insensitive.\" But \"thoughtful\" conversations led to Jimmy’s return.</p><p>Whether you like Kimmel or not, no company can withstand that kind of pressure, even if it goes against the wishes of Donald Trump, who celebrated the suspension.</p><p>Now here’s the challenge Kimmel and Disney/ABC faced.</p><p>The suits had already been urging Kimmel to tone down the attacks against Trump. But Kimmel, who has hosted the program since 2003, and parlayed that into Oscars-hosting gigs, has always insisted on his independence. He’s arguably the most famous face at the network.</p><p>I played a small role in this last year by asking Trump about Kimmel after the Oscars, and the candidate slammed him, escalating their feud. Jimmy even took a swipe at me (horrors).</p><p>So perhaps with a wink and a nod, Kimmel has now agreed to tone things down a tad and the brass has agreed to let him basically say what’s on his mind.</p><p>Jimmy Kimmel is the only clear winner in this.</p><p>Everyone else – Disney, Bob Iger, Brendan Carr, ABC – is unmistakably a loser and will forever be branded, fairly or otherwise, as cowardly opponents of free speech.</p><p>And hey, ratings for tonight’s show should be through the roof. </p></body></div></body></html>"
    },
    {
      "title": "Harris calls Trump a ‘tyrant,’ lambasts ‘feckless’ CEOs for capitulation",
      "link": "https://www.foxnews.com/media/harris-calls-trump-tyrant-lambasts-feckless-ceos-capitulation",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-23T01:00:30-04:00",
      "description": "In an MSNBC interview, Kamala Harris slams business leaders as &apos;feckless&apos; for failing to speak out against Trump&apos;s authoritarian tendencies after her 2024 loss.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>Former Vice President Kamala Harris sat down with MSNBC’s Rachel Maddow Monday for her first interview since her loss to Donald Trump in the 2024 presidential election. </p><p>Harris, 60, didn’t hold back, calling her Republican opponent a \"tyrant\" and lambasted American CEOs for, what she deemed, capitulation to Trump. </p><p>\"I worked closely with the private sector over many years, and I always believed that if push came to shove, those titans of industry would be guardrails for our democracy, for the importance of sustaining democratic institutions,\" Harris said. \"And one by one by one, they have been silent. They have been, you know, yes, I use the word feckless.\" </p><p>Harris ridiculed the idea that the billionaire class would lose their yacht or their house in the Hamptons if they spoke out against Trump. She argued that capitalism thrives better under democracy than under authoritarian regimes. </p><p>\"Democracy sustains capitalism. Capitalism thrives in a democracy. And right now, we are dealing with – as I called him at my speech on the ellipse – a tyrant. We used to compare the strength of our democracy to communist dictators. That's what we're dealing with right now under Donald Trump. And these titans of industry are not speaking up,\" she said. </p><p>Harris said she understood their hesitancy to speak out against the president, noting that his administration has gone after his critics. </p><p>\"But at some point, they’ve got to stand up for the sake of the people who rely on all of these institutions to have integrity and to at some point be the guardrails against a tyrant who is using the federal government to execute his whim and fancy because of a fragile ego,\" Harris said. </p><p>Monday night’s interview on MSNBC came a day before the release of her new book, \"107 Days,\" which will recount her tumultuous experience replacing former President Joe Biden as the 2024 Democratic presidential nominee after he dropped out of the race. </p></body></div></body></html>"
    },
    {
      "title": "Lions sack Lamar Jackson 7 times while rushing for 225 yards in win over Ravens",
      "link": "https://www.foxnews.com/sports/lions-sack-lamar-jackson-7-times-while-rushing-225-yards-win-over-ravens",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-22T23:24:50-04:00",
      "description": "The Detroit Lions defeated the Baltimore Ravens, 38-30, improving to 2-1 as both explosive offenses delivered the expected shootout at M&amp;T Bank Stadium.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>The Detroit Lions went into Baltimore on Monday night and came away with a high-scoring victory, 38-30, over the Ravens. </p><p>The Lions moved to 2-1, while the Ravens are now 1-2 after faltering late in this game. </p><p>Being that these are two of the most explosive offenses in the NFL to start the new year, it was expected to be a shootout at M&amp;T Bank Stadium, and that’s exactly what football fans got from the Ravens and Lions. </p><p>It was Detroit getting on the board first with its opening drive, going 11 plays and 67 yards with Jahmyr Gibbs finding the end zone for the first time on the night with a one-yard run. But the Ravens’ opening-drive script was even better thanks to their Pro Bowl running back. </p><p>Derrick Henry, who had just 23 yards rushing in the win over the Cleveland Browns last week, broke that mark with a 28-yard touchdown run to even the score after the extra point. </p><p>After punts by both teams on their next drives, the Lions found themselves on their own two-yard line late in the first quarter. Baltimore was hoping to make it a quick punt given the circumstances, but Detroit was simply better at the line of scrimmage as they stayed true to the run game and managed to go 98 yards in 18 plays for a touchdown. </p><p>It was David Montgomery, Gibbs’ counterpart in the backfield, punching it in to cap a drive that took just under 11 minutes of first-half clock off the board to make it 14-7. </p><p>It appeared momentum would totally be on the Lions’ sideline, especially after being able to stop the Ravens near the goal line on four tries to get a turnover on downs. However, Lamar Jackson and company were able to tie things at 14 apiece with 24 seconds left in the second quarter after Rashod Bateman was found wide open in the front of the end zone. </p><p>As the second half began, Baltimore got right to work, going 11 plays and 73 yards where Jackson threw a seed to tight end Mark Andrews for the touchdown lead. But just like in the first half, Detroit had the answer with a touchdown of their own, as Goff placed the ball perfectly to Amon-Ra St. Brown, who was streaking down the right sideline into the end zone. </p><p>At 21 apiece entering the fourth quarter, and both offenses clearly clicking, this game felt like it was going to come down to the wire. The Lions got their lead back after a gadget play on fourth-and-1 from the Baltimore four-yard line, as St. Brown flipped it back to Gibbs for the score. </p><p>The Ravens were able to get a field goal and a timely punt, as they had 8:31 left in the fourth quarter and a four-point deficit to overcome. But Henry fumbled on the first play, as Aidan Hutchinson punched the ball out from behind. </p><p>Luckily, a facemask penalty by a Lions offensive lineman stalled a potential game-sealing drive, with Detroit forced to have Jake Bates nail a field goal to get their seven-point lead back. </p><p>Jackson and the Ravens needed another answering score, but the Lions’ defense was relentless and forced a three-and-out as the defensive front just kept getting Jackson down to the turf – something we’re certainly not used to seeing. </p><p>The Lions were able to sack Jackson seven times, with Al-Quadin Muhammad getting 2.5, while Hutchinson, Derrick Barnes, Trevor Nowaske and Jack Campbell each tallied one. </p><p>Detroit had the opportunity to seal their victory after forcing the punt, and they didn’t just get necessary first downs. Montgomery, who led the game with 151 yards rushing on 12 carries went 31 yards to the house to make it a 38-24 game. </p><p>The Lions also went for it on fourth down the play prior to the score, with Goff placing another great pass for St. Brown to not only keep the drive going, but not give Jackson the ball at midfield. Goff finished the game 20-of-28 for 202 yards with St. Brown leading the Lions with 77 yards on seven catches. </p><p>Detroit also had 225 rushing yards, with Gibbs going for 67 on 22 carries while also catching five passes for 32 yards. </p><p>For the Ravens, they had a touchdown drive with just seconds left on the clock, but it was too little too late in the end. </p><p>Jackson finished 21-of-27 for 288 yards with three touchdown passes, two of which going to Andrews who led the game with 91 receiving yards on six catches. Henry was held to just 50 yards on 12 carries as well. </p><p><i>Follow Fox News Digital’s </i><i>, and subscribe to </i><i>.</i></p></body></div></body></html>"
    },
    {
      "title": "Harris offers timid endorsement of Mamdani, quickly pivots to other 'star' Democrats",
      "link": "https://www.foxnews.com/media/harris-offers-timid-endorsement-mamdani-quickly-pivots-other-star-democrats",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-22T22:46:40-04:00",
      "description": "Former Vice President Kamala Harris gave her first broadcast interview since the presidential election on MSNBC’s “The Rachel Maddow Show&quot; Monday night.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>Former Vice President Kamala Harris offered a lukewarm endorsement for New York City mayoral candidate Zohran Mamdani in a Monday interview.</p><p>Harris sat down with MSNBC’s Rachel Maddow for an interview where they discussed her new book \"107 Days,\" which will release on Tuesday. Maddow highlighted a portion of Harris’ book that discussed the former VP’s \"stars project,\" where she met with and identified rising stars in the Democratic Party.</p><p>Maddow asked Harris for her opinion on the socialist candidate as a rising star and whether she supported him.</p><p>\"Look, as far as I’m concerned, he’s the Democratic nominee, and he should be supported,\" Harris began.</p><p>\"Do you endorse his candidacy?\" Maddow pressed.</p><p>\"I support the Democrat in the race, sure,\" Harris said. </p><p>Harris quickly followed by saying that Mamdani was not the only \"star\" in the Democratic Party and hoped people would pay attention to other races throughout the country.</p><p>\"But I mean, there are people like Barbara Drummond in Mobile, Alabama, Helena Moreno in New Orleans. They’re all running for mayor, too, and they are stars. So, I hope that we don’t so over index on New York City that we lose sight of the stars throughout our country who are right now running for mayor and many other offices, governor and so on. So that’s where I am. We got a big tent, and we got a lot of stars,\" Harris said.</p><p>Despite being the Democratic candidate for New York City mayor, Mamdani has yet to receive endorsements from major party leaders such as House Minority Leader Hakeem Jeffries and Senate Minority Leader Chuck Schumer, both of whom also represent New York.</p><p>New York Gov. Kathy Hochul endorsed Mamdani on Sept. 14 after three months.</p><p>\"New York City deserves a mayor who will stand up to Donald Trump and make life more affordable for New Yorkers. That’s @ZohranKMamdani,\" Hochul wrote on social media.</p><p>Mamdani has faced criticism from more moderate Democrats for his progressive proposals, such as city-owned grocery stores and his refusal to condemn the anti-Israel slogan \"globalize the intifada.\"</p></body></div></body></html>"
    },
    {
      "title": "Wild video shows cars spinning at illegal takeovers in Maryland as police announce hit-and-run arrest",
      "link": "https://www.foxnews.com/us/wild-video-shows-cars-spinning-illegal-takeovers-maryland-police-announce-hit-and-run-arrest",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-22T21:59:07-04:00",
      "description": "Naef Salmo faces multiple charges after allegedly hitting a woman during a car takeover in Maryland, then fleeing and spray-painting his vehicle.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>Wild video released by the Prince George’s County Police Department shows what officers describe as \"illegal car takeovers\" that have been causing chaos in Maryland.</p><p>The aerial footage captures dozens of people standing within feet of cars spinning wildly at high speeds in places like shopping center parking lots.</p><p>The video landed amid an ongoing political battle over crime in Maryland.</p><p>Gov. Wes Moore has invited President Donald Trump to take part in a \"safety walk\" in Baltimore to highlight crime-reduction efforts.</p><p>Trump, meanwhile, has criticized Moore, accusing him of failing in public safety and posted on Truth Social in August that he would send in the troops.</p><p>\"After only one week, there is NO CRIME AND NO MURDER IN DC! When it is like that in Baltimore, I will proudly ‘walk the streets’ with the failing, because of Crime, Governor of Maryland. P.S. Baltimore is ranked the 4th WORST CITY IN THE NATION IN CRIME &amp; MURDER,\" the president wrote.</p><p>The release of the footage also came as local police charged 18-year-old Naef Salmo of Millersville in connection with a crash that seriously injured a woman during one of these types of car takeovers.</p><p>Authorities said the incident happened around 1:45 a.m. on Sept. 14 at a shopping center on the 8500 block of Landover Road.</p><p>Investigators allege Salmo was spinning his car in circles when he struck a spectator. Instead of stopping, police say, he fled the scene, leaving the victim behind.</p><p>She was hospitalized with serious injuries but has since been released. Detectives later identified Salmo and located the vehicle.</p><p>According to police, he attempted to cover his tracks by spray-painting the car a different color. When officers searched the vehicle, they discovered a handgun hidden under the hood.</p><p>Police say Salmo admitted responsibility for the hit-and-run during questioning.</p><p>Salmo now faces a slate of charges, including second-degree assault, reckless endangerment, disorderly conduct, riot, and obstructing and hindering a police officer. Additional charges may still be filed as the investigation continues.</p><p>\"We know these illegal vehicle takeovers may seem harmless to some, but the fact is, they can be dangerous,\" Prince George’s County Police Chief George Nader said in a statement.</p><p>\"In this case, a young woman suffered serious injuries. We’ve also investigated a fatal shooting at a car takeover in recent years,\" he added.</p><p>Fox News Digital reached out to Prince George's County Police for further comment.</p></body></div></body></html>"
    },
    {
      "title": "Baseball Broadcaster Raising Prostate Cancer Awareness",
      "link": "https://www.foxnews.com/sports/baseball-broadcaster-raising-prostate-cancer-awareness",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-22T21:45:45-04:00",
      "description": "",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>The American Cancer Society estimates in 2025, more than 300,000 men will be diagnosed with prostate cancer and more than 35,000 will die from the disease.</p><p>Longtime baseball broadcaster Ed Randall is a prostate cancer survivor.</p><p>\"I was 47 years old when I went to the doctor for my routine annual physical.  At least I thought it was going to be routine.  And I felt fine that day.  And, to my surprise, I was told that I had prostate cancer,\" Randall says.</p><p>Ed realized other men may be in the same situation he was in.</p><p>So, in 2003, he founded the charity Fans For The Cure, which encourages men over 40 to get a PSA blood test.</p><p>\"There's a 99 percent cure rate if prostate cancer is detected early,\" Randall says.</p><p>Ed co-hosts the show \"Remember When,\" on MLB Network Radio on SiriusXM, and he takes time out of every show to let listeners know about Fans For The Cure.</p><p>\"I'm the only person I'm sure in this country.... that stops his show to tell the men in his audience to go to the doctors and get a simple blood test, because the demographic largely listening to my shows is the demographic that is most vulnerable to prostate cancer,\" Randall says.</p><p>Fans For The Cure's work includes hosting awareness nights and free screenings at stadiums and sports arenas, along with community health events, patient advocacy, physician referrals and men's and women's support groups.</p><p>Information is available at fansforthecure.org.  </p></body></div></body></html>"
    },
    {
      "title": "Colorado jury awards family $205M after 6-year-old falls to death from theme park ride",
      "link": "https://www.foxnews.com/us/colorado-jury-awards-family-205m-after-6-year-old-falls-death-from-theme-park-ride",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-22T21:13:41-04:00",
      "description": "Glenwood Caverns Adventure Park must pay $205 million after 6-year-old Wongel Estifanos fell 100 feet to her death due to improperly secured safety restraints on a ride.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>A Colorado jury has ordered a local theme park and others to pay $205 million to the family of a 6-year-old girl who fell more than 100 feet to her death from a ride.</p><p>The verdict, issued Friday at Garfield County District Court, is among the largest wrongful death awards for a single plaintiff in state history.</p><p>Wongel Estifanos, from Colorado Springs, was visiting Glenwood Caverns Adventure Park with her family over Labor Day weekend in 2021 when tragedy struck on the Haunted Mine Drop.</p><p>Investigation paperwork reviewed by Fox News Digital shows Estifanos was not buckled into her seat properly before the ride started.</p><p>Instead, she was seated on top of still-buckled restraints that had been left by a previous rider. Even though a warning alarm sounded, an operator overrode the system and started the ride, according to the documents.</p><p>The Haunted Mine Drop, which was the first drop ride of its kind to plunge riders underground, dropped passengers 110 feet into a darkened shaft. Riders used to sit together on a bench-like seat in a dim chamber. </p><p>After being secured with seat belts, the lights would go out and the attraction would simulate a ghostly presence sending them plummeting downward in total darkness. </p><p>The freefall ended with glowing lanterns illuminating the mine walls before riders were brought back to the loading platform.</p><p>Following the 2021 incident, the Haunted Mine Drop was permanently closed. </p><p>\"For four long years, Glenwood Caverns has denied fault for the death of Wongel, who was dropped ten stories to her death from a ride. Wongel’s parents took this case to trial to prove what really happened and to try to save others,\" Caplis added.</p><p>According to court documents, the family’s 2022 lawsuit alleged not only operator negligence, but also that Glenwood Caverns ignored repeated customer complaints about unsafe practices on the ride.</p><p>Investigators also concluded that multiple staff errors led to Estifanos’ death, including failing to prepare the seat belts before boarding began.</p><p>Glenwood Caverns marketing director Kimberly Marcum said in a statement that co-defendant Soaring Eagle Inc. had \"manufactured the Haunted Mine Drop with a defective restraint system that caused this heartbreaking accident.\"</p><p>Marcum also indicated the manufacturer had certified the attraction as safe despite a defective restraint system. </p><p>\"Our hearts go out to the family of Wongel Estifanos,\" Marcum said, while stating Glenwood Caverns was \"exploring all options so that we can attempt to continue to operate, serve our guests, and continue to give back to the community.\"</p><p>Prosecutors declined to pursue criminal charges against Glenwood Caverns, citing challenges in proving manslaughter, but the civil trial gave Estifanos' family its day in court.</p><p>\"They are grateful to the people of Garfield County for being so kind to them during this long trial,\" added Caplis in his statement.</p><p>Fox News Digital also contacted Soaring Eagle Inc for comment, but did not hear back.</p></body></div></body></html>"
    },
    {
      "title": "Kimmel's show overwhelmingly biased against conservatives, study finds",
      "link": "https://www.foxnews.com/media/kimmels-show-overwhelmingly-biased-against-conservatives-study-finds",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-22T21:00:34-04:00",
      "description": "A Media Research Center study found Jimmy Kimmel targeted conservatives in 92% of his political jokes while largely sparing Democrats across 369 episodes analyzed.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>A new study from Media Research Center’s NewsBusters shows that \"Jimmy Kimmel Live!\" had a strong liberal bias, with conservatives bearing the brunt of 92% of the late-night host’s political jokes while Democrats were largely spared. </p><p>An analysis of 7,797 political jokes across 369 episodes found that Republicans, Trump allies and right-leaning media outlets were overwhelmingly targeted, while liberal figures and networks were rarely mocked.</p><p>More specifically, right-leaning people were the subject of 7,189 jokes, compared to 565 about left-leaning figures and 43 that took aim at nonpartisan targets.</p><p>At the same time, the findings showed only one Democrat – former President Joe Biden – made the list of Kimmel's top ten favorite targets, with 336 instances.</p><p>President Donald Trump ranked first on Kimmel's list, with 3,584 jokes at his expense.</p><p>Other Republicans and Trump affiliates who made the list include former New York Rep. George Santos, First Lady Melania Trump, former DOGE lead Elon Musk, MAGA supporters and more.</p><p>NewsBusters also reported that 97% (61 out of 63) of Kimmel's guests since Sept. 2022 have been liberals.</p><p>The findings come after Kimmel's show was indefinitely suspended over remarks the late-night host made in the wake of Turning Point USA co-founder Charlie Kirk's assassination. </p><p>Amid pressure from the Federal Communications Commission (FCC), Disney confirmed the decision to Fox News Digital last week after the host accused conservatives of reaching \"new lows\" by trying to affiliate Kirk's alleged assassin, 22-year-old Tyler Robinson, with left-wing ideology, despite prosecutors reaffirming those ties during his indictment.</p><p>\"We hit some new lows over the weekend with the MAGA gang desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it,\" Kimmel said.</p><p>Nexstar Media Group, which owns hundreds of television stations, announced earlier it would preempt Kimmel's show on its ABC affiliates starting last Wednesday night \"for the foreseeable future\" and replace it with other programming over his comments about Robinson.</p><p>\"Mr. Kimmel’s comments about the death of Mr. Kirk are offensive and insensitive at a critical time in our national political discourse, and we do not believe they reflect the spectrum of opinions, views or values of the local communities in which we are located,\" Nexstar's broadcasting chief Andrew Alford said in a press release.  </p><p>\"Continuing to give Mr. Kimmel a broadcast platform in the communities we serve is simply not in the public interest at the current time, and we have made the difficult decision to preempt his show in an effort to let cooler heads prevail as we move toward the resumption of respectful, constructive dialogue.\" </p><p>Late-night hosts, celebrities and some lawmakers have rallied behind Kimmel after his suspension, arguing that the FCC and the Trump administration have hindered free speech rights with their influence on the matter.</p><p>Some Republicans, including Sens. Rand Paul and Ted Cruz, have been critical of the development as well, raising First Amendment concerns.</p><p>Fox News Digital reached out to Disney, ABC's parent company, for comment but did not immediately receive a response. </p><p><i>Fox News' Joseph A. Wulfsohn contributed to this report.</i></p></body></div></body></html>"
    },
    {
      "title": "Trump officials slam blue state governor for ignoring chaotic anti-ICE ‘rioters’ disrupting operation",
      "link": "https://www.foxnews.com/politics/trump-officials-slam-blue-state-governor-ignoring-chaotic-anti-ice-rioters-disrupting-operation",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-22T20:23:36-04:00",
      "description": "DHS is criticizing Illinois Gov. J.B. Pritzker for not responding to a chaotic anti-ICE riot that forced federal authorities to deploy tear gas and other non-lethal measures.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>The Department of Homeland Security is criticizing Illinois Democratic Gov. J.B. Pritzker for failing to assist in responding to a chaotic anti-ICE riot in a Chicago suburb that forced federal authorities to deploy tear gas and other non-lethal measures.</p><p>In a Monday statement, the department claimed that police \"under JB Pritzker’s sanctuary jurisdiction refused to answer multiple calls for assistance.\"</p><p>Fox News Digital reported last Friday that federal officials clashed with a group of protesters who were blocking ICE vehicles from entering and exiting a processing facility in Broadview, Illinois.</p><p>DHS labeled the protesters \"rioters\" and said that so far, federal law enforcement has arrested 16 rioters. The agency said that the \"rioters and sanctuary politicians obstructed law enforcement, threw tear gas cans, rocks, bottles, and fireworks, slashed tires of cars, blocked the entrance of the building, and trespassed on private property.\" DHS said that rioters also assaulted law enforcement officials.</p><p>Matt Hill, a spokesperson for Pritzker, responded by telling Fox News Digital that \"it's completely false to suggest the state or local municipalities have been obstructing federal officials.\" </p><p>\"The state has not received multiple calls for assistance from the federal government and would remind them of the importance of coordinating with local law enforcement to protect public safety,\" said Hill. He added, \"Governor Pritzker has been clear that violence is unacceptable and everyone needs to follow the law, which includes federal agents respecting constitutional rights to peaceful protest.\"</p><p>\"The media needs to use extreme caution before reporting what the Trump administration is saying given their record of lies, lack of transparency, and failure to coordinate with the state and local law enforcement,\" said Hill. </p><p>The DHS statement said the protest disrupted an operation targeting \"some of the worst of the worst—including criminals convicted of drug trafficking, domestic abuse, drinking and driving, and assault,\" who were being processed at the facility.</p><p>The agency highlighted some of the criminal illegals who were being processed when the protest broke out.</p><p>Among those was Andres Ventura-Uvaldo, a criminal illegal and Mexican national, who the agency said was previously arrested for felony DUI and domestic violence.</p><p>Another, Alberto Algeria Barron, also a Mexican national, was previously removed from the U.S. in 2014 and was convicted for domestic battery twice, according to DHS.</p><p>Erwin Jose Roa-Mustafa, an illegal alien from the Dominican Republic, was also being processed at the facility after pleading guilty on federal charges of conspiracy and intent to distribute a controlled substance and possession with intent to distribute fentanyl.</p><p>DHS said that ICE was also processing another alleged drug trafficker, Ibis Alberto Testa Nunez, from Mexico, who was previously arrested by the Drug Enforcement Administration for cocaine possession and possession with intent to distribute.</p><p>Two others, Salvador Alcantar-Alcantar, from Mexico, was previously arrested for DUI, trespassing and assault, and Carlos Eduardo Chavez-Cardenas, from Bolivia, was previously convicted for DUI and possession of drugs, according to DHS. </p><p>\"These heinous criminals, including domestic abusers, drug traffickers, violent offenders, and drunk drivers are some of the illegal aliens being held in the ICE Broadview Processing Center,\" said DHS Assistant Secretary Tricia McLaughlin.</p><p>\"These rioters in Illinois are fighting to keep rapists, murderers, and other violent criminals loose on Illinois streets,\" said McLaughlin. \"Instead of rioting, they should be thanking ICE officers who every single day wake up and make our communities safer.\"</p><p>This comes as DHS says that ICE officials are facing a more than 1,000 percent increase in assaults as they conduct operations across Illinois. </p></body></div></body></html>"
    },
    {
      "title": "College football assistant coach Shawn Clark dead at 50",
      "link": "https://www.foxnews.com/sports/college-football-assistant-coach-shawn-clark-dead-50",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-22T20:22:32-04:00",
      "description": "Shawn Clark, an assistant football coach at UCF and former head coach at Appalachian State, has died, both schools announced on Monday. He was 50.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>UCF Knights offensive line coach Shawn Clark has died nearly two weeks after being hospitalized due to a medical emergency, the school announced on Monday. He was 50.</p><p>Clark suffered the health issue on Sept. 9 and had been away from the team. He was said to be stable in the hospital last week. The team didn’t disclose his official condition at the time.</p><p>\"Shawn was so much more than a coach,\" UCF head coach Scott Frost said in a statement. \"He was a remarkable man, husband, and father who cared deeply about his players and staff. The reaction of our players and coaches to the news this morning is a testament to Shawn’s character and the impact he had on every life that he touched. He was loved.\"</p><p>Clark joined the Knights’ program after he spent five years as the head coach of the Appalachian State Mountaineers.</p><p>He was the head coach at Appalachian State, his alma mater, from 2019 to 2024. He was 40-24 overall and 3-1 in bowl games with wins at the New Orleans Bowl, Myrtle Beach Bowl and Cure Bowl.</p><p>\"We are profoundly saddened by the passing of App State alumnus, football All-American and former head coach Shawn Clark. We extend our deepest sympathy to Shawn’s family and everyone who knew and loved him,\" the school said in a post on X.</p><p>He started his coaching career in 2001 as a graduate assistant for the Louisville Cardinals. He was an offensive line coach with the Eastern Kentucky Colonels, Purdue Boilermakers and Kent State Golden Flashes. He was the Mountaineers’ offensive line coach in 2016 and later the offensive coordinator before taking over as head coach.</p><p><i>The Associated Press contributed to this report.</i></p><p></p></body></div></body></html>"
    },
    {
      "title": "Mourners reflect on Charlie Kirk’s legacy: ‘He went into the literal lion's den on a regular basis’",
      "link": "https://www.foxnews.com/media/mourners-reflect-charlie-kirks-legacy-he-went-literal-lions-den-regular-basis",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-22T20:00:35-04:00",
      "description": "Mourners gathered at Turning Point USA headquarters in Phoenix to honor Charlie Kirk with flowers and tributes following his assassination at Utah Valley University.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>Supporters of Charlie Kirk who are mourning his assassination are reflecting on his legacy and how it can be preserved.</p><p>\"He was a rare talent in that he went into the literal lion's den on a regular basis,\" Christopher Jackson told Fox News Digital Sunday outside the Turning Point USA headquarters in Phoenix, Arizona. </p><p>\"He made it his life purpose to go into the lion's den and civilly, in a time when a lot of it is not civil, to civilly have conversation with the other side, especially the impressionable young that are taught the complete opposite of what he felt and somehow in a relatively small amount of time turned it into where it was a crowd that was there to bash on him to where the crowd was mostly there to see him,\" Jackson added. </p><p>As mourners walked up to the Turning Point USA headquarters to pay their respects, they were greeted by a woman who owns a pop-up florist business and brought donated roses, baby’s breath, and other flowers so that each person could make their own bouquet in memory of Kirk. </p><p>\"My brother donated 300, and then I allowed other people to give because in giving we receive,\" Terrie Overstreet, who runs The Flower Bus by Terrie, told Fox News Digital. </p><p>She said that her family donated flowers so that she could fill her blue and white 1964 Vintage Volkswagen bus with donated flowers for people to make bouquets. </p><p>\"So I opened that up to the rest of my family and to my boyfriend's family and that they completed my goal, which was to fill the bus and so the bus is filled with family,\" Overstreet added. \"And yeah, and I'd love to be able to say these are blossoms of blessings for Charlie.\"</p><p>Mourners from across the country visited Kirk’s headquarters to pay their respects, and leave flowers, notes, candles, and other mementos of appreciation to honor the 31-year-old co-founder and CEO of Turning Point USA, who was shot and killed Sept. 10 while speaking at Utah Valley University during his American Comeback Tour.</p><p>Even though Kirk was one of the youngest conservative leaders in the country, he had quickly become a defining influence in the movement and was a crucial figure in President Donald Trump's 2024 election victory. He founded Turning Point USA in 2012 as an 18-year-old with encouragement from Tea Party activist Bill Montgomery.</p><p>The key to having Kirk’s legacy live on is to live how he lived, Jackson said. </p><p>I’m just hoping I feel like more and more people are learning to not be silent,\" Jackson said. \"And I think that's the answer to not be pushovers and to speak our mind and stand for what we believe like he did. And if anything I feel like that's the lasting legacy he left was to stand up for what you believe and not sheepishly let a lot of the ideology that the left espouses become the norm.\" </p><p>Ryan Elwood, who also spent time outside Turning Point USA’s headquarters to pay tribute, said that Kirk was a fair and honest communicator. </p><p>\"He really brought to light truth, justice, and facts, and that was one of the big things that the world needs to hear is the facts and the truth behind the issues, and once you have the facts, the truth, you should be able to make your own opinion from there,\" Elwood said. \"And I think he was very good about keeping it as unbiased as possible and making people come to their own conclusions.\" </p><p>Joel Freda told Fox News Digital that those who believed in Kirk’s mission must make it theirs in order for his legacy to endure. </p><p>\"I think it's gonna take everybody that ever was involved with TPUSA, it's gonna take people that ever watched him,\" Freda said. \"And he's not somebody that is replaceable... It's going to take a lot of people. And it's a massive effort. But I think he, through the work that he did for – what was it, 13 years when he started – he was like 18, 17. He built that foundation so that now it's there, the structure's already there for people to do that.\"</p></body></div></body></html>"
    },
    {
      "title": "Sinclair will preempt Jimmy Kimmel's show despite Disney ending its suspension",
      "link": "https://www.foxnews.com/media/sinclair-preempt-jimmy-kimmels-show-despite-disney-ending-its-suspension",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-22T19:57:29-04:00",
      "description": "Sinclair Broadcast Group released a statement Monday saying that it would continue to preempt Jimmy Kimmel’s show after Disney ended the show’s suspension.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>Sinclair Broadcast Group announced Monday that it would preempt ABC’s \"Jimmy Kimmel Live!\" when it returns Tuesday night.</p><p>\"Beginning Tuesday night, Sinclair will be preempting ‘Jimmy Kimmel Live!’ across our ABC affiliate stations and replacing it with news programming. Discussions with ABC are ongoing as we evaluate the show’s potential return,\" the company’s statement read.</p><p>Sinclair, which operates 30 ABC affiliates, previously joined Nexstar, another owner of ABC affiliates, in preempting Kimmel’s show last week after he made controversial comments regarding Charlie Kirk’s alleged assassin.</p><p>\"Mr. Kimmel’s remarks were inappropriate and deeply insensitive at a critical moment for our country,\" Sinclair Vice Chairman Jason Smith said in a statement.</p><p>At the time, Sinclair said that it would not lift its suspension until after discussions with ABC.</p><p>\"Sinclair also calls upon Mr. Kimmel to issue a direct apology to the Kirk family. Furthermore, we ask Mr. Kimmel to make a meaningful personal donation to the Kirk family and Turning Point USA,\" the company stated. \"Regardless of ABC’s plans for the future of the program, Sinclair intends not to return ‘Jimmy Kimmel Live!’ to our air until we are confident that appropriate steps have been taken to uphold the standards expected of a national broadcast platform.\"</p><p>Kimmel's late-night show was pulled off the air entirely last Wednesday after Kimmel's remarks about the alleged assassin of Charlie Kirk sparked outrage and a veiled threat from the Federal Communications Commission (FCC). </p><p>Disney decided to suspend the show after Sinclair and Nexstar pulled its airings of Kimmel, and Kimmel reportedly had told executives he would not apologize for his comments.</p><p>Disney reversed course on Monday and announced that Kimmel’s show would return in a statement Monday.</p><p>\"Last Wednesday, we made the decision to suspend production on the show to avoid further inflaming a tense situation at an emotional moment for our country.  It is a decision we made because we felt some of the comments were ill-timed and thus insensitive.  We have spent the last days having thoughtful conversations with Jimmy, and after those conversations, we reached the decision to return the show on Tuesday,\" a Disney spokesperson told Fox News Digital.</p></body></div></body></html>"
    },
    {
      "title": "Brittany Aldean vows to 'live like Charlie' after attending massive memorial service for Turning Point founder",
      "link": "https://www.foxnews.com/entertainment/brittany-aldean-vows-live-like-charlie-attending-massive-memorial-service-turning-point-founder",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-22T19:45:21-04:00",
      "description": "Brittany Aldean shared her emotional experience attending Charlie Kirk&apos;s memorial service with nearly 100,000 people at Arizona&apos;s State Farm Stadium.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>Brittany Aldean felt a range of emotions while attending Charlie Kirk's memorial service in Arizona on Sunday.</p><p>Brittany, 37, joined husband Jason Aldean and nearly 100,000 others at State Farm Stadium to mourn the loss of the Turning Point founder, who was shot and killed while speaking outside of Utah Valley University on Sept. 10.</p><p>The former \"American Idol\" star admitted the day \"was overwhelming,\" but that she was inspired by how Kirk \"impacted people\" as she detailed the service for her social media followers on Instagram.</p><p>\"Yesterday we went to Charlie's funeral service in Arizona, and it was vastly different than what I anticipated in the sense that it was just so faith-based,\" Brittany began. \"I knew it was going to be but everyone was worshiping … everybody. There was just something different in the room.\"</p><p>President Donald Trump, Charlie's wife Erika Kirk, and United States Secretary of Health and Human Services Robert F. Kennedy Jr. were just a few of the speakers to eulogize Kirk Sunday.</p><p>\"This man's legacy that he has left, the impact that he's had on so many people … Like, I knew he had impacted a ton of people, but this feels different,\" Brittany said. \"His death does feel like – everyone said in the services – a revival. It's putting more people in touch with their faith, and just making such a difference in so many different lives, and it was very apparent yesterday.\"</p><p>She noted, \"It was overwhelming. I expected to go in there and cry the whole time. I brought this big thing of tissues, and instead, it was weirdly positive and extremely sad, but it was awesome to hear stories about him personally and … how he's impacted people, and how he's going to be so missed, but that his legacy was so large.\"</p><p>\"He had a different purpose in life, and it was just so good to hear people say that. There was just a different plan that was greater for him that God knew,\" she said. \"It left me feeling more positive after the service, and he's obviously so missed. Something's different about this.\"</p><p>Brittany left her followers with the note, \"They keep saying live like Charlie, so I'm going to really try to do that daily.\"</p><p>The Aldeans were just a few of the prominent figures who paid their respects to Kirk at his memorial service in Glendale.</p><p>During an appearance on \"Fox &amp; Friends,\" Savannah Chrisley — who was set to join Kirk on a college campus tour before his assassination — opened up about the impact the conservative activist had on her life and explained why it is important to continue his fight. </p><p>\"I think when this assassin did take Charlie's life, that was the turning point for him,\" Chrisley said. \"He thought he was ending Charlie's life, but he really just created millions and millions of Charlie's followers to fight. To fight for our freedom, to fight for us to have a voice. For me to watch it, it's so sad and it breaks my heart. To see Erika [Charlie's wife] step in as a woman and take on this role, Charlie knew that if he couldn't do it, she was the only one that could do it.\"</p><p>Chrisley said that Kirk \"gave [her] a voice in times when she felt she didn't have one.\"</p><p>\"I was so excited to get to sit next to Charlie and open up to him and get to know him on a more personal level, like a lot of my friends who got to know him,\" she said. \"But above all else, Charlie has been a voice for our country.\" </p><p>The reality TV star said it is remarkable to see how Charlie's legacy at Turning Point USA has impacted young adults, including her brother. </p><p>\"To watch my 19-year-old brother and watch all these college kids now show up and be loud and not be afraid because, at the end of the day, our lives are on the line,\" she said. \"2028 is coming up. And Charlie, he wants us to fight. He wants us to be loud. And he said it himself, 'If you don't correct evil, if you don't speak about evil, when evil is happening, then that in itself is evil.' So it's my job to stand up, be loud, and really I don't care who likes it and who doesn't.\"</p><p>\"I keep saying that above all else, Charlie Kirk and his wife Erika, are Christians,\" she continued. \"Isn't that really the message? I think bringing Christianity back into households is the only thing that's going to save us as a country. I know for me, my Lord and Savior, Jesus Christ, I don't know where I would be today without it. And so watching Erika, I don't know how she spoke the word of God after losing her husband. I mean, I was in such awe to know that she is now the leader of Turning Point. I mean, we only go up from here.\"</p><p>Authorities identified Kirk's murder suspect as Tyler Robinson, 22. Robinson was arrested and charged with aggravated murder, felony discharge of a firearm causing serious bodily harm, and two counts of obstruction of justice, according to a court affidavit. A judge ordered that he be held without bail.</p><p><i>Fox News Digital's Christina Dugan Ramirez contributed to this report.</i></p></body></div></body></html>"
    },
    {
      "title": "Deion Sanders predicts son, Shedeur, will start for Browns at some point this season",
      "link": "https://www.foxnews.com/sports/deion-sanders-predicts-son-shedeur-start-browns-some-point-season",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-22T19:25:21-04:00",
      "description": "Deion Sanders predicted his son, Shedeur, will start for the Cleveland Browns this season despite currently being third on the depth chart behind Joe Flacco and Dillon Gabriel.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>Deion Sanders is focused on his quarterback situation with the Colorado Buffaloes, but he made a bold prediction about his son Shedeur Sanders’ NFL future with the Cleveland Browns.</p><p>\"Coach Prime\" said he believes his son will start for the Browns at some point this season.</p><p>Sanders shared his thoughts Monday on the \"New Heights\" podcast, telling hosts Jason and Travis Kelce he has \"got a feeling when it’s going to go down.\"</p><p>When asked what advice he’s given Shedeur, who is waiting his turn behind Joe Flacco and Dillon Gabriel, Deion said: \"Be patient and be ready.\" He declined to reveal when he expects Shedeur to make his first start, and the Kelces did not press him.</p><p>Head coach Kevin Stefanski has given no indication of a quarterback change. Flacco has led the Browns to a 1-2 record through three games, with the offense inconsistent but the defense among the league’s best.</p><p>Shedeur isn’t even the primary backup at this point. Gabriel, selected two rounds earlier in the 2025 NFL Draft, earned that role after preseason evaluations, Stefanski said.</p><p>Deion also revisited draft-night drama, confirming that Shedeur slid to the fifth round before being picked by Cleveland. He said the Baltimore Ravens and Philadelphia Eagles both showed interest.</p><p>Cam Newton, the former No. 1 overall pick, recently noted the Eagles’ pursuit of Shedeur. As for the Ravens, Deion essentially confirmed reports that his son told executive vice president Ozzie Newsome he wasn’t interested in sitting behind Lamar Jackson long-term.</p><p>\"How in the world can somebody fault [Shedeur] for saying or thinking, ‘Why in the world would I go back up Lamar for 10 more years?’\" Deion said on the podcast. \"I’ve never sat on the bench and said, ‘Well, I learned a lot today.’\"</p><p>The Browns drafted Shedeur with the expectation of developing him for the future, with Flacco seen as a stopgap until one of their rookies is ready. So far, the coaching staff believes Gabriel is ahead, but the season is still young.</p><p>For now, Shedeur remains third on the depth chart, though Deion remains confident his son will eventually get his chance. Whether that comes this season remains to be seen.</p><p><i>Follow Fox News Digital’s </i><i>, and subscribe to </i><i>.</i></p></body></div></body></html>"
    },
    {
      "title": "Top GOP candidates in deep red state unify behind each other at joint event: 'Bold ideas'",
      "link": "https://www.foxnews.com/politics/top-gop-candidates-deep-red-state-unify-behind-each-other-joint-event",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-22T19:10:44-04:00",
      "description": "Ohio Republican candidates Sen. Jon Husted and Vivek Ramaswamy endorsed each other at a joint event in Columbus on Monday night representing a united GOP front in the state.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>Two of the top Republicans in the solid red state of Ohio are endorsing each other, representing a move toward unity in the state where Republicans are hoping to win next November without President Trump on the ticket. </p><p>\"I’m proud to back Jon Husted for U.S. Senate,\" Ohio GOP gubernatorial candidate Vivek Ramaswamy said in a press release alongside an event with Ohio Republican Sen. Jon Husted in Columbus on Monday night. </p><p>\"Jon represents Ohio values, and he is a common-sense leader who I’ve known for years. He’s a fighter for our families and our freedoms, and he’ll carry Ohio’s voice to Washington without compromise.\"</p><p>Husted reciprocated the sentiment by issuing his own endorsement of Ramaswamy’s campaign for the governorship in Ohio. </p><p>\"Vivek has articulated bold ideas for our state, and I believe his vision for excellence aligns closely with the priorities Ohioans expect and deserve,\" Husted said. \"I’m proud to endorse my friend Vivek Ramaswamy to be the next Governor of Ohio.\"</p><p>The press release touted Husted’s \"reputation as Ohio’s common-sense public servant who streamlines government and expands opportunity\" along with Ramaswamy’s \"perspective of a successful entrepreneur who champions innovation and free markets.\"</p><p>The two candidates together, the press release stated, represent a pairing that is \"uniting Ohio around a strong mission for the state on the national stage.\"</p><p>Husted, appointed to the U.S. Senate by Ohio Gov. Mike DeWine to replace Vice President JD Vance, is running for re-election against former Ohio Democratic Sen. Sherrod Brown and Republicans across the country have circled the wagons in support of the freshman senator.</p><p> \"After 50 years of living off the tax payer, losing an election by a wide margin with $300 million in out of state money, abandoning working Ohioans to be Chuck Schumer’s lap dog, and sucking up to coastal elites, it’s time for @SherrodBrown to just go away,\" Ohio Republican Sen. Bernie Moreno, who defeated Brown last year despite entering the race as an underdog in the polls, said on X after Brown entered the race.</p><p>\"Ohio is lucky to have @SenJonHusted in the Senate!,\" Ohio Republican Congressman Jim Jordan posted on X after Brown jumped in the race.</p><p>Husted, who has previously served as Ohio's lieutenant governor and secretary of state, has Trump's endorsement as he runs next year to fill the final two years of Vance's six-year term.</p><p>Ramaswamy, a billionaire entrepreneur in the pharmaceutical sector, catapulted onto the political scene when he ran for president in 2024 before dropping out and endorsing Trump but continuing a push for the \"America First\" agenda as a surrogate. Ramaswamy had also stated an interest in being appointed to the Senate to replace Vance before Husted was appointed. </p><p>\"One of my core areas of focus that I think is really resonating, is elevating the standards of educational achievement in our state,\" Ramaswamy said earlier this year about his gubernatorial campaign.</p><p>\"The No. 1 issue that I see resonating across the board, in a non-partisan manner, is the recognition that we are in the middle of this educational achievement crisis.\"</p><p>Former Ohio Department of Health Director Dr. Amy Acton is currently the leading Democrat in the governor’s race in Ohio, a state Trump carried by 11 points in 2024. </p><p>Ramaswamy and Husted endorsing each other represents a united Republican front between Husted, elevated to the Senate by DeWine, a longtime political stalwart viewed as an establishment figure, and Ramaswamy, who has taken up the mantle of the Republican \"MAGA\" base in Ohio.</p><p>RNC surrogate and Ohio attorney Mehek Cooke told Fox News Digital that \"this kind of unity is rare\" in \"today’s political climate\" and sends a \"powerful message\" that the Republican Party is a \"big tent.\"</p><p>\"We don’t all have to look the same, speak the same, or even come from the same lane to believe in what’s best for Ohio,\" Cooke said. </p><p>\"Endorsements are more than just words on a press release—they are a testament to a shared belief that Ohio can and must lead. From excellence in our schools, to economic growth that empowers families, to building safe and strong communities rooted in opportunity, Vivek and Jon are showing that when leaders come together, Ohioans win.\"</p></body></div></body></html>"
    },
    {
      "title": "Tit for tat: House censures are becoming 'snap' solutions",
      "link": "https://www.foxnews.com/politics/tit-tat-house-censures-becoming-snap-solutions",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-22T19:02:58-04:00",
      "description": "Long reserved for weighty misconduct, the censure in the House has shifted into a rapid-fire tactic, as legislators use it tit-for-tat.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>The House of Representatives censured the late Roderick Butler, R-Tenn., in 1870 for taking a bribe for a military academy appointment. </p><p>The House also censured late Rep. Thomas Blanton, D-Texas, in 1921 for inserting a document into the Congressional Record which contained obscene language.</p><p>And late Rep. Gerry Studds, D-Mass., faced censure in 1983 for having sex with a 17-year-old page. </p><p>Those are three of the 28 Members ever censured by the House.</p><p> Rep. Ilhan Omar, D-Minn., did not become the 29th Member slapped with censure recently.</p><p>That’s probably because Rep. Cory Mills, R-Fla., was one of four Republicans who joined Democrats to block a censure of Omar. And in so doing, Mills may very well have prevented himself from becoming the 30th House Member to be censured.</p><p>Censure is the second-highest form of discipline in the House. It falls between a reprimand and expulsion. Censure is more than a regular foul in a soccer game. Kind of like a yellow card, which serves as a caution. But it’s not a red card, either, which triggers ejection.</p><p>That said, censure has become a \"thing\" in recent years on Capitol Hill. If the House were to ever consider censuring any Member, such an inquest would go behind closed doors with the Ethics Committee. An inquiry may take months.</p><p>No more. \"Snap\" censures are now fashionable in the House of Representatives.</p><p>Here’s how it works:</p><p>Someone thinks someone says a colleague says something outrageous. So they just prep a censure measure, go over the head of the Congressional leadership by making their resolution privileged (meaning the House <i>must</i> consider it within two days) and, if the House votes in favor of your gambit, that Member is censured.</p><p>Done.</p><p>Rep. Nancy Mace, R-S.C., crafted a resolution to censure Omar and strip the Minnesota Democrat from her committee assignments. Mace accused Omar of using inflammatory rhetoric in the wake of Charlie Kirk’s assassination.</p><p>During an appearance on the news outlet Zeteo, Omar claimed \"there is nothing more effed up, than to completely pretend that his words and actions have not been recorded and in existence for the last decade or so.\" Mace’s resolution quoted from a profane social media video not produced by Omar — but reposted by her — which fired invective at Kirk.</p><p>Mace’s maneuver came as leaders from both sides tried to urge calm at the Capitol amid the assassination of Charlie Kirk.</p><p>\"Every leader has an obligation to lower the temperature right now,\" said House Democratic Caucus Chairman Pete Aguilar, D-Calif. \"I disagree with the retweet of one of our one of our colleagues.\"</p><p>Aguilar said that Mace’s resolution to sanction Omar was not \"helpful.\"</p><p>\"Every member of Congress, and certainly the President of the United States, have a responsibility to take the temperature down,\" said House Minority Leader Hakeem Jeffries, D-N.Y. \"Nancy Mace wants to lecture Ilhan Omar and Democrats about civility? Are you kidding me? It's not a serious effort. It's an effort to drive donors into her gubernatorial campaign.\"</p><p>For his part, House Speaker Mike Johnson, R-La., didn’t try to sidetrack Mace. He declared that \"Members have a prerogative to file privileged motions.\" </p><p>\"What she did was outrageous and dangerous. And there has to be accountability in the House for these kinds of activities,\" said Johnson. \"I don't understand why she uses that kind of language.\"</p><p>Mace and Omar wound up tangling over the censure resolution on X. </p><p>\"One-way ticket to Somalia with your name on it, Ilhan Omar,\" posted Mace.</p><p>\"I am going soon, so please drop off the tickets on your way to your office. I am next door,\" retorted Omar. </p><p>The Minnesota Democrat added that Mace was either not \"well or smart.\" She added \"you belong in rehab, not Congress.\"</p><p>Democrats defended Omar.</p><p>\"When we are all trying to take the political temperature down, when we are all trying to work to be able to approach our differences with humanity and stand out against political violence, this is the wrong move,\" said House Minority Whip Katherine Clark, D-Mass.</p><p>But lawmakers from both sides are growing weary of the censure trap.</p><p>\"Every time a Republican in this House is offended, they pile on censure resolution,\" said Rep. Alexandria Ocasio-Cortez, D-N.Y. \"I'm not here to be fighting over whatever people's schoolyard thing is for the day.\" </p><p>\"It’s escalation,\" said Rep. Don Bacon, R-Neb., of Mace’s maneuver. \"You’ve got to remember, we’re going to be in the minority someday. We’ll be on the receiving end of this.\"</p><p>Bacon added that Congress is now \"better at shaming people versus legislating.\"</p><p>Ultimately, the House never took a direct vote on sanctioning Omar. Democrats instead moved to \"table\" or kill the resolution. That blocked an actual up/down vote on disciplining Omar. The House then voted 214-213 in favor of tabling Mace’s measure. All 210 Democrats who cast ballots voted to table. But four Republicans joined Democrats: Reps. Mike Flood, R-Neb., Jeff Hurd, R-Colo., Tom McClintock, R-Calif., and Mills.</p><p>A ballot by Mills against tabling would have reversed the final tally to 214-213. That means the House would have proceeded immediately to the actual vote to censure Omar. But Mills’ vote with the Democrats froze Mace’s effort.</p><p>It’s unclear if Mills based his decision on self-preservation. But had the House censured Omar, it would have undoubtedly triggered a resolution by Rep. Greg Casar, D-Texas, to sanction Mills.</p><p>Casar’s resolution accused Mills of assault – which Casar denies. It also alleged that Mills improperly received the Bronze Star when he served in the Army. But once the House diffused the Omar measure, Casar withdrew his plan for Mills.</p><p>Flood explained his vote to table.</p><p>\"I'm going to vote in ways that support the Ethics Committee,\" said Flood. \"If we were to pursue a censure action against this Representative, that should be referred to the Ethics Committee. It should be investigated. There should be due process. There should be a back and forth before you issue a censure.\"</p><p>Mace excoriated her Republican colleagues who voted to table.</p><p>\"They didn’t stand with Charlie Kirk. They didn’t stand with the millions of Americans mourning his death. They stood with the one who mocked his legacy. They showed us exactly who they are. And we won’t forget,\" said Mace in a statement.</p><p>But censure is now en vogue.</p><p>The House censured no members between Studds in 1983 and late Rep. Charlie Rangel, D-N.Y. in 2010. But five Members have felt the weight of censure since 2021.</p><p>The House voted to censure Rep. Paul Gosar, R-Ariz., for posting a cartoon video depicting him killing Ocasio-Cortez.</p><p>Republicans then began returning the favor.</p><p>The House voted to censure former Rep. and now Sen. Adam Schiff, D-Calif., for how he handled the Russiagate investigation. Rep. Rashida Tlaib, D-Mich., faced censure for her comments after Hamas attacked Israel. The House censured former Rep. Jamaal Bowman, D-N.Y., for pulling a false fire alarm. And the House voted earlier this year to censure Rep. Al Green, D-Texas, for heckling President Trump during his State of the Union speech. </p><p>Members have embraced censure lately. Those censured have characterized it as a \"badge of honor.\" They’ve fundraised off censure. Their colleagues have even engineered a pep rally in the well of the chamber to drown out the House Speaker when he issues the censure.</p><p>This probably won’t be the House’s last dalliance into the realm of censure.</p><p>\"It just seems like every week or so we want to censure somebody for something,\" lamented Rep. Troy Nehls, R-Tex., who is no fan of Omar. \"A lot of people say a lot of stupid stuff around here.\" </p><p>This is Congress. So you can bet that someone will say some \"stupid stuff\" soon. And unless lawmakers can restore some calm, there will be another effort to censure someone else any day now.</p></body></div></body></html>"
    },
    {
      "title": "CNN contributor Van Jones reveals Charlie Kirk reached out for civil debate one day before assassination",
      "link": "https://www.foxnews.com/media/cnn-contributor-van-jones-reveals-charlie-kirk-reached-out-civil-debate-one-day-before-assassination",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-22T19:00:15-04:00",
      "description": "CNN contributor Van Jones condemned political violence after Charlie Kirk was killed before they could have a planned respectful conversation about crime and race.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>Liberal CNN contributor Van Jones is praising Charlie Kirk for reaching out to him to have a civil debate one day before his assassination.</p><p>\"The day before he was horrifically murdered, Charlie Kirk sent me a direct message on X. He and I had been sparring publicly over the killing of a Ukrainian refugee and its relationship to race,\" Jones wrote in an op-ed for CNN.com about the slain conservative activist.</p><p>Jones explained that Kirk held a position that the killing of a White woman by a Black man was motivated by anti-White hatred. Jones disagreed with that sentiment, saying on CNN that such a position was \"unfounded.\"</p><p>\"He went on TV and denounced MY denunciation. Then he unleashed a firehose of tweets, challenging my argument,\" Jones said.</p><p>Jones’ criticisms of Kirk’s argument prompted \"racist threats\" against him, which he claimed was to the extent to which he had never seen before.</p><p>As opposed to the behavior Jones witnessed from others who flung threats at him, Kirk invited the former Obama official on his show to have a discussion.</p><p>\"Hey, Van, I mean it, I’d love to have you on my show to have a respectful conversation about crime and race. I would be a gentleman as I know you would be as well. We can disagree about the issues agreeably.\"</p><p>\"Unfortunately, before I could even respond, Charlie Kirk was killed — seemingly assassinated for the words he’s spoken, though the killer’s exact motives are still being investigated,\" Jones wrote.</p><p>Kirk's memorial service on Sunday drew a massive crowd at State Farm Stadium in Glendale, Arizona.</p><p>Jones further praised Kirk’s motives when debating students on college campuses and seeking out debates with progressives in a civil way.</p><p>\"For all our differences, neither Charlie nor I ever wanted to see the other person harmed or silenced,\" Jones said.</p><p>He added, \"To the contrary: I would have wanted to beat Charlie Kirk intellectually — by out-debating him. I would have wanted to see progressives beat him politically — by out-organizing him.\"</p><p>Jones condemned political violence in a tweet he posted shortly after Kirk was shot. </p><p>\"Today’s attack on Charlie Kirk is absolutely horrifying and heartbreaking. He fought with words, not weapons. There is no place for political violence in our society and those responsible must be swiftly brought to justice. My prayers are with Charlie’s loved ones, the traumatized students at Utah Valley University and all who have been impacted by this senseless act.\"</p><p>\"Political murder is wrong, period. I was born in 1968 — into a country being torn apart by riots and assassinations. I don’t want to go back to that. None of us should,\" Jones wrote.</p></body></div></body></html>"
    },
    {
      "title": "Cancer drug could double as autism therapy, and is poised for FDA approval",
      "link": "https://www.foxnews.com/health/cancer-drug-could-double-autism-therapy-poised-fda-approval-officials-say",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-22T18:46:29-04:00",
      "description": "The cancer medication leucovorin shows potential benefits for autism spectrum disorder, improving communication skills in some children, say administration health officials.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>During a Monday press conference about various autism topics, federal health officials noted the potential for an existing cancer drug to double as therapy for the neurodevelopmental condition.</p><p>FDA Commissioner Marty Makary, National Institutes of Health (NIH) Director Jay Bhattacharya, and Centers for Medicare and Medicaid Services Administrator Mehmet Oz discussed research suggesting that leucovorin, a prescription vitamin used to treat cancer and anemia, is effective in off-label use for children with autism.</p><p>The FDA plans to approve prescription leucovorin as a \"potential treatment for speech-related deficits associated with ASD,\" according to a press release from HHS. The agency will update the label for leucovorin to indicate treatment for cerebral folate deficiency, which has been associated with autism.</p><p>After the label update, state Medicaid programs will be able to cover the drug for autism treatment, the release stated. </p><p>The NIH will also launch new research initiatives into leucovorin's safety and effectiveness.</p><p>Studies have shown that leucovorin could help some non-verbal children gain the ability to speak.</p><p>Leucovorin functions similarly to folic acid, helping to restore folate levels in patients who may have difficulty absorbing or using it, according to Katy Dubinsky, a New York pharmacist and the CEO and co-founder of Vitalize, a private supplement company.</p><p>\"Leucovorin is FDA-approved to reduce the toxic effects of high-dose methotrexate in cancer treatment and to prevent or treat certain types of anemia caused by folate deficiency,\" Dubinsky previously told Fox News Digital.</p><p>While leucovorin isn’t yet prescribed for the treatment of autism, some families have found that its off-label use has led to significant improvements in autistic children’s communication skills, experts say.</p><p>Richard E. Frye, M.D., Ph.D., a behavioral child neurologist in Arizona, has studied the drug in his research of experimental treatments for children with autism spectrum disorder.</p><p>\"Leucovorin is a special form of vitamin B9 that is water-soluble and does not build up in your body,\" he previously told Fox News Digital. </p><p>\"Folates have been found to be safe long-term for many years and that is why we supplement our food with folate.\"</p><p>Leucovorin's main benefit for children with autism is improvement in language, Frye said, but other advantages may include enhanced social function, reduced repetitive behaviors and stronger attention skills.</p><p>\"We do find that leucovorin helps a substantial number of children with autism,\" he said. \"Language is one of the most obvious things, so that is what we measured in our clinical trial.\"</p><p>Dr. Marc Siegel, clinical professor of medicine at NYU Langone Health and Fox News' senior medical analyst, also spoke to Fox News Digital about why the drug may have this positive impact.</p><p>\"Central folate deficiency is a lack of folate in the brain, which can interfere with neurological function,\" he said earlier this year. \"A high percentage of children with autism spectrum disorder have been found to have antibodies against folic receptor alpha in the brain.\"</p><p>Leucovorin is converted to folate in the brain by a different pathway, Siegel said.</p><p>\"Small studies are showing that it improves neurological function and communication skills in kids with ASD, but larger studies need to be done.\"</p><p>The fact that leucovorin has already been used long-term helps to reduce the associated risk, doctors say.</p><p>\"One of the advantages of using leucovorin is that it's been used for decades to protect the body from the effects of chemotherapy, so we know what dose to use and any side effects it may produce,\" Frye told Fox News Digital.</p><p>However, some children do become \"extremely hyperactive,\" do not respond to leucovorin and need alternative treatments, the doctor noted.</p><p>It’s important for families to work with a medical professional when exploring the use of leucovorin for autism, he advised.</p><p>\"Leucovorin is given at much higher doses than regular vitamins, so it’s very important to work with a doctor knowledgeable in how to prescribe it,\" Frye said. </p><p>While leucovorin is available at pharmacies, Frye said some children need a compounded form because they are sensitive to some of the additives in commercial products.</p><p>\"Our goal is to get leucovorin approved by the FDA for autism so it can be widely prescribed to children as one of the first treatments once they are diagnosed,\" he previously said.</p><p>Dubinsky agreed physicians may prescribe the \"widely used and well-tolerated drug\" for autism treatment based on their \"clinical judgment and emerging evidence\" — but also stressed the importance of clinical trials.</p><p>\"FDA approval would provide stronger medical backing, making it a recognized treatment rather than just an off-label option,\" she told Fox News Digital. </p><p>\"This could lead to insurance coverage, standardized dosing guidelines and broader acceptance in the medical community.\"</p><p>Siegel added that leucovorin is a \"safe drug\" and should be considered for large-scale use based on the findings of recent research.</p><p>Frye said there is \"no magic bullet\" for autism, with many children benefiting from a combination of multiple treatments. </p><p>\"It is unlikely that leucovorin will be used alone — it must be used with behavioral and speech therapy,\" he said. \"We believe that leucovorin can improve outcomes for these therapies.\"</p><p>Andy Shih, Ph.D., chief science officer of Autism Speaks in New York, noted that every child’s experience with autism is unique.</p><p>\"There is little evidence to suggest that the benefits observed [in individual cases] can be generalized to the broader autistic community,\" he previously told Fox News Digital. </p><p></p><p>\"While some small studies have explored leucovorin as a potential treatment for people with autism, larger controlled clinical trials are needed to determine its efficacy and safety. We urge families to consult with their doctors before considering off-label treatments.\"</p><p>Dubinsky added that if larger studies confirm leucovorin’s effectiveness, it could become a more accessible treatment for children with autism who may benefit from it.</p></body></div></body></html>"
    },
    {
      "title": "Maher and anti-Trump director Rob Reiner clash over whether right and left should still talk with each other",
      "link": "https://www.foxnews.com/media/maher-anti-trump-director-rob-reiner-clash-over-whether-right-left-should-still-talk",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-22T18:00:14-04:00",
      "description": "Comedian Bill Maher argues people should talk regardless of beliefs while director Rob Reiner insists on agreeing on facts first during their podcast debate.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>On Monday’s episode of his \"Club Random\" podcast, comedian Bill Maher sparred with Hollywood director Rob Reiner over whether the right and left in America should keep talking to each other.</p><p>Maher insisted that both sides should continue talking despite the heightened political tensions in the country – inflamed in recent weeks by the assassination of Charlie Kirk – while the Hollywood liberal said there might be exceptions if people can’t agree on basic facts. Maher disagreed, calling Reiner’s point a slippery slope.</p><p>\"Before you have the exchange, you have to agree on certain facts,\" Reiner said.</p><p>Maher replied, \"No, you don’t. You can’t. Once you start down that road… you just have to talk to people.\"</p><p>Reiner, an outspoken critic of President Donald Trump, opened the discussion by saying conservatives and liberals today are less willing to sit down and hash out issues than in previous eras.</p><p>Maher agreed and criticized Democrats for refusing bipartisan cooperation at a time when Republicans hold more political power. </p><p>\"This would make some sense for the Democrats if they had any power,\" he said. \"But the idea of we don’t talk to you when we don’t even have the power? Of course, you have to talk to people.\"</p><p>Reiner partially agreed, though he maintained that there has to be some agreement between both sides before dialogue can start. Maher rejected that idea, though Reiner pushed back.</p><p>\"No, no, you talk to people. But if somebody says two plus two is four and the other guy says, ‘No, it’s not,’ how do you begin the discussion?\" he asked.</p><p>\"Because, Rob, that's a slippery slope,\" Maher replied.</p><p>Elsewhere, the host told the filmmaker, \"If you start down that road of ‘I can’t talk to you if you believe this crazy thing’ because maybe – you just can't.\"</p><p>Reiner needed more convincing.</p><p>\"Let’s say you’re having a conversation with that person,\" he said, using the example of someone who denies the moon landing. \"So what do you say after that?\" he asked.</p><p>Maher offered his solution. </p><p>\"Same thing you would do in a marriage,\" he said.</p><p>He continued: \"It’s very like a relationship. And no, I have not been married, but I have been in long-term serious relationships. And I know there are moments where the person is believing something and you just – every fiber of your being wants to be like, ‘I got to get this person to not see it that way, ‘cause I just think it’s f------ nuts.’\"</p><p>\"And if you want that relationship to last, you’re gonna have to learn the three little words that are most important to any relationship, and they’re not ‘I love you.’ They’re, ‘Let it go,’\" Maher added. </p></body></div></body></html>"
    },
    {
      "title": "Cowboys' CeeDee Lamb could miss 3-4 weeks after suffering high ankle sprain in loss to Bears: report",
      "link": "https://www.foxnews.com/sports/cowboys-ceedee-lamb-could-miss-3-4-weeks-after-suffering-high-ankle-sprain-loss-bears-report",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-22T17:56:06-04:00",
      "description": "Dallas Cowboys star receiver CeeDee Lamb reportedly suffered a high ankle sprain that could sideline him 3-4 weeks, potentially missing Sunday&apos;s game against Green Bay Packers.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>The Dallas Cowboys are expected to be without star wide receiver CeeDee Lamb for several weeks.</p><p>Lamb, quarterback Dak Prescott’s top target, suffered a high ankle sprain in Sunday’s loss to the Chicago Bears. The injury could sideline him three to four weeks, according to ESPN.</p><p>Stephen Jones, the Cowboys’ executive vice president and son of owner Jerry Jones, told 105.3 The Fan in Dallas that the team still needs to evaluate Lamb’s condition but admitted it doesn’t look promising.</p><p>\"I think we’ve got to evaluate the full thing and see how he’s moving around as the day goes,\" Jones said. \"Certainly, he’s got the high ankle sprain, and every one of those are different. We’d love to have him back for Green Bay, but at the same time, we also got to understand the injury is what it is, and we’ll play it out.\"</p><p>Dallas faces the Packers on Sunday in a highly anticipated matchup, given the blockbuster Micah Parsons trade between the two teams before the 2025 season.</p><p>Lamb said the injury is \"absolutely\" something he believes he could play through. He was hurt in the first quarter when Bears linebacker Noah Sewell fell across both of his legs during a rushing attempt. Replay showed Lamb’s ankle twist awkwardly before he walked gingerly off the field and into the medical tent.</p><p>He briefly returned to run one route but exited for good. After the game, he was seen wearing a walking boot. An MRI on Monday confirmed the sprain.</p><p>The loss of Lamb, even temporarily, is significant for the Cowboys. He opened the year with back-to-back 100-yard receiving games before leaving Sunday’s contest.</p><p>Lamb has dealt with injuries before, missing just three games in his Dallas career. He was sidelined by a concussion in 2021 and a shoulder injury in 2024 that cost him two games.</p><p>\"It changes quite a bit,\" Jones said of the offense without Lamb. \"When you’re able to have both out there, it’s a huge plus. Certainly, Pickens can do a great job for us in the role.\"</p><p>The Cowboys will rely on George Pickens, who showed visible frustration during the Bears loss, as well as tight end Jake Ferguson and receivers KaVontae Turpin and Jalen Tolbert to help fill the void.</p><p><i>Follow Fox News Digital’s </i><i>, and subscribe to </i><i>.</i></p></body></div></body></html>"
    },
    {
      "title": "‘Spider-Man’ star Tom Holland suffers head injury during stunt gone wrong",
      "link": "https://www.foxnews.com/entertainment/spider-man-star-tom-holland-suffers-head-injury-during-stunt-gone-wrong",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-22T17:53:13-04:00",
      "description": "Tom Holland suffered an injury on the set of &quot;Spider-Man: Brand New Day&quot; that required a trip to the hospital and caused a delay in filming.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>Tom Holland suffered a mild concussion on the set of \"Spider-Man: Brand New Day\" after a stunt went wrong. </p><p>According to Deadline, filming was suspended temporarily Friday after Holland was taken to the hospital. The actor was reportedly treated and released, not admitted.</p><p>A source close to production told the outlet that Holland will take a break \"out of precaution,\" but is expected to return to filming in a few days. </p><p>Holland does not appear to have been seriously injured. According to The Sun, the actor attended a charity event with his co-star and fiancée Zendaya and his father over the weekend. However, he reportedly left early because he wasn't feeling well.</p><p>A representative for Holland did not immediately respond to Fox News Digital's request for comment. </p><p>This isn't the first on-set injury to make headlines recently.</p><p>Earlier this year, Charlize Theron revealed that while filming her latest action-packed project, \"Apex,\" she sustained a painful injury after performing some of her own stunts without protective gear.</p><p>\"Our crew delivered a really impressive movie, and yours truly did some stunts and action — without a harness, sometimes,\" Theron said at Netflix’s 2025 upfront presentation in May, according to Entertainment Weekly. \"Don't tell Netflix.\"</p><p>\"It's actually a miracle that I'm here today,\" she noted. </p><p>\"'Apex' only wrapped like a week ago, so I'm fresh off the mountain. I still have some Australian dirt under this pretty manicure, and my cute boot is hiding a fractured toe ... I can go on and on and on, but I won't.\"</p><p>Despite the physical toll, Theron, 49, remained in good spirits as she recovered. </p><p>\"I can honestly say that shooting ‘Apex’ was one of the most incredible experiences of my life,\" she said. </p><p>Tom Cruise also suffered a serious injury while performing a stunt on the set of \"Mission: Impossible – The Final Reckoning.\"</p><p>In bonus content from the digital release of the film, Cruise and director Christopher McQuarrie broke down one of the movie’s most harrowing sequences: a high-flying biplane battle between Cruise's character, Ethan Hunt, and Gabriel, portrayed by Esai Morales.</p><p>\"Oh, this almost broke my back,\" Cruise, whose character was leaping from one plane to another, revealed in the commentary, per Entertainment Weekly.</p><p>\"You’re talking about a lot of pain here,\" McQuarrie chimed in.</p><p>\"Now watch this, the thing we haven’t talked about, holding on to this belt,\" McQuarrie described, while Cruise said, \"Oh God, that was brutal.\"</p><p>The director went on to explain, \"This separated the joints in Tom's fingers from the force, so by the time we finished this sequence, your hands were absolutely swollen – oh my God, it was so painful to watch.\"</p><p><i>Fox News Digital's Stephanie Giang-Paunon contributed to this report. </i></p></body></div></body></html>"
    }
  ]
}