{
  "title": "Latest News",
  "link": "https://moxie.foxnews.com/google-publisher/latest.xml",
  "description": "Latest news from 1 sources",
  "items": [
    {
      "title": "Bill Maher explores connection between internet memes and recent political violence",
      "link": "https://www.foxnews.com/media/bill-maher-explores-connection-between-internet-memes-recent-political-violence",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-27T03:37:48-04:00",
      "description": "Bill Maher explores the connection between internet memes and recent shootings, including the Dallas I.C.E. facility attack, with internet culture researcher Aidan Walker on &apos;Real Time.&apos;",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>\"Real Time\" host Bill Maher asked an internet culture researcher Friday about memes to understand how people get \"inspired to kill.\" </p><p>Memes, or \"historical documents\" with various interpretations, were engraved on the shell casings of late Turning Point USA founder Charlie Kirk’s suspected assassin, \"Real Time\" guest Aidan Walker said.</p><p>Kirk’s accused killer etched gamer-inspired and antifascist messaging on his casings, including, \"Hey, fascist! Catch!\" and a reference to a World War II anthem.</p><p>\"But [memes] take on new meanings, I mean this is part of why people get inspired to kill,\" Maher said. \"Because they get insulted by them, right? They get hurt by them. They have a meaning that a lot of us older people are not getting, correct?\" </p><p>The discussion came in the wake of Wednesday’s deadly shooting at a Dallas I.C.E. facility, where one detainee was killed, and two others were wounded before the shooter took his own life. The gunman reportedly left behind a bullet casing inscribed with the phrase \"anti-ICE.\" </p><p>He was almost \"murdering ironically,\" Maher considered. </p><p>\"I mean, that’s a place society has never been,\" Maher continued. \"Yes, young men are bad and fumbling to get women to agree to what they want to do. But it was never like this. We never had the term incel [involuntarily celibate].\" </p><p>A lot of memes can also be ironic, Walker explained.</p><p>\"In a way it’s a little bit like dog whistle…they’re so layered in, you know, I don’t really mean this, but you can put this sort of anti-social or hateful idea behind that,\" he described.</p><p>The 26-year-old researcher attributed problematic anti-social behavior to not just an affordability crisis but a \"crisis of meaning.\" </p><p>\"You have a lot of especially young people who don’t see a future for themselves, who feel lonely, who feel alienated,\" he discussed. \"And they congregate in these online spaces sort of outside of the mainstream where they feel like that online world is more important than their real world.\"</p><p>Walker went on to share \"the way out\" that he says gives him hope.</p><p>\"It’s giving people those social bonds… giving everybody the shot at dignity and the shot at being seen in our culture,\" he said. </p><p>While Republicans like Vice President JD Vance blame \"left-wing political radicalization\"for recentviolence, Maher didn’t mince words in his closing monologue for those arguing the Left is \"more approving\" of it:</p><p>\"You keep saying the Left is more approving of political violence – well who do you think that’s going to be aimed at?\" Maher asked. \"I know it feels exhilarating to make the liberals cry their liberal tears after they made you feel disrespected and looked down on flown over and called the nutty ones. But come on, I thought you were the tough guys. Get over it.\"</p></body></div></body></html>"
    },
    {
      "title": "Volunteer pilots reflect on one year since Helene devastated western North Carolina",
      "link": "https://www.foxnews.com/weather/volunteer-pilots-reflect-one-year-since-hurricane-helene-devastated-western-carolina",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-27T03:11:37-04:00",
      "description": "One year after Hurricane Helene hit Western North Carolina, pilots from Total Flight Solutions and United Cajun Navy reflect on their life-saving rescue operations.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>It's been one year since Helene devastated parts of the region in Western North Carolina and some of the first eyes-in-the-sky are reflecting on the devastation that followed. </p><p>Without cell service and washed-out roads, hundreds of people were left stranded in the mountains. </p><p>Al Mattress, a helicopter pilot with a commercial flight company, Total Flight Solutions, said he received an early morning call from one of the company's clients. The client asked them to check on a family member in western North Carolina. </p><p>Mattress says he got up in the air as quickly as he could. He was one of the first to see what was actually going on in the region.</p><p>\"Watching it unfold, ya know, this water was still rising,\" Mattress tells FOX. \"I had gotten there personally, literally, right after the storm left.\"</p><p>Mattress did a couple missions checking on loved ones and realized the destruction was worse than anyone thought. Back on the ground was Total Flight Solutions helicopter pilot, Tim Grant. Grant laid out the logistics for dozens of pilots in the coming weeks as missions switched from rescues to donation drops. </p><p>With support from the United Cajun Navy, Grant says they brought in nearly every helicopter they could. Everyone donated their time, effort and resources to immediately rescue people, or drop off essentials like medicine. </p><p>Mattress talked to FOX about the reactions and conversations he had with some of the people he rescued.</p><p>\"No phones, ya know the phone they have, it's till the battery goes dead. They don’t know. They can’t call, they don’t know anybody is coming for them.\"</p><p>\"When they [the pilots] would get done with their mission, they would climb high enough to find a cell phone tower that was outside, make a radio call and say, ‘hey, this is where I am, I picked up these people, and they’re OK,’\" says Grant.</p><p>Grant's team of volunteer pilots did 25 rescues the first day and 30 the second day after Helene. \"But we did well over 100 missions, just dropping off food and supplies,\" he says. </p><p>Volunteer pilots were working from sunup to sundown. Grant says pilots would debrief at the end of the day for about an hour before they called it a night. </p><p>One story stood out to Grant the most: \"He [a pilot doing a rescue] went to go pick up some people, and he could see arms sticking out from the mudslides that had gone over.\"</p><p>Also doing missions, but just dropping off supplies — was South Carolinian, Austin Lane. He heard about a group on Facebook, Carolina Aviators Network, putting together a group of pilot volunteers to get donations closer to the mountains. </p><p>Lane flies a 1960s Baron twin-engine plane with a 1,000-pound load capacity, allowing him to fly a little further than other planes volunteering. </p><p>\"Delivered diapers for people with newborn babies or delivered canned goods or dietary restrictions and insulin,\" Lane says. </p><p>Looking back, Lane is amazed at the organization of the donation sites he landed on. He says it only took minutes for volunteers at local airports to load his plane with supplies. </p><p>\"It was one of the very few that could get further out. So we were doing 6 to 8 trips a day,\" he says. </p><p>Grant reflects on the overall experience, \"The people that donated their supplies, their people, their helicopters, whatever it was…that was the best part.\"</p><p>Roads began to clear with help from the North Carolina National Guard and other volunteers. This allowed more volunteers and nonprofit organizations to get further into the hardest hit regions. </p><p>The NCNG tells FOX there were 869 air rescues, with 165 of them being complex hoist rescues. In an email to FOX, \"A complex hoist rescue is when a helicopter crew uses a hoist to lift people from dangerous or hard-to-reach places during a disaster or emergency, and the situation is harder than a normal rescue.\"</p><p>Overall, the NCNG says South Carolina, Maryland, Oklahoma, Georgia, Florida, Connecticut, Minnesota, Iowa, New York, and Pennsylvania provided aircraft. The Army Helicopters used 21 CH-47 Chinooks, 7 UH-60 Blackhawks, 4 UH-72 Lakotas for a total of 32 helicopters.</p><p>The NCNG also rescued 226 pets, dropped off 3,638 food pallets and brought in 1,877 tons of cargo by air.  </p></body></div></body></html>"
    },
    {
      "title": "Trump admin revokes Colombian president’s visa over alleged ‘reckless and incendiary actions’",
      "link": "https://www.foxnews.com/politics/trump-admin-revokes-colombian-presidents-visa-over-alleged-reckless-incendiary-actions",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-27T02:32:05-04:00",
      "description": "Colombian President Gustavo Petro&apos;s visa was revoked by the Trump administration over what officials allege were &quot;reckless and incendiary actions&quot; in New York City.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>The Trump administration announced late Friday it is revoking the U.S. visa of Colombian President Gustavo Petro over alleged \"reckless and incendiary actions\" in New York City. </p><p>\"Earlier today, Colombian president @petrogustavo stood on a NYC street and urged U.S. soldiers to disobey orders and incite violence,\" read a post on the U.S. State Department's X account. \"We will revoke Petro’s visa due to his reckless and incendiary actions.\"</p><p>Fox News Digital has reached out to the Colombian embassy but did not hear back before publication. </p><p>The visa revocation comes on the heels of the annual meeting of the U.N. General Assembly in New York City this week. </p><p>Videos circulating online show the Colombian president addressing a crowd gathered at a demonstration against Israel and its prime minister, Benjamin Netanyahu, who was in New York City Friday to address the assembly. </p><p>In a fiery speech earlier this week, Petro called for a criminal investigation against President Donald Trump and other administration officials over deadly strikes on boats in the Caribbean that the White House said were carrying drugs. </p><p>Petro repudiated the attacks, calling them an \"act of tyranny,\" while also accusing Trump of criminalizing poverty and migration.</p><p>\"Criminal proceedings must be opened against those officials, who are from the U.S., even if it includes the highest-ranking official who gave the order: President Trump,\" Petro said of the strikes, adding that boat passengers were not members of the Venezuelan Tren de Aragua gang as the Trump administration claimed after the first attack.</p><p>If the boats were carrying drugs as alleged by the U.S. government, Petro said, their passengers \"were not drug traffickers; they were simply poor young people from Latin America who had no other option.\"</p><p>Petro, a former Marxist guerrilla and Colombia’s first leftist leader, has had a rocky relationship with Trump since the inauguration.</p><p>In January, Trump threatened to impose 50% tariffs on all imports from the Latin American country if it did not accept military planes full of deported Colombians as part of Trump’s deportation sweep. Petro threatened to retaliate with counter tariffs but later relented and agreed to lift his ban on the flights. </p><p>In April, Petro claimed that the Trump administration had revoked his travel visa to the U.S. During a cabinet meeting that month, Petro said he could not attend meetings with international organizations in Washington, D.C., because \"they took away my visa.\" </p><p>\"I didn’t need to have one, but anyway, I’ve already seen Donald Duck several times, so I’ll go see other things,\" Petro said. </p><p><i>Fox News Digital's Caitlin McFall, Anders Hagstrom and The Associated Press contributed to this report.</i></p></body></div></body></html>"
    },
    {
      "title": "DEA in Atlanta using new lab to process federal drug seizures as fight against cartel heats up",
      "link": "https://www.foxnews.com/us/dea-atlanta-using-new-lab-process-federal-drug-seizures-fight-against-cartel-heats-up",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-27T01:41:06-04:00",
      "description": "The DEA is leading a nationwide effort to crackdown on the violent Cartel Jalisco New Generation (CJNG). DEA chemists in Atlanta are using a new lab to test and weigh drugs quicker.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>The Drug Enforcement Administration (DEA) in Atlanta has a new tool in its fight against one of Mexico's most notorious cartels.</p><p>The DEA Atlanta Field Division opened a new lab in May to process all federal drug seizures in Georgia. The lead DEA agent in Atlanta said the lab is already making agents more efficient as they go after the violent \"Cartel Jalisco New Generation (CJNG).\"</p><p>In the past, the DEA in Atlanta would call in chemists from labs in other cities to test drugs, a process that took a few days to complete. Now that the lab is in house, the agency can test drugs within minutes. </p><p>\"It would take maybe a day or two for somebody to come out,\" said Chad Chumbley, DEA Supervisory Forensic Chemist. \"We are able to respond right away and help out.\"</p><p>Since federal prosecutors determine charges based on what the drug is and how much of it an agent seizes, the DEA chemists who test and weigh the drugs play a vital role in the process.</p><p>In September, the DEA in Atlanta seized over 1,000 pounds of meth in an operation targeting the CJNG. After the busts, agents sent the drugs to the lab for testing. </p><p>\"We will take a statistical sampling to give a general proportion of the population that will contain the substance,\" Chumbley said. </p><p>Agents arrested five illegal immigrants who they said were distributing the meth in black trash bags. Robert Murphy, Special Agent in Charge of the DEA Atlanta Field Division, said all the suspects were Mexican nationals with ties to CJNG.</p><p>\"Over 700 pounds of this was in an apartment with two kids under ten years old in there,\" Murphy said. \"They do that by design. Cartels want to blend in.\"</p><p>Murphy estimated the street value of the meth to be at least $4 million. He said the suspects were also in charge of getting that money back to the cartel. </p><p>\"Their drug of choice is money. They care nothing about the poison, the people, the lives they're destroying or the misery they're dealing in. That doesn't bother them one bit,\" Murphy said.</p><p>CJNG has risen to power ever since the arrest of multiple high-ranking members of the rival Sinaloa Cartel.</p><p>In 2023, El Chapo's son, Ovidio Guzmán López, was arrested in Mexico. The next year, Ismael \"El Mayo\" Zambada and Joaquín Guzmán Lopez, another son of El Chapo, were arrested in El Paso, Texas.</p><p>\"All the war and fighting going on in Mexico — it's about one thing. Whoever controls the gateway, the access points to the U.S., wins the war in the end,\" Murphy said. \"CJNG has risen to power, and we want to make sure our efforts are focused on making sure they don't get too strong.\"</p><p>The operation is part of the DEA's nationwide effort to crackdown on CJNG. </p><p>On Monday, DEA agents stopped more than 175 pounds of cocaine linked to the cartel from crossing the southern border into the United States. The next day, agents in Houston seized more than 28 pounds of cocaine and $470,000 from suspected CJNG members. </p><p>\"Every little bit counts. Every seizure counts. We're targeting the entire network from facilitators, producers, transporters, money launderers — anybody that we come across that's related to CJNG, we are pursuing,\" said Brian Leordo, DEA Houston Field Division Deputy Special Agent in Charge.</p></body></div></body></html>"
    },
    {
      "title": "North Carolina family still recovering a year after Hurricane Helene destroyed home",
      "link": "https://www.foxnews.com/weather/north-carolina-family-still-recovering-year-after-hurricane-helene-destroyed-home",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-27T00:15:13-04:00",
      "description": "The Keele family looks back on the past year since their Western North Carolina home was destroyed by Helene after the hurricane turned tropical storm ravaged the region.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>Nearly one year ago, Hurricane Helene downgraded to a tropical storm and surged right through Western North Carolina, destroying over 74,000 homes and causing around $60 billion in damages, according to the governor's office.</p><p>Some families are still trying to figure out how to move forward a year after the storm. </p><p>\"My entire 20th year of life has been recovering from a storm,\" Amiyah Keele said while reflecting on the past 12 months with her mother, Jessica.</p><p>The Keeles currently live in a camper on a property in Burnsville, North Carolina, after Helene sent about four feet of water through their home on Sept. 27, 2024. Their camper is right next to a house with other family members.</p><p>The Keeles first spoke with FOX back in November, while they were stocking up on fuel for their generators. </p><p>\"The water was too high and too fast, like we - just made it out,\" Amiyah said. The Keele family waded through the raging river until they were safe with their neighbors, staying for nearly a week.</p><p>In the aftermath of the storm, the majority of the region had no cell service, electricity or running water.</p><p>\"About a week of just — just nothing, like we didn’t know if anybody else we knew were(sic) okay,\" Amiyah said. </p><p>After about a week, volunteers and donations began pouring into the region from all over the country.</p><p>One group set up a distribution and supply site just a couple miles down the road from the Keeles. The only way they could get there was by walking, but the family went nearly every day to help volunteer. </p><p>\"[About] five days later and luckily, we were blessed with wonderful tents,\" Jessica told FOX. For nearly a month, the family stayed in tents as recovery began around them.</p><p>Volunteers and nonprofit organizations also donated a new car and generators to the Keeles. </p><p>Amiyah said a heater is a \"godsend\" when \"you're trying to sleep in a tent.\" Not too long after, the family was blessed with a camper by a nonprofit.</p><p>\"It didn’t have power or water, but it was better than a tent,\" Jessica said. </p><p>The Keeles are still living in the donated camper. Since then, they've received a couple of donated sheds, which hold some of their belongings. Damaged appliances and furniture still sit outside their flooded home.</p><p>\"Samaritan's Purse is great. They came and mucked out the house and had a snowball fight with my son,\" Jessica said.</p><p>Meanwhile, a simple reminder to keep on going through the trauma and obstacles is a wooden sign hanging in the donated camper that said \"so this is not Home Sweet Home…ADJUST!\"</p><p>Jessica said the sign survived the flood.</p><p>She told FOX, \"We’re actually doing great compared to some people,\" and Amiyah chimed in, \"And we’re still struggling.\"</p></body></div></body></html>"
    },
    {
      "title": "DNA evidence cracks cold case, connects dead suspect to murders of 4 teens at Austin yogurt shop",
      "link": "https://www.foxnews.com/us/dna-evidence-cracks-cold-case-connects-dead-suspect-murders-4-teens-austin-yogurt-shop",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-26T23:33:59-04:00",
      "description": "DNA evidence has linked now-dead Robert Eugene Brashers to a Texas quadruple murder cold case from 1991 where four teenage girls were killed at an Austin yogurt shop.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>Investigators have identified a suspect in a Texas quadruple murder cold case more than three decades old. </p><p>Police in Austin said on Friday that they had linked Robert Eugene Brashers to the murders of four teen girls at a yogurt shop in 1991 through DNA. </p><p>Brashers, who committed suicide in 1999, was also suspected of being a serial predator at the time, according to the Austin American-Statesman. </p><p>He was convicted of attempted murder after shooting a woman in the head in 1985, and was sentenced to 12 years in prison. He was released in 1989 after only serving three years in prison, the Statesman reported. </p><p>He fatally shot himself following a police standoff at a motel where he had been hiding with his wife, daughter and two stepdaughters, after releasing them from the motel.</p><p>DNA evidence also linked Brashers after his death to three rapes and murders in Missouri and South Carolina – including a mother and daughter – and a rape in Tennessee. </p><p>Robert Springsteen and Michael Scott, who were teenagers at the time of the murders, were charged and convicted of the killings in 2001 and 2002. </p><p>They were sentenced to death and life in prison respectively, but their convictions were overturned on appeal, one of the reasons being that there was no DNA evidence linking them to the crimes. </p><p>Later becoming known as the \"Yogurt Shop Murders,\" the violent case remains infamous in Austin and is still open. HBO premiered a docuseries called \"The Yogurt Shop Murders\" last month about the killings. </p><p>Amy Ayers, 13; Eliza Thomas, 17; and sisters Jennifer and Sarah Harbison, ages 17 and 15, were bound, gagged and shot in the head at the \"I Can’t Believe It’s Yogurt\" store where two of them worked. The building was then set on fire.</p><p>\"Our team never gave up working this case,\" Austin police said in a statement on Friday. </p><p>The department has a conference planned on Monday to discuss the new evidence in the case. </p><p><i>The Associated Press contributed to this report.</i></p></body></div></body></html>"
    },
    {
      "title": "Trump administration presses Supreme Court on executive order restricting birthright citizenship",
      "link": "https://www.foxnews.com/politics/trump-administration-presses-supreme-court-executive-order-restricting-birthright-citizenship",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-26T23:15:21-04:00",
      "description": "The Trump administration asked the Supreme Court to review the president&apos;s executive order limiting birthright citizenship amid ACLU class action suit.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>The Trump administration in June filed a petition asking the U.S. Supreme Court to review President Trump’s executive order restricting birthright citizenship, a move that could redefine a long-standing constitutional guarantee. That appeal has not yet been docketed, but justices are expected in coming weeks to decide whether to hear the case, according to Fox News.</p><p>According to CNN, the filing by Solicitor General D. John Sauer argued that the prevailing interpretation of the Fourteenth Amendment is \"mistaken\" and has had \"destructive consequences.\" Sauer wrote that lower-court rulings against the order improperly conferred \"the privilege of American citizenship on hundreds of thousands of unqualified people.\"</p><p>At stake is whether the U.S. will continue to recognize nearly all children born on its soil as citizens, a principle the Supreme Court decided in \"United States v. Wong Kim Ark\" (1898).</p><p>The outcome could reshape the 14th Amendment's Citizenship Clause, which has long been understood to guarantee citizenship to virtually every child born on U.S. soil regardless of parents’ status.</p><p>John Eastman, who advised on drafting the order, praised the administration’s appeal. \"Hurrah for Solicitor General Sauer for expeditiously seeking Supreme Court review of the Ninth Circuit’s decision blocking President Trump’s executive order restoring the original meaning of the 14th Amendment’s citizenship clause,\" Eastman told Fox News Digital.</p><p>\"The people who drafted and ratified that clause never intended to confer automatic citizenship on the children of temporary visitors, and certainly not to the children of illegal aliens. The historical record is clear, and I look forward to the Supreme Court restoring the original meaning of the clause.\"</p><p>Trump’s order seeks to narrow that interpretation to children of U.S. citizens and lawful permanent residents. If upheld, it could deny automatic citizenship to many children born in the U.S. each year.</p><p>In \"Wong Kim Ark,\" the Court ruled that a San Francisco-born man whose Chinese parents were barred from naturalization was nonetheless an American citizen under the 14th Amendment. That decision cemented \"jus soli,\" or citizenship by birth on American soil, with narrow exceptions for children of diplomats, foreign occupiers and sovereign tribal nations.</p><p>Critics of the executive order argue that the text and history are clear. UC Berkeley law professor John Yoo has written that the Framers borrowed British \"jus soli\" traditions and that Reconstruction lawmakers expanded citizenship to ensure formerly enslaved people and their descendants were fully included.\"It is simply beyond doubt that the Framers operated by borrowing and adopting common law principles … to adopt an interpretation that rejects that meaning, we would want to see historical evidence that the Framers had adopted a radically new interpretation,\" Yoo wrote.</p><p>Supporters of the order counter that the phrase \"subject to the jurisdiction thereof\" requires full and lawful political allegiance, not simply being born on U.S. soil. John Eastman, who advised on drafting the policy, has argued that the Constitution requires both birth on U.S. soil and \"complete\" jurisdiction. \"Complete\" means allegiance to the U.S., not to another sovereign. </p><p>The order has already faced multiple challenges. Federal courts initially blocked it with broad injunctions, though the Supreme Court later narrowed those rulings.</p><p>In a recent dissent, Justice Sonia Sotomayor suggested class actions could provide a way forward for challengers, writing that \"parents of children covered by the Citizenship Order would be well advised to file promptly class action suits … and lower courts would be wise to act swiftly.\" </p><p>\"Every court to have looked at this cruel order agrees that it is unconstitutional … we are fighting to make sure President Trump cannot trample on the citizenship rights of a single child,\" said Cody Wofsy, an attorney with the ACLU after June's petition.</p><p>\"This executive order directly opposes our Constitution, values, and history, and it would create a permanent, multigenerational subclass,\" added Devon Chaffee, executive director of ACLU-NH.</p><p>Karla McKanders of the Legal Defense Fund called the order \"an unlawful attempt to entrench racial hierarchies,\" saying, \"Citizenship is a right afforded to us by birth, not by privilege.\"</p><p>Fox News Digital has requested comment from the White House and the ACLU and its partner organizations.</p></body></div></body></html>"
    },
    {
      "title": "Charlie Kirk's legacy honored as customers flock to Steak 'n Shake in solidarity",
      "link": "https://www.foxnews.com/food-drink/charlie-kirks-legacy-honored-customers-flock-steak-n-shake-solidarity",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-26T22:23:32-04:00",
      "description": "A Steak &apos;n Shake owner&apos;s tribute billboard to assassinated Turning Point USA founder Charlie Kirk has gone viral, driving customers nationwide to support the chain.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>A Georgia businessman's billboard tribute to Charlie Kirk is drawing national attention in the wake of the Turning Point USA founder's recent murder.</p><p>Wayne Robinson, president of Wayne Robinson Holdings, owns a Steak 'n Shake location in Rome, Georgia. The 1950s-inspired chain serves milkshakes and burgers, and the Rome location is one of hundreds across the country.</p><p>Robinson told Fox News Digital he was devastated after Kirk was fatally shot in the neck while speaking to audience members at Utah Valley University on Sept. 10.</p><p>\"I've always been a follower of Charlie,\" said Robinson, noting he was impressed by Kirk's debates with students on college campuses.</p><p>\"He was bringing so many of those young people to Christ. … He touched me, and when the assassination happened, it was something that really wore heavy on me.\"</p><p>The day after Kirk died, Robinson was compelled to act quickly. He alerted one of his marketing partners to \"put something out there to honor Charlie.\"</p><p>The billboard reads, \"Charlie Kirk, 1993-2025,\" followed by the words, \"Stand up, speak out, stay bold.\"</p><p>Within days, the response went viral with millions of likes on X – and Robinson said the local response \"has been phenomenal.\"</p><p>\"I think it's got 58,000 local comments. … People from outlying areas [are] saying they're going to drive to my store just to eat lunch, eat dinner, just to pay respect for what I've done for Charlie,\" he said.</p><p>Robinson's location wasn't the only Steak 'n Shake spot that received an outpouring of customers after the billboard went viral.</p><p>After Rep. Marjorie Taylor Greene, R-Ga., who represents Rome, shared an image of the billboard on social media, people across the country said they'd patronize the chain.</p><p>\"Eating at Steak ‘n Shake because they put up a Charlie Kirk billboard,\" one person wrote on X. \"This is the second time this week, all because I saw they put up a billboard in Charlie’s honor.\"</p><p>\"They should be rewarded for this with our business,\" another said.</p><p>Robinson said his store received calls across the country, from Michigan to Wisconsin to California, just to say thank you.</p><p>\"They took the time to physically find us, find our phone number at the store and call to say thank you for doing that,\" he said.</p><p>Robinson said Steak ‘n Shake’s corporate office contacted him shortly after the billboard went viral.</p><p>\"They said, 'You know, you're supposed to get everything OK'd through corporate when you use the name Steak 'n Shake on it, but we really like it,'\" Robinson recalled.</p><p>\"It reached [the Steak 'n Shake owner] and he liked it so much he asked if they could have permission … to do this across the nation.\"</p><p>Steak 'n Shake did not immediately respond to Fox News Digital's request for comment.</p><p>Although Robinson is still saddened by Kirk's death, he said he believes the 31-year-old's legacy is \"reaching a lot of people and changing a lot of minds.\"</p><p>\"He has started a revival across the country that has been so needed,\" Robinson said.</p><p>\"I don't think he would have ever thought, in his wildest dreams, the response that would have taken place after he was assassinated,\" he added. \"But the movement is great … and I just appreciate all that he did.\"</p><p>Robinson's billboard is one of many tributes to Kirk that have emerged in the past two weeks.</p><p>Grooveberries Frozen Yogurt in Coeur d'Alene, Idaho, received backlash after honoring Kirk through stickers on its frozen yogurt cups.</p><p>Last week, a group of Kirk supporters petitioned Starbucks to honor him by adding his signature tea order to menus nationwide.</p></body></div></body></html>"
    },
    {
      "title": "Vice President JD Vance calls out 'left-wing radicals' for inciting political violence in social media post",
      "link": "https://www.foxnews.com/politics/vice-president-jd-vance-calls-left-wing-radicals-inciting-political-violence-social-media-post",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-26T22:02:39-04:00",
      "description": "JD Vance addressed political violence rhetoric following criticism over Trump supporters&apos; response to the Dylan Mulvaney Bud Light controversy from 2023.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>Vice President JD Vance fired back on social media on Friday after being tagged in a video that appeared to mock Trump supporters over their response to the 2023 Bud Light controversy.</p><p>The clip, which was posted to X, showed a man shooting Bud Light cans seemingly in protest of the brand's 2023 partnership with transgender influencer Dylan Mulvaney. </p><p>The user then took aim at Vance, telling him not to complain about \"violent rhetoric from the left.\"</p><p>\"This is how MAGA responded after Bud Lite had the audacity to feature a trans influencer in their ads,\" the X user said. \"So spare us your b------- about violent rhetoric from the left, [JD Vance].\"</p><p>Vance replied to the post, writing, \"I call upon all of our supporters to stop the violence against innocent beer cans. And I call upon all left-wing radicals to stop inciting violence against innocent people.\"</p><p>Earlier in the week, Vance said those who denigrate law enforcement are encouraging \"crazy people to go and commit violence\" after a shooter opened fire at an Immigration and Customs Enforcement (ICE) facility Wednesday in Dallas. </p><p>\"You don't have to agree with my immigration policies. You don't have to agree with Donald Trump's immigration policies. But if your political rhetoric encourages violence against our law enforcement, you can go straight to hell,\" Vance said Wednesday during a trip to North Carolina. \"And you have no place in the political conversation of the United States of America.</p><p>\"If you want to stop political violence, stop attacking our law enforcement as the Gestapo. If you want to stop political violence, stop telling your supporters that everybody who disagrees with you is a Nazi. If you want to stop political violence, look in the mirror. That's the way that we stop political violence in this country.\" </p><p>Vance has also blamed the death of Charlie Kirk, who was assassinated at Utah Valley University earlier this month, on \"left-wing political radicalization.\"</p><p>\"They tried to silence our dear friend Charlie Kirk,\" JD Vance said at Kirk's memorial. \"And, tonight, we speak with Charlie and for Charlie, louder than ever.\"</p><p>The Bud Light controversy in 2023 sparked massive backlash against both transgender activist Dylan Mulvaney and the beer brand. Mulvaney came under fire after posting a video in April 2023 revealing the beer company sent packs of Bud Light with the influencer’s face as part of a new ad campaign and to celebrate Mulvaney’s full year of transitioning to \"girlhood.\"</p></body></div></body></html>"
    },
    {
      "title": "Dolphins' Tua Tagovailoa issues sharp response to Cam Newton's scathing assessment",
      "link": "https://www.foxnews.com/sports/dolphins-tua-tagovailoa-issues-sharp-response-cam-newtons-scathing-assessment",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-26T21:49:54-04:00",
      "description": "Miami Dolphins quarterback Tua Tagovailoa conceded his play is below expectations, but he pushed back on criticism sparked by Cam Newton&apos;s recent comments.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>The Miami Dolphins had a disappointing end to the 2024 season. After falling short of the playoffs, the Dolphins' woes have continued into the early portion of the 2025 campaign.</p><p>Miami's 0-3 start this season has further placed quarterback Tua Tagovailoa's performance under the microscope. Former NFL QB-turned media personality Cam Newton is among those who have criticized Tagovailoa.</p><p>During one of last week's episodes of ESPN's \"First Take,\" Newton cited Tagovailoa's four-year, $212.1 million contract extension during his critique of the Pro Bowl signal-caller's performance.</p><p>\"Tagovailoa is making more than Patrick Mahomes, Justin Herbert, Lamar Jackson, Jalen Hurts, Baker Mayfield, Matthew Stafford, Jayden Daniels. Am I pocket watching? No, I'm putting things into perspective here,\" Newton, the 2015 NFL MVP, said last week.</p><p>\"In this case, it should be more money, more expectations. When I see Tua Tagovailoa over this year alone, I've heard him more than I ever had. That's not to say you can't talk. I like quiet Tua. Alabama Tua. Chip on your shoulder Tua. Not 'Is somebody going to come in and watch film.'</p><p>\"What you're being paid, what you're asked to do, what you have the capability of, from one quarterback to another, I look at the situation like ‘Come on, dawg.’ Especially when you've got a Ferrari and a Lamborghini and other amenities that other quarterbacks wish they had.\"</p><p>Newton's comments were later brought to the attention of Tagovailoa's, who suggested he contends with much more challenging circumstances than pundits may give credence to.</p><p>\"Well, anybody can play quarterback in this league then. I want to see anybody on the streets come and play quarterback,\" Tagovailoa said. \"Cam is doing his thing for sure, but I think it's easier to be able to hold a clicker and talk about it that way or talk about what someone else is doing wrong when you're not going out and having to do the same as them.</p><p>\"I think it's easy to do that. I think anybody can do that. I don't think anybody can play quarterback.\"</p><p>Tagovailoa also acknowledged his performance level has fallen well short of the standard he holds himself to.</p><p>Through three games this season, Tagovailoa has thrown five touchdowns and four interceptions. His quarterback rating ranks among the bottom of the NFL.</p><p>While Dolphins coach Mike McDaniel is aware there is always room for improvement, he applauded Tagovailoa for his mental toughness during the team's on-field struggles.</p><p>\"The game of a franchise quarterback is never just still. … There's opportunities that he needs to take advantage of,\" McDaniel said. \"There's also a ton of opportunities to turn the ball over that he hasn't taken. He's really answered the bell for 99% of the time. ... It's not an easy task to be in his shoes, but I'm very happy with where his mind is at and where his focus is at because if he was a weaker-minded individual, it's tough for any quarterback during any losing streak or any whatever.</p><p>\"He's focused on being 1-0 against the New York Jets, and that's why I know he's capable. And I'm excited to see his next opportunity that we work on all week because of just that, of being focused on the right things.\"</p><p>Tagovailoa has had some notable achievements since being drafted 10th overall in 2020. He was the NFL's passing leader in 2023.</p><p>The Dolphins host the winless New York Jets on Sunday.</p><p></p></body></div></body></html>"
    },
    {
      "title": "Three women indicted for allegedly livestreaming chase of ICE agent to his home and posting address online",
      "link": "https://www.foxnews.com/us/three-women-indicted-allegedly-livestreaming-chase-ice-agent-home-posting-address-online",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-26T21:27:52-04:00",
      "description": "Cynthia Raygoza, Ashleigh Brown and Sandra Carmona Samane have been indicted for publicly disclosing federal agent information after an alleged doxxing incident.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>A federal grand jury has indicted three women for allegedly following a U.S. Immigration and Customs Enforcement (ICE) agent from his workplace, livestreaming the pursuit on social media and then posting his home address online.</p><p>The indictment charges the trio — Cynthia Raygoza, 37, of Riverside, California; Ashleigh Brown, 38, of Aurora, Colorado; and Sandra Carmona Samane, 25, of Panorama City, California — with one count of conspiracy and one count of publicly disclosing the personal information of a federal agent, according to an announcement Friday from the U.S. Attorney's Office for the Central District of California.</p><p>\"Our brave federal agents put their lives on the line every day to keep our nation safe,\" Acting U.S. Attorney in California Bill Essayli said in a statement. \"The conduct of these defendants is deeply offensive to law enforcement officers and their families. If you threaten, dox or harm in any manner one of our agents or employees, you will face prosecution and prison time.\"</p><p>On August 28, the women allegedly followed the ICE agent from the Civic Center in downtown Los Angeles to his house, livestreaming the chase live on Instagram accounts identified as \"ice_out_of_la,\" \"defendmesoamericanculture,\" and \"corn_maiden_design,\" according to the indictment.</p><p>Prosecutors allege the defendants gave directions as they followed the agent and urged viewers to share the feed. Once outside his home, they shouted to neighbors that their \"neighbor is ICE,\" \"la migra lives here\" and \"ICE lives on your street, and you should know,\" as noted in the indictment.</p><p>The three women then allegedly posted the agent’s address online with the message, \"Come on down.\"</p><p>Brown and Samane were arrested. Brown, who also faces separate charges of assaulting a federal officer, remains in custody without bond, while Samane was released on $5,000 bond. Their arraignments are slated for Sept. 30 and Oct. 9, respectively.</p><p>Raygoza remains at large, according to the indictment.</p><p>If convicted, each woman faces up to five years in federal prison per count.</p><p>The announcement comes as one ICE detainee was killed and two others were injured Wednesday when a gunman opened fire on an agency facility in Dallas. In July, the Department of Homeland Security said attacks on ICE agents had skyrocketed by 830% since January.</p></body></div></body></html>"
    },
    {
      "title": "UN Security Council rejects China-Russia resolution extending Iran nuclear sanctions relief before deadline",
      "link": "https://www.foxnews.com/world/un-security-council-rejects-china-russia-resolution-extend-iran-nuclear-sanctions-relief-before-deadline",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-26T21:22:49-04:00",
      "description": "Iran sanctions relief extension under nuclear deal fails at U.N. with 4-9 vote, as European nations and U.S. oppose China-Russia backed resolution.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>The United Nations on Friday failed to adopt a resolution brought by China and Russia that would have extended sanctions relief for Iran for another six months under the nuclear deal.</p><p>The vote was 4 to 9, with Algeria, China, Pakistan and Russia in favor and Denmark, France, Greece, Panama, Sierra Leone, Slovenia, Somalia, the United Kingdom and the United States against.</p><p>Guyana and South Korea abstained.</p><p>The vote came after Britain, France and Germany triggered the deal’s \"snapback\" measure, which reinstates sanctions on Iran following stalled talks on its nuclear program.</p><p>The sanctions, which will go into effect unless there’s a last-minute deal Friday, will include freezing Iranian assets abroad, halting arms deals with Tehran and penalizing any development of Iran’s ballistic missile program. </p><p>\"We had hoped that European colleagues and the U.S. would think twice, and they would opt for the path of diplomacy and dialogue instead of their clumsy blackmail, which merely results in escalation of the situation in the region,\" Dmitry Polyanskiy, deputy Russian ambassador to the U.N., said during the meeting.</p><p>Iran’s foreign minister, Abbas Araghchi, had also been meeting with his French, German and British counterparts in the lead-up to the U.N. vote. </p><p>A European diplomat told The Associated Press the meeting \"did not produce any new developments, any new results.\"</p><p>On Tuesday, Ayatollah Ali Khamenei, Iran’s supreme leader, also said Iran would not \"surrender to pressure\" and that negotiations with the U.S. would be a \"dead end.\" </p><p>In an interview on Friday, Iranian President Masoud Pezeshkian called the decision \"unfair, unjust and illegal.\"</p><p><i>The Associated Press contributed to this report. </i></p></body></div></body></html>"
    },
    {
      "title": "Trump administration official physically assaulted at UNGA by 'deranged leftist,' White House says",
      "link": "https://www.foxnews.com/politics/trump-administration-official-physically-assaulted-unga-deranged-leftist-white-house-says",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-26T21:01:10-04:00",
      "description": "EXCLUSIVE: A Trump administration official was physically assaulted by a “deranged leftist&quot; inside the United Nations Thursday afternoon during the gathering of the UN General Assembly, Fox News Digital has learned.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>A Trump administration official was physically assaulted by a \"deranged leftist\" inside the United Nations Thursday afternoon during the gathering of the UN General Assembly, Fox News Digital has learned.</p><p>An official working in international relations for the Department of Health and Human Services was in New York City serving in a support role for HHS Secretary Robert F. Kennedy Jr. and the department’s leadership team at UNGA.</p><p>\"An HHS official was followed into a bathroom, recorded, physically assaulted and verbally accosted by a deranged leftist at the UN who somehow entered the venue past multiple layers of security,\" White House Deputy Press Secretary Anna Kelly told Fox News Digital. \"Thankfully, the official is safe, and the lunatic was arrested, but this is part of a disturbing and dangerous set of failures by the UN after their sabotage of President Trump ahead of and during his speech.\"</p><p>Kelly told Fox News Digital that the U.S. Secret Service will investigate \"how this violent protester was admitted into a major national security event.\"</p><p>A source familiar told Fox News Digital that the individual has been charged with assault, aggravated harassment, attempted assault and criminal possession of a weapon. The individual was released from custody at 7:30 p.m. Friday night, the source said. The individual is expected in court next on Nov. 13. </p><p>\"The UN must answer why these highly concerning incidents continue to happen against the president and his staff,\" Kelly said.</p><p>\"We are outraged that a member of the U.S. delegation was physically assaulted inside of UN Headquarters the afternoon of September 25,\" a U.S. UN spokesperson told Fox News Digital. \"This attack must be addressed swiftly, and consequences must be felt.\"</p><p>The spokesperson told Fox News Digital that \"the UN itself recognizes that it has lost its way.\"</p><p>\"Now, it has devolved into an arena where an American delegation member is harassed and assaulted,\" the spokesperson said. \"If you can’t keep people safe in your own building, how can you claim to be the world’s diplomatic center?\"</p><p>The spokesperson called the incident \"unacceptable,\" and told Fox News Digital that the United Nations \"will use every available resource to support the U.S. Secret Service into their investigation of this incident.\"</p><p>\"We know the UN needs dramatic reform and now must also immediately implement a thorough review of the UN’s security operations,\" the spokesperson said. \"The UN’s failures are evident worldwide, and now in its own halls.\"</p><p>The U.S. UN spokesperson added: \"Enough is enough.\"</p><p>The official recounted her experience of being followed, harassed, and physically assaulted inside the United Nations in an exclusive interview with Fox News Digital.</p><p>The official told Fox News Digital that she was walking down the hallway at the UN when a woman began berating her and shining a bright light in her face.</p><p>\"It was very disorienting,\" the official said. \"Once I took a step back and regained my footing, it didn’t stop. I realized what was happening. I realized I was being yelled at and that the light was also a recording device.\"</p><p>The official tried to get away from the woman who was screaming derogatory and pro-Palestinian comments at her as she followed closely behind.</p><p>The official said the woman called her a \"fascist\" and a \"Nazi.\" </p><p>\"The insults changed to specific insults,\" the official said, telling Fox News Digital that she went into the women’s bathroom to get away, but that the woman kept following her.</p><p>\"Her yelling turned into screaming—hyper-aggressive insults,\" the official said. </p><p>The official tried to hide in a bathroom stall, but told Fox News Digital that the woman was pushing and trying to get into the stall. Once the official was able to close the door, the woman put the camera over the door of the bathroom stall to continue filming the official and screaming. </p><p>The official waited for the screaming to stop, and exited the stall, hoping the woman had left, but the woman was waiting for her at the door, and continued to follow her into the hallway, continuing to yell at her and shine the light in her face. Eventually, the official was able to get away.</p><p>The official told Fox News Digital the incident lasted approximately 10 minutes.</p><p>\"It felt very political in nature,\" she said. \"Secretary Kennedy gets a tremendous number of bows and arrows and threats that he deals with, but it seems that it’s not enough, and it is trickling down.\"</p><p>She added: \"That’s a scary thing for the team. But we’re more empowered, and we have amazing leadership.\"</p><p>Fox News Digital has learned that the woman was arrested by the New York City Police Department. It is unclear whether she is still in custody.</p><p>The NYPD did not immediately respond to Fox News Digital's request for comment. </p><p>The United Nations did not respond to Fox News Digital's request for comment. </p></body></div></body></html>"
    },
    {
      "title": "Major pro-life group demands investigation into abortion pill billboards in Florida",
      "link": "https://www.foxnews.com/politics/major-pro-life-group-demands-investigation-abortion-pill-billboards-florida",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-26T20:30:00-04:00",
      "description": "Florida&apos;s top prosecutor is urged to probe New York nonprofit Mayday Health for billboard ads promoting mifepristone and misoprostol abortion pills across the state.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>: A major pro-life organization is calling on Florida Attorney General James Uthmeier to investigate a nonprofit it accuses of running \"deceptive and misleading\" abortion pill ads across the state.</p><p>In a Sept. 19 letter obtained by Fox News Digital, 40 Days for Life urged Uthmeier to take action against Mayday Health, a New York-based nonprofit that has placed billboards around Florida promoting the abortion pills mifepristone and misoprostol.</p><p>\"Those pictures are not [artificial intelligence],\" Shawn Carney, president and CEO of 40 Days For Life, told Fox News Digital on Friday. \"Those are actual pictures of boats floating in front of tourists — trying to get a tan, trying to enjoy their time off of work — and yet they're having abortion pills shoved in their face. It's out of touch, and it could be illegal.\"</p><p>The pro-life group argues the ads fail to disclose critical information, including the U.S. Food and Drug Administration (FDA) black box warnings about risks like hemorrhage and infection, while also omitting federally required safety protocols and potential legal consequences for Floridians.</p><p>\"It shows once again how out of touch abortion advocates are in a post-Roe America where they have no sense of mission,\" Carney said. \"They cannot read the room at all, and now they can’t read the law.\"</p><p>Carney and other members of 40 Days for Life have called on Florida’s top prosecutor to launch an investigation and possibly pursue prosecution. </p><p>\"I think that they need to be investigated and possibly prosecuted because this definitely seems like a violation of Florida's deceptive advertising law,\" Carney told Fox News Digital.</p><p>Florida bans most abortions after six weeks, making it one of the strictest states in the nation. Carney said the grassroots structure of 40 Days for Life — which has more than 1 million participants across 1,800 cities globally — allows the group to spot local problems first.</p><p>\"When things like this happen at the local level, we're the first to see it,\" Carney said. \"So, when we see these new ad campaigns for abortion pills or whether we see doctors doing illegal abortions, we're going to look into it and report it and take legal action.\"</p><p>Carney also argued that the overturning of Roe v. Wade has forced abortion advocates to defend positions he described as extreme. </p><p>\"Gen Z has turned against abortion because they're the first generation in our country to ever have a photo of their own ultrasound,\" he said. \"And that's why they are the most pro-life generation ever at their age.\"</p><p>Florida Attorney General James Uthmeier and Mayday Health did not immediately respond to Fox News Digital's request for comment.</p></body></div></body></html>"
    },
    {
      "title": "Team USA stops early bleeding at Ryder Cup, but face danger against Europe",
      "link": "https://www.foxnews.com/sports/team-usa-stops-early-bleeding-ryder-cup-face-danger-against-europe",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-26T20:00:44-04:00",
      "description": "With standout performances from Tommy Fleetwood and Jon Rahm, Team Europe surged to a commanding 5.5-2.5 advantage against Team USA on day one of the Ryder Cup at Bethpage Black.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>Everybody has a plan until they get punched in the face, and that's exactly what happened to Team USA Friday morning at Bethpage Black.</p><p>For the first time in Ryder Cup history, Team Europe won each of the first three matches on American soil to take an early 3-0 lead (Europe needs 14 points to retain the Cup).</p><p>The final five matches of the day were knotted at 2.5-2.5, but Europe is right where they want to be.</p><p></p><p>After the first three matches of the day didn't even reach the 16th hole, Patrick Cantlay and Xander Schauffele were able to birdie 18 to salvage the morning and grab a point.</p><p>The afternoon session looked like it was going USA's way, but Tommy Fleetwood is cementing himself as a Ryder Cup legend. Down a hole, Fleetwood birdied 14 and then gave himself and Justin Rose a 1-up lead with another birdie on 16. Rose's birdie on 18 clinched Europe's fifth point, shortly after yet another dominant victory over Jon Rahm.</p><p>Hometown kid Cameron Young and Justin Thomas, who lost alongside Bryson DeChambeau in the morning, took a dominant 6 &amp; 5 win over Ludvig Aberg and Rasmus Hojgaard. Cantlay and Sam Burns came back from down two to halve the final match of the day.</p><p>Rahm and Fleetwood combined to go 4-0-0 on Friday. Yes, that's the same Fleetwood who never even won a PGA Tour event until a month ago yet is now 9-3-2 in his Ryder Cup career. But Team Europe captain Luke Donald praised the Brit for being a \"world-class\" golfer.</p><p>\"It took him a little time and had to go through a few opportunities that let slip for sure, but I think that, you know, for Tommy, he reframes it in such a positive way. I think that if you see it in a positive way, the ones that get away, it only makes you stronger\" Donald said after Friday's play.</p><p>\"I think Tommy, he's a guy that just loves being around the team. He loves contributing to that team. Yeah, he's a nice player to play with. I think he's at the top of the list of a lot of guys on the team that people want to play with.\"</p><p>Simultaneously, Scottie Scheffler and DeChambeau combined to go 0-4-0, with Scheffler, the world No. 1, never even making it to the 17th hole.</p><p>USA now needs to mount a comeback if it wants to avoid being the first team to lose on home soil since it did so in 2012. No one has won back to back Ryder Cups since Europe won three straight from 2010 to 2014.</p><p>Day 2 will tee off at 7:10 a.m. ET to begin another 11-plus hours of golf.</p><p></p></body></div></body></html>"
    },
    {
      "title": "Springsteen says Dems too far-left for America, but Trump still belongs in 'trash heap of history'",
      "link": "https://www.foxnews.com/media/springsteen-says-dems-too-far-left-america-trump-still-belongs-trash-heap-history",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-26T20:00:37-04:00",
      "description": "Bruce Springsteen criticized the Democratic Party for alienating Americans with far-left policies while maintaining that President Trump belongs in the &quot;trash heap of history.&quot;",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>Rock star Bruce Springsteen warned that the Democratic Party has alienated Americans with its far-left policies, even as he remains a staunch critic of President Trump.</p><p>Springsteen, who remains an all-American icon known for anthems like \"Born to Run,\" \"Thunder Road\" and \"Born in the U.S.A.,\" has not been shy about sharing his political views over the past few decades. The rocker campaigned for then-Vice President Kamala Harris in 2024, then-candidate Joe Biden in 2020, former Secretary of State Hillary Clinton in 2016 and President Barack Obama in 2012 and 2008.</p><p>In an interview with Time Magazine, Springsteen revealed that he is one of many left-leaning figures who believe the Democratic Party has lost touch with everyday Americans.</p><p>\"We’re desperately in need of an effective alternative party or for the Democratic Party to find someone who can speak to the majority of the nation. There is a problem with the language that they’re using and the way they’re trying to reach people,\" he said.</p><p>Time magazine noted the irony in that left-leaning Springsteen appeals to working-class fans while being wealthy, particularly as many of his core audience have \"flocked to Trump.\"</p><p>\"A lot of people bought into his lies,\" the rocker lamented to Time Magazine. \"He doesn’t care about the forgotten anybody but himself and the multibillionaires who stood behind him on Inauguration Day.</p><p>\"You have to face the fact that a good number of Americans are simply comfortable with his politics of power and dominance.</p><p>\"He’s the living personification of what the 25th Amendment and impeachment were for. If Congress had any guts, he’d be consigned to the trash heap of history,\" he concluded.</p><p>In 2020, Springsteen’s 2002 hit \"The Rising\" became something of an anthem for the Biden campaign during the Democratic National Convention that year, to the point an Esquire article warned about the risk of its potential parallels with Clinton’s campaign using a \"Glee\" version of Rachel Platten's \"Fight Song.\"</p><p>Fox News Digital reached out to the White House for comment on Springsteen’s remarks and has not received an immediate response.</p></body></div></body></html>"
    },
    {
      "title": "Pro golfer Jake Knapp mourns death of girlfriend Makena White, remembered as 'one of a kind'",
      "link": "https://www.foxnews.com/sports/pro-golfer-jake-knapp-mourns-death-girlfriend-makena-white-remembered-one-kind",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-26T19:32:53-04:00",
      "description": "Pro golfer Jake Knapp was left devastated after learning his girlfriend Makena White died. Loved ones recalled her big heart and encouraged donations in her memory.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>Makena White, the girlfriend of PGA Tour golfer Jake Knapp, has died, her loved ones confirmed. She was 28.</p><p>\"Hi everyone - this is Makena’s friend, writing with the heaviest heart to share that Makena passed away earlier this week,\" a social media post read. \"She is already so deeply missed by her Dad, her family, her friends, and of course by Nelly and Fergie.\" </p><p>The names Nelly and Fergie refer to White's beloved dogs.</p><p>The post also highlighted White's remarkable ability to make a lasting impact on others.</p><p>\"Makena was one of a kind. She had this rare way of making you feel special, and her huge heart was always overflowing with love. To be loved by Makena was a gift; one that came with endless laughter, so much joy, and a healthy sprinkling of chaos as we tried to keep up with her travel schedule.\"</p><p>The announcement also encouraged support for the Bruyère Brain Health &amp; Memory Clinic or the Griffin Bell Endowment Fund.  </p><p>\"If you would like to honour Makena’s memory, donations to the Bruyère Brain Health &amp; Memory Clinic or the Griffin Bell Endowment Fund would mean a lot.\"</p><p>White's mother, Crystal, began visiting the clinic in 2018, after she was diagnosed with Alzheimer's disease. In a 2022 social media post, White announced her mother's death.</p><p>Additional details surrounding White's cause of death were not released.</p><p>Fox News Digital requested comment from Knapp's representatives but did not immediately receive a response. </p><p>Knapp is not part of the U.S. team for the Ryder Cup in New York. Last month's FedEx St. Jude Championship marked the most recent time Knapp competed in a pro golf event.</p><p>On Knapp's birthday in May, White described the golfer as her \"very best friend.\"</p><p>White attended the 2024 Masters Tournament at Augusta National Golf Club, where Knapp tied for 55th place.</p><p></p></body></div></body></html>"
    },
    {
      "title": "Trump vows to order declassification of all Amelia Earhart files after nearly 90-year aviation mystery",
      "link": "https://www.foxnews.com/politics/trump-order-declassification-all-amelia-earhart-files-after-nearly-90-year-aviation-mystery",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-26T19:31:41-04:00",
      "description": "President Trump vowed to order the release of classified documents about Amelia Earhart&apos;s final flight and disappearance over the Pacific Ocean nearly 90 years ago.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>President Donald Trump on Friday said he will declassify files related to Amelia Earhart, the aviation trailblazer who became the first woman to fly solo nonstop across the U.S. and who famously disappeared nearly 90 years ago.</p><p>In a Truth Social post, Trump said he’s been asked about Earhart and her final flight.</p><p>\"Amelia made it almost three-quarters of the way around the world before she suddenly, and without notice, vanished—never to be seen again,\" he wrote. \"Her disappearance, almost 90 years ago, has captivated millions. I am ordering my Administration to declassify and release all government records related to Amelia Earhart, her final trip, and everything else about her.\"</p><p>Researchers have long searched for answers about Earhart's 1937 disappearance over the Pacific Ocean during her fateful attempt to fly around the globe. The disappearance has been the subject of many conspiracy theories.</p><p>In his post, Trump called her an \"aviation pioneer, the first woman to fly solo across the Atlantic Ocean, and [someone who] achieved many other aviation ‘firsts'.\"</p><p>In July, Kimberlyn King-Hinds, the Commonwealth of the Northern Mariana Islands’ delegate to the House of Representatives, wrote to Trump asking him to declassify documents related to Earhart.</p><p>\"In pursuing clarity for my constituents, I have become aware that the U.S. government may still hold documents or records related to Earhart’s journey and final whereabouts that have not yet been made public,\" King-Hinds wrote. \"Should such records exist, their release would contribute meaningfully to our understanding of one of America’s most revered aviators and could finally shed light on the final chapter of her remarkable life.</p><p>\"A national icon, Amelia Earhart embodied America’s courage, determination, and pioneering spirit,\" she added. \"Yet the mystery surrounding her final flight continues to generate debate and speculation nearly ninety years later.\"</p><p>Since taking office, Trump has declassified documents related to the assassinations of former President John F. Kennedy, his brother Robert F. Kennedy and Martin Luther King Jr.</p></body></div></body></html>"
    },
    {
      "title": "Georgetown College GOP member demands 'full investigation' of leftist club's flyers referencing Kirk death",
      "link": "https://www.foxnews.com/media/georgetown-college-gop-member-demands-full-investigation-leftist-clubs-flyers-referencing-kirk-death",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-26T19:20:58-04:00",
      "description": "Georgetown student Knox Graham condemned flyers posted on campus celebrating Charlie Kirk&apos;s death, calling them &quot;antithetical&quot; to the Catholic university&apos;s mission.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>A member of the Georgetown College Republicans board demanded a \"full investigation\" of a leftist gun club after its recruitment flyers referenced Turning Point USA founder Charlie Kirk's assassination. </p><p>I think that everybody in the Georgetown community shares how much horror and dissentiment that we have over the fact that these flyers were there in the first place,\" Knox Graham told \"America Reports\" on Thursday.</p><p>Fox News Digital obtained photos Wednesday of red flyers posted on campus that read \"Hey fascist! Catch!\" from the John Brown Gun Club, a group tied to leftist activism and past violence, before they were removed. The club is not affiliated with Georgetown, according to the university's CampusGroups club database.</p><p>The same phrase was reportedly written on a shell casing belonging to Tyler Robinson, Kirk's suspected assassin, who was charged with one count of aggravated murder. On Sept. 10, Robinson allegedly shot Kirk in the neck while the conservative activist spoke at Utah Valley University.</p><p>A second wave of posters taped up Thursday night in the school’s main free speech zone mocked Kirk’s assassination. One showed Kirk’s face with his eyes blacked out alongside the words \"Follow your leader\" and \"Rest in p---, Charlie.\"</p><p>Georgetown University removed both posters and reported both incidents to the FBI, according to its statement Thursday. </p><p>The first wave of advertisements touted being the \"only political group that celebrates when Nazis die.\" </p><p>Its QR code linked to a page that said, \"We're building a community that's done with ceremonial resistance and strongly worded letters. If you want to make a real change in your community, let us know below.\"</p><p>Graham recounted seeing \"a handful\" of flyers on campus.</p><p>I first heard about these flyers when I was sitting in a classroom, and, immediately after my class ended, I rushed out to go ahead and see if they were there for myself,\" Graham said. \"I think by the time that I got there, the university had taken most of them down.\"</p><p>The College Republicans member described the \"darker\" message he thinks the flyers send.</p><p>Well, the effort that the poster implies, I think, is to bring out some of the darker sentiments that we've seen on the internet in the aftermath of Mr. Kirk's assassination — to bring those out into the real world,\" Graham said. </p><p>However, he added he doesn’t believe there are \"absolutely any\" at Georgetown who share the flyer’s sentiments, calling them \"entirely antithetical\" to the Catholic and Jesuit university’s mission.</p><p>I think that that is something that all people share, the kind of disdain at the idea that somebody would be shot for exercising their free speech,\" Graham said. </p><p>The university similarly condemned the flyers in a statement.</p><p>\"We do not tolerate calls for violence or threats to the university community,\" the statement read Thursday. </p></body></div></body></html>"
    },
    {
      "title": "Massive cheating scandal involving Democratic governor candidate also involved husband: report",
      "link": "https://www.foxnews.com/politics/massive-cheating-scandal-involving-democratic-governor-candidate-also-involved-husband-report",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-26T19:12:18-04:00",
      "description": "A cheating scandal that rocked the U.S. Naval Academy in 1994 and involved New Jersey Democratic gubernatorial candidate Mikie Sherrill also involved her husband, according to reports.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>A massive cheating scandal that rocked the U.S. Naval Academy in 1994 and involved New Jersey Democratic gubernatorial candidate Rep. Mikie Sherrill also involved her husband, Jason Hedberg, according to reporting by the New York Post.</p><p>This follows the improper release of bombshell private military records by the National Archives and Records Administration, which revealed that Sherrill was not allowed to walk with her graduating class at the Naval Academy and that her name was not included in the commencement program due to her involvement in the scandal.</p><p>Sherrill, a congresswoman representing New Jersey, has not been accused of cheating at the Naval Academy but rather of failing to report those who had cheated on an exam.</p><p>The Post reported that Hedberg was also caught up in the scandal. The outlet said Hedberg was one of nearly 50 midshipmen who sued the Naval Academy, the Navy and the Pentagon to block an honor board at the school from deciding whether they should be dismissed.</p><p>The suit alleged that each named plaintiff was denied due process by the academy and ordered by their superiors to make incriminating statements, according to the outlet.</p><p>The complaint stated that \"in compliance with the orders of their superior military officers, each named plaintiff was compelled to make inculpatory statements to Navy Inspector General investigators.\"</p><p>While Sherrill did not walk in her commencement ceremony, Hedberg's name is included in the 1994 commencement program, indicating he was cleared to take part in the ceremony, which took place three months after the suit was filed.</p><p>Sherrill is locked in a tight race against Republican Jack Ciattarelli to replace term-limited Democratic Gov. Phil Murphy.</p><p>Sean Higgins, a spokesperson for Sherrill's campaign, responded to the development by telling Fox News Digital that \"the fact Jack Ciattarelli and MAGA Republicans are going after Mikie’s family is sick and desperate.</p><p>\"Jason graduated, served honorably as a Naval Officer and the illegal disclosure of Mikie’s unredacted personal military records, including her Social Security number and the unlawful dissemination of those records by the Ciattarelli campaign is a disgrace and must be investigated.\" </p><p>While investigating Sherrill's suspected involvement in the 1994 cheating scandal, Ciattarelli's campaign also submitted its ownFOIA request, which confirmed her name was not on the U.S. Naval Academy graduation program that year. </p><p>The revelations have rocked the already tight race in blue-leaning New Jersey.</p><p>The Ciattarelli campaign said Nicholas De Gregorio, a friend who is not directly involved in the campaign, \"submitted a lawful FOIA request\" aboutSherrill's military backgroundof his own accord. </p><p>A spokesperson for the National Archives and Records Administration stated that the technician who responded to De Gregorio's request about Sherrill's military record \"should NOT have released the entire record,\" which included private information such as her Social Security number.</p><p>The National Archives apologized for the breach of privacy and has committed to holding its staff accountable for the blunder. </p><p>In response, Sherrill has accused Ciattarelli of illegally obtaining the records.</p><p>\"To have a guy I'm running against, it will stop at nothing, it will stop at nothing, who will illegally obtain records. It's just beyond the pale,\" Sherrill charged Thursday night on the campaign trail in Plainfield, New Jersey.</p><p>\"I didn’t turn in some of my classmates, so I didn’t walk but graduated and was commissioned as an officer in the U.S. Navy, serving for nearly ten years with the highest level of distinction and honor,\" Sherrill told the Globe when confronted with the commencement program. She defended not releasing any disciplinary records from her time at the academy. </p><p>Sherrill has also accused the Trump administration of colluding with Ciattarelli’s campaign.</p><p>\"This is an illegal and dangerous weaponization of the federal government,\" Sherrill said in a statement Thursday as she criticized Ciattarelli and the Trump administration for \"breaking the law and exposing private records for political gain.\"</p><p>On Thursday, Higgins accused the Trump administration of \"targeting political opponents with an absolute disregard for the law, this time in concert with the Ciattarelli campaign.\"</p><p>For his part, Ciattarelli is calling on Sherrill to release her records to prove why she was blocked from attending her graduation ceremony.</p><p>In a letter sent to Sherrill's lawyers, a lawyer representing the Ciattarelli campaign said that any claim that Ciattarelli for Governor (CFG) was \"part of a conspiracy to smear [Sherrill] with ill-gotten documents is completely false. In fact, it is defamatory and if [Sherrill] and her campaign continue to push this false narrative and allege that CFG and/or [campaign strategist Chris] Russell acted illegally, we will pursue defamation claims.\"</p><p>Sherrill's campaign did not immediately provide a response to Fox News Digital's request for comment on her husband’s involvement in the scandal.</p></body></div></body></html>"
    },
    {
      "title": "Supreme Court extends Trump administration's $5 billion foreign aid freeze amid ongoing legal challenge",
      "link": "https://www.foxnews.com/politics/supreme-court-extends-trump-administrations-5-billion-foreign-aid-freeze-amid-ongoing-legal-challenge",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-26T18:54:12-04:00",
      "description": "The Supreme Court extended an order blocking $5 billion in congressionally appropriated foreign funds after the Trump administration appealed a district court ruling.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>The U.S. Supreme Court on Friday extended an earlier order that allows the Trump administration to continue blocking nearly $5 billion in congressionally appropriated foreign funds. </p><p>The U.S. Department of Justice had reached out to the high court for an emergency appeal after a district court judge ruled the administration’s decision to hold the aid was likely illegal, adding that Congress would need to approve the withholding of funds. </p><p>\"This case raises questions of immense legal and practical importance, including whether there is any avenue to test the executive branch’s decision not to spend congressionally appropriated funds,\" District Judge Amir Ali said at the time. </p><p>Friday's ruling was 6 to 3, with the three liberal justices dissenting. </p><p>President Donald Trump last month sent a letter to House Speaker Mike Johnson, explaining he was using a pocket rescission, which allows a president to submit a request to Congress to hold approved funds near the end of the fiscal year. </p><p>Under federal law, Congress has to approve the rescission within 45 days or the money must be spent. But the budget year will end before the 45-day window closes, and, in this situation, the White House is asserting that congressional inaction allows it not to spend the money.</p><p>It was the first use of a pocket rescission in 50 years. </p><p>Friday’s ruling extends a temporary block put on the lower court ruling by Chief Justice John Roberts on Sept. 9. </p><p>The conservative justices in the majority Friday said that Trump’s authority on foreign policy weighed in the decision but cautioned that it wasn’t a final ruling on the matter. </p><p>Reductions in foreign aid have become a hallmark of the Trump administration's America First agenda. </p><p>In her dissenting opinion, Justice Elena Kagan, joined by justices Sonia Sotomayor and Ketanji Brown Jackson, said, \"The effect is to prevent the funds from reaching their intended recipients — not just now but (because of their impending expiration) for all time.\" </p><p>The administration called the funds, which would have been used as foreign aid, for United Nations peacekeeping efforts and to promote democracy in other countries, \"contrary to U.S. foreign policy.\" </p><p><i>The Associated Press and Reuters contributed to this report.</i></p></body></div></body></html>"
    },
    {
      "title": "Massachusetts nonprofit CEO who helps people clear criminal records now charged with distributing cocaine",
      "link": "https://www.foxnews.com/us/massachusetts-nonprofit-ceo-people-clear-criminal-records-now-charged-distributing-cocaine",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-26T18:22:39-04:00",
      "description": "Federal prosecutors charged Javan Tooley with distributing crack cocaine near his Dorchester nonprofit, allegedly with a child present in his vehicle.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>The CEO and founder of a Massachusetts legal nonprofit that specializes in criminal record expungement has been charged with distributing cocaine, the Justice Department said Friday.</p><p>Javan Tooley, 36, of Dorchester and Brockton, Mass., the founder and CEO of Adapt &amp; Evolve, was charged with one count of distribution of and possession with intent to distribute 28 grams or more of cocaine base, federal prosecutors said. </p><p>Tooley appeared in federal court on Friday, where he pleaded not guilty.</p><p>On Sept. 10, 2025, Tooley allegedly distributed 100 grams of crack cocaine in Dorchester near his nonprofit. He is also alleged to have distributed the drugs in his car while a young child — around six or seven years old — was in the back seat.</p><p>\"Tooley allegedly contacted a cooperating witness again, stating that he had additional crack cocaine to sell, and arranged to meet again on Sept. 23, 2025, at an area near the Roxbury District Court,\" the Justice Department said. Tooley was taken into custody upon his arrival and was allegedly found in possession of approximately 160 grams of crack cocaine.</p><p>Federal prosecutors said he targeted and recruited women, many of whom suffered from substance abuse disorders, to engage in paid sex for his financial benefit and to distribute controlled substances for him.</p><p>He allegedly used violence against his victims and gave them drugs. In addition, Tooley allegedly claimed to have connections to law enforcement and other powerful and influential officials through his nonprofit. He also allegedly coordinated drug transactions using the nonprofit’s phone.</p><p>In 2010, Tooley was convicted in Boston for distributing cocaine and sentenced to five years in prison. After his release from federal prison around 2015, Tooley violated the terms of supervised release on at least five separate occasions.</p><p>As a result, Tooley was sentenced to serve nearly two more years.</p><p>He now faces a mandatory minimum sentence of 10 years in prison because of his prior conviction and up to $8 million in fines.</p><p>Fox News Digital has reached out to Adapt &amp; Evolve.</p></body></div></body></html>"
    },
    {
      "title": "Common vitamin shown to slash skin cancer risk in some groups, study suggests",
      "link": "https://www.foxnews.com/health/common-vitamin-shown-slash-skin-cancer-risk-some-groups-study-suggests",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-26T18:13:05-04:00",
      "description": "A new study finds that vitamin B3 (nicotinamide) at 500 mg twice daily reduces basal cell carcinoma and squamous cell carcinoma risk in veterans over a 25-year period.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>A common vitamin could help prevent the development of skin cancer, new research suggests.</p><p>The study, published in JAMA Dermatology, found a decreased risk of three types of skin cancer associated with the use of nicotinamide, which is a form of vitamin B3.</p><p>The research examined the health data of more than 33,000 veterans from 1999 to 2024, pulled from Veterans Affairs (VA) records.</p><p>Patients who took nicotinamide were matched with similar patients who did not, based on characteristics like age, sex, race, skin cancer history and exposure to other treatments.</p><p>The researchers also considered whether patients had health conditions like an organ transplant history or chronic lymphocytic leukemia.</p><p>Among the study group, 12,287 patients were exposed to oral vitamin B3 at 500 mg twice daily for more than 30 days and were compared to 21,479 patients who did not take it.</p><p>The researchers found that patients who took vitamin B3 had fewer skin cancers overall.</p><p>The risk of developing skin cancers — including basal cell carcinoma and squamous cell carcinoma — was reduced by about 14% in those exposed to the supplement.</p><p>The researchers also investigated the rate of skin cancer recurrence, noting that those who started taking nicotinamide right after their first skin cancer diagnosis had a 54% reduced risk of the disease coming back. The benefit was not as significant after being diagnosed with more than one skin cancer.</p><p>Patients with organ transplants did not have a large difference in overall risk unless they began taking vitamin B3 early, which seemed to lower the risk of squamous cell carcinoma.</p><p>These results suggest a \"decreased risk of skin cancer among patients treated with nicotinamide, with the greatest effect seen when initiated after the first skin cancer,\" the researchers wrote.</p><p>In a recent JAMA Dermatology podcast episode, co-researcher Dr. Lee Wheless of Vanderbilt University Medical Center in Tennessee discussed the link between skin cancer recurrence and nicotinamide exposure.</p><p>The doctor said he wouldn't recommend that anyone who gets their first skin cancer diagnosis \"immediately\" starts taking nicotinamide, but the findings have \"shifted\" his thinking.</p><p>\"If a patient has developed that field cancerization already, I really question — is this going to be as effective as if we had started before?\" he asked. \"I think we're all really good at seeing that patient who has lots of [skin damage]. They've had a couple skin cancers, and you just get this sense that they are teetering on the edge of exploding with a number of skin cancers.</p><p></p><p>\"I think this really pushes me to say we need to start now and not wait for you to have that sixth, seventh or more skin cancer before we start doing something preventive.\"</p><p>Fox News Digital reached out to the study authors for comment.</p></body></div></body></html>"
    },
    {
      "title": "Florida vows legal action against any efforts to block TPUSA chapters on campus",
      "link": "https://www.foxnews.com/media/florida-vows-legal-action-against-any-efforts-block-tpusa-chapters-campus",
      "source": "Latest & Breaking News on Fox News",
      "pub_time": "2025-09-26T18:00:50-04:00",
      "description": "Attorney General James Uthmeier called the blocking of Turning Point USA chapters discriminatory and pledged legal action to protect student organization rights.",
      "content": "<html><body><div><body id=\"readabilityBody\"><p>The Florida Attorney General’s Office of Parental Rights announced on Thursday that it will be taking legal action against any public schools that block Turning Point USA (TPUSA) chapters.</p><p>Attorney General James Uthmeier posted on X about Florida's new effort to protect TPUSA chapters, standing beside April Carney, a member of the Duval County School Board.</p><p>\"We’ve been hearing reports up and down the state public schools not allowing TPUSA organizations to be formed on campus. This is discriminatory–It’s wrong, and we will not stand for it. Our AG’s Office of Parental Rights will be bringing legal action where necessary to ensure we are protecting the rights of students to organize, associate, and engage in speech and debate,\" Uthmeier wrote.</p><p>Carney said students and parents should know the Duval County School Board is revamping student-led organization policy.</p><p>\"There should be no issues with you opening a Turning Point USA chapter,\" he pointed out.</p><p>Uthmeier announced the formation of the Office of Parental Rights in April, the \"first-in-the-nation initiative\" established to \"provide justice to parents and families whose rights have been violated.\" </p><p>Florida's office has not confirmed with Fox News Digital any official reporting of high schools or other education institutions attempting to block TPUSA chapters.</p><p>The announcement comes after TPUSA saw a surge in support since Charlie Kirk's assassination. </p><p>After Kirk's massive memorial service on Sunday, TPUSA announced that it has received more than 120,000 inquiries from people wanting to start new campus chapters. </p><p>Oklahoma has also moved to support TPUSA chapters. State Superintendent of Public Instruction Ryan Walters pledged Tuesday to establish a TPUSA chapter in every high school.</p><p>Kirk’s wife, Erika, has been named the new CEO and chair of the board for Turning Point USA. </p><p>Turning Point USA operates 900 official college chapters and approximately 1,200 high school chapters.</p></body></div></body></html>"
    }
  ]
}