{
  "title": "NPR News",
  "link": "https://www.npr.org/",
  "description": "Latest news from NPR",
  "items": [
    {
      "title": "New York City may move its mayoral elections to even years. It'd be part of a trend",
      "link": "https://www.npr.org/2025/09/24/nx-s1-5527104/off-year-elections-consolidate-new-york",
      "source": "NPR News",
      "pub_time": "2025-09-24T05:00:00-04:00",
      "description": "This fall, New York City voters will weigh in on a proposal that could move future city elections to even-numbered years. It's part of a growing trend to consolidate election dates.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>One of the most closely watched elections this fall is New York City's mayoral race. But New York voters will also weigh in on a lesser-known proposal that could move future city elections to even-numbered years.</p> <p>It's part of a growing trend to consolidate election dates — adding local races to the ballot during presidential and midterm elections.</p> <p>Proponents of the effort say it counters persistently low turnout for local elections, despite concerns about local issues and candidates getting overshadowed.</p> <p>Right now, most local races across the country — for things like city council, school board and bond measures — are \"off-cycle,\" or don't coincide with federal elections, according to Katy Owens Hubler, director of elections and redistricting at the National Conference of State Legislatures.</p>\n<p>\"So, all throughout the year, you know, any given Tuesday, there's probably an election somewhere in the country,\" she said.</p>\n<p>Many states require in their constitution that local races be separate from federal and state elections. About a third of states leave it up to local officials to decide when to have local elections, said Zoli Hajnal, a political science professor at UC San Diego. And most local officials choose to have their elections during odd-numbered years.</p> <p>\"I think it's the sort of feeling of not wanting to get lost in the shuffle,\" said Hubler, adding that city leaders often worry their smaller contests and local issues will be overshadowed by bigger races.</p> <p>\"There could also be a campaign finance aspect of this where they feel that they can't actually raise the funds that they need to run a campaign because they're competing with the state-level candidates or even national-level candidates,\" she said.</p> <h3 class=\"edTag\">A main driver for reform: \"extremely low\" turnout</h3> <p>Holding local races in odd-numbered years, though, has resulted in what Hajnal describes as \"extremely low\" turnout — and it's only gotten worse over the past several decades.</p> <p>\"And there is essentially no better solution to low voter turnout at the local level than moving local elections to the same day as statewide and federal elections,\" he said.</p>\n<p>Hajnal uses Las Vegas as an example. When the Nevada Legislature first gave cities the option to move their local races to even-numbered years, very few cities made the change. Turnout in Las Vegas averaged about 37,000. But once it was required in 2019, the first election on-cycle saw more than 244,000 Las Vegas voters cast ballots.</p> \n<p>Another benefit of moving local races, Hajnal said, is that it also expands the electorate.</p> <p>\"So as you move to on-cycle elections, you also change the mix of voters,\" he said. \"And the biggest thing is you get a lot more younger voters. You also get more racial and ethnic minority voters, people of color, and potentially also some greater mix of working class and poor Americans participating as well.\"</p> <h3 class=\"edTag\">More elections mean higher costs</h3> <p>In recent years, efforts to boost turnout have been typically associated with the political left. But some conservative groups, such as the American Legislative Exchange Council, or ALEC, agree with consolidating elections.</p> <p>Though ALEC has called for some restrictions on voting, such as strict voter ID laws, the organization wants more eligible voters to participate, said Katie Thompson, a director at ALEC.</p> <p>Thompson said ALEC is recommending GOP-led states move their local races to on-cycle elections as a cost-saving measure as well. She noted that local governments have to spend a lot of money on local elections on things like paper, electricity and staffing.</p> <p>\"Even when you're looking at the volunteers required to staff elections, it is way harder to get the personnel you need during off-cycle years,\" she said. \"And personnel is really important to the security of elections, which I think we can all agree is an important factor. We want the polls to be adequately staffed.\"</p> <p>This year 29 states introduced legislation aimed at consolidating election dates in some way or another, including Democratic-run states such as Washington and Republican-run states like Indiana. And so far, 12 states have enacted these laws.</p>\n<p>If passed this fall, New York City's ballot measure would require a change to the state constitution before it could go into effect.</p>\n<p>Hajnal said this uptick in discussions about election timing is somewhat unprecedented.</p> <p>\"There's absolutely no doubt there's a major trend towards consolidation or aligning elections,\" he said. \"It's getting a lot more attention and a lot more action and at least looks like into the future a lot more momentum for further reform.\"</p> <p>Besides the cost and low turnout, there is also the concern that all these scattered elections create a lot of work for election administrators, Hubler said.</p> <p>\"There's all these things that you have to do for a regular election anyway. And now you can just do that once as opposed to a number of different times for the smaller races,\" she said.</p> <h3 class=\"edTag\">One concern: Longer ballots</h3> <p>There are concerns, however, about consolidated elections leading to longer ballots, which cost more and can cause longer lines at polling signs or overwhelm voters.</p> <p>Hajnal said they could also create a situation where voters will get tired and just skip those local races at the end of their ballot, anyway.</p> <p>\"Yes, there is some ballot drop-off,\" he said. \"So the longer the ballot, the more people who drop off. But the jump in participation is so high that it much more than offsets that small ballot drop-off.\"</p> <p>Thompson said the longer ballot would probably be worth it to voters.</p> <p>\"The extra few minutes it would take to fill out the next two or three races on the ballot is still less time than knowing that there's an election, driving to the polls, voting, driving all the way home,\" she said. \"It would just be more convenient for people to have those elections on one ballot in a consolidated place versus having to go to all this extra time and expense and effort to go for a whole separate election cycle.\"</p>\n</div>\n</div></body></html>",
      "author": "Ashley Lopez"
    },
    {
      "title": "Love pumpkin spice lattes? Learn some of its spicy history",
      "link": "https://www.npr.org/2025/09/24/nx-s1-5550241/pumpkin-spice-history-spicy",
      "source": "NPR News",
      "pub_time": "2025-09-24T05:00:00-04:00",
      "description": "For NPR's Word of the Week: Things are getting spicy. We explain how a word referring to cinnamon and pepper turned less literal by the 19th century.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>Temperatures are cooling and the sun is setting earlier: Fall is on the way.</p> <p>And with it, autumnal goodies like apple cider, pumpkin bread and those all-too-popular pumpkin spice lattes.</p> <p>But before you take a sip of that cinnamony, nutmegy, clovey goodness, let's dive into the history of the word \"spicy\" for this installment of Word of the Week.</p> <p>According to the Oxford English Dictionary, the earliest evidence for \"spicy\" is from 1562, in the writings of William Turner, a naturalist and religious controversialist.</p> <p>\"For a long, long time, spicy meant exactly what it is supposed to be: that which is containing spice, or redolent of spice,\" Anatoly Liberman, a linguist at the University of Minnesota.</p> \n<p>But it was around the 19th century, that records show people started to use spicy in other less literal ways, he said. It can also refer to \"racy\" or \"engagingly provocative\" in reference to scandalous gossip or anything tantalizing.</p>\n<p>\"It's smart. It's stylish. It's anything that has the impression of giving something sharp, poignant, interesting, out of the way, biting, whatever you want,\" Liberman said.</p> <h3 class=\"edTag\">A look at some \"spicy\" history</h3> <p>Spices have been traded for thousands of years, according to Michael Krondl, author of <em>The Taste of Conquest: The Rise and Fall of the Three Great Cities of Spice</em>.</p> <p>Archeologists found peppercorns up the noses of ancient pharaohs and the Romans used to import huge amounts of black pepper for cooking from India and tons of cinnamon, which they would burn as an incense, he said.</p>\n<p>Spices, like cinnamon, clove, pepper and ginger, \"were always considered extremely exotic, and as a consequence, they were very highly valued,\" Krondl said. They were also associated with holiness and exoticism.</p> <p>\"Medieval Europeans would think that dead saints would smell of spices. So that you would sniff the coffin of a saint and it would be redolent of cinnamon and cloves and nutmeg,\" Krondl explained.</p> \n<p>Spices, of course, were typically grown in tropical places like India, Africa and Southeast Asia, and far from the European aristocracy, who craved these spices, and were willing to pay high prices for them, he said.</p> <p>And they were willing to travel far to get it.</p>\n<p>Europeans sent famous explorers like Vasco da Gama and the mis-directed Christopher Columbus on journeys to find the original sources for spices and to bring back hundreds of pounds of the stuff.</p> <p>The Dutch created the East India Trading Company in 1602 (which lasted until 1799) to profit from the spice trade. It evolved into a global company that relied on forced labor and slavery.</p> <p>\"Nobody needed spices, except for social capital,\" Krondl said. \"They were almost this arbitrary marker of wealth and privilege, and yet, the world was completely transformed through the trade in spices.\"</p> \n<h3 class=\"edTag\">How were spices used</h3> <p>Once in the hands of these wealthy Europeans they wouldn't always use spices to add flavor to food or drinks (pumpkin spice lattes were several centuries from coming to fruition). They were believed to have healing properties.</p> <p>\"They were food and medicine simultaneously,\" Krondl said, especially during the Middle Ages and the Renaissance.</p> <p>If someone was ill, they could be given different kinds of spices depending on their personality or status, he explained.</p> <p>As Liberman explained, around the 19th century \"spicy\" became a word to refer to anything that gives us a sharp or pronounced kind of response.</p> <p>Looking back on this tasty history allows us to realize we are using these spices in many similar ways as the ancient times, Krondl said.</p> <p>\"We're doing the same thing as the Romans,\" Krondl said. \"We're heating up those spices in candles – instead of burning them on pyres to aromatize our rooms.\"<br/></p>\n</div>\n</div></body></html>",
      "author": "Jaclyn Diaz"
    },
    {
      "title": "NPR's middle school champion: A moving podcast about Japanese incarceration",
      "link": "https://www.npr.org/2025/09/24/nx-s1-5535616/npr-middle-school-student-podcast-winner",
      "source": "NPR News",
      "pub_time": "2025-09-24T05:00:00-04:00",
      "description": "For the first time, NPR's Student Podcast Challenge has a returning champion: a California fifth grader who explored a dark chapter in U.S. history during World War II.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>When Ameya Desai won the fourth grade prize of NPR's Student Podcast Challenge last year, something surprising happened: A neighbor reached out asking if the 11-year-old journalist would interview his grandmother, a survivor of the Japanese incarceration camps.</p>\n<p>Ameya was amazed, shocked that she had never learned this history before, one that takes place in her hometown, San Jose, Calif.</p> <p>That spark led her to 85-year-old Linda Horikawa, who recalls being  \"surprised that someone in the fifth grade was interested in the relocation of Japanese Americans during World War II.\" </p> <p>Horikawa was hesitant at first. Then she thought: \"It was a good time to tell everyone what <em>really happened</em>.\"</p> <p>The result is Ameya's podcast, <em>Shikata Ga Nai, Far From Home: Stories of Forced Migration</em><em>.</em> </p>\n<p>The story begins in 1940, on a berry ranch in Cupertino, Calif. \"We had boysenberries, blackberries and strawberries,\" she tells Ameya. \"We were very happy there.\"</p> <p>But those happy times at the family farm were soon upended, when Horikawa was 2 years old.</p> <p>\"Following the Japanese attack on Pearl Harbor, there was a growing resentment towards Japanese Americans, many of whom were questioned about their loyalty to the United States,\" Ameya explains in the podcast.</p> <p>In 1942, the United States forced roughly 120,000 Japanese Americans to leave their homes on the West Coast.</p> \n<p>Horikawa shares vivid, chilling details about life in the incarceration camp in Heart Mountain, Wyo., like guns pointed at her family upon arrival. They were put in tar-paper shacks. Her entire family shared one room with no running water, just a stove for eating. No individual bathrooms, but a tight row of toilets for everyone to share.</p> <p>And it was three years before they were able to return to California. Even then, it wasn't easy integrating back to a community they once called home.</p> <p>\"There was prejudice,\" Horikawa says in a watery voice. \"Kids would say to us, 'your eyes go like this.' But it affected my parents more. I saw that the joy that they had in life was kind of gone.\"</p>\n<p><strong>Reopening a trunk full of history</strong></p> <p>Our judges picked Ameya's podcast from nearly 2,000 entries we received this year. They were moved by Horikawa's story, and charmed by the care and curiosity in Ameya's voice and in her writing. Adelina Lancianese, senior producer of NPR's <em>Embedded</em>, said their interview has \"<em>Story Corps</em> vibes.\"</p> <p>In the seven years of the Student Podcast Challenge, Ameya is the first returning champion.</p> <p>Last year, she was among the winners in our fourth grade category, for her podcast <em>Far From Home — A Story of Forced Migration</em>. In it, she interviewed her grandfather about his family's journey from India to Uganda to the United States.</p> <p>In this new podcast, Horikawa opened up for her young friend a black trunk full of documents that had been sitting in her closet. </p> \n<p>She carefully dusts off a Ziploc bag holding relocation authority passes, identification cards they had to wear at all times. There are newsletters and newspaper clippings about the war, the incarceration camps and families being sent back to California.</p> <p>She holds onto a white towel her mom brought home from the camp, with \"Heart Mountain\" monogrammed in blue.</p> <p>After the family returned to California, Horikawa grew up in San Jose and became a kindergarten teacher in Ameya's school district. She taught there for 40 years and retired.</p> <p>\"I don't think the Japanese people dwell on it,\" she says. \"Culturally, something that's happened that's distasteful to you, you don't bring it up. It's not like a big secret. It's just that you don't want to discuss it, because you felt ashamed that it happened to you.\"</p> <p>Her parents avoided conversations about it growing up, and Horikawa, too, hadn't opened up the trunk in 25 years, until her interview with Ameya.</p> \n<p>\"Being a teacher, you want to further children's interest in different things,\" she continues as she looks at Ameya, \"And here, I found a friend.\"</p>\n<p>Holding her friend's hand, Ameya says getting to share Horikawa's story means so much more than her big win.</p> <p>\"I am honored,\" she says. \"It means that another story will not be lost in time, another story that may help people not repeat the same mistakes.\"</p> <p>You can listen to  <em>Shikata Ga Nai, Far From Home: Stories of Forced Migration, </em>here<em>.</em></p>\n</div>\n</div></body></html>",
      "author": "Janet W. Lee"
    },
    {
      "title": "Typhoon Ragasa batters Hong Kong and southern China",
      "link": "https://www.npr.org/2025/09/24/g-s1-90281/typhoon-ragasa-batters-hong-kong-and-southern-china",
      "source": "NPR News",
      "pub_time": "2025-09-24T04:57:28-04:00",
      "description": "Typhoon Ragasa whipped waves taller than lampposts onto Hong Kong promenades and turned seas rough on the southern Chinese coast after leaving deadly destruction in Taiwan and the Philippines.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>SHENZHEN, China — Typhoon Ragasa, one of the strongest in years, whipped waves taller than lampposts onto Hong Kong promenades and turned seas rough on the southern Chinese coast on Wednesday after leaving deadly destruction in Taiwan and the Philippines.</p> <p>In Taiwan, 14 people died in a flooded township, and 10 deaths were reported in the Philippines.</p> <p>Nearly 1.9 million people were relocated across Guangdong province, the southern Chinese economic powerhouse. A weather station in Chuandao town recorded maximum gusts of 241 kph (about 150 mph) at noon, a high in Jiangmen city since record-keeping began. Huge waves battered Zhuhai city's coastline and strong winds buffered trees under intense rain. Fallen branches were scattered on the streets.</p>\n<p>The national weather agency forecast the severe typhoon would make landfall between the cities of Yangjiang and Zhanjiang on Wednesday evening. Schools, factories and transportation services were suspended in about a dozen cities.</p> \n<p>The fierce winds, brought by Ragasa, once a super typhoon, woke Hong Kong residents in the early hours, and many went online to describe scenes like a kitchen ventilation fan being blown down and a crane swaying.</p> <p>Strong winds blew away parts of a pedestrian bridge's roof and knocked down hundreds of trees across the city. A vessel crashed into the shore, shattering a row of glass railings along the waterfront. Areas around some rivers and promenades were flooded, including cycling lanes and playgrounds. At several promenade restaurants, furniture was scattered chaotically by the winds. Over 60 injured people were treated at hospitals.</p> <p>A video that showed waves of water crashing through the doors of a hotel and flooding its interiors went viral in the financial hub. The hotel has not immediately commented on the incident. But staff were seen cleaning up the lobby, with parts of its exterior damaged.</p> <p>Hong Kong and Macao, a nearby casino hub, canceled schools and flights, with many shops closed. Hundreds of people sought refuge in temporary centers in each city. Streets in Macao turned into streams with various debris floating on the water. Rescue crews deployed inflatable boats to save those who were trapped. The gambling city's local electricity supplier suspended its power supply in some flooded, low-lying areas for safety.</p>\n<p>As winds gradually weakened in the afternoon, a few cities distant from the expected landfall location were preparing to resume normal operations.</p> <p>Hong Kong's observatory said Ragasa had maximum sustained winds near the center of about 195 kph (120 mph) and skirted around 100 kilometers (62 miles) to the south of the financial hub. The city categorizes cyclones with sustained winds 185 kph or stronger as super typhoons to make residents extra vigilant about intense storms.</p> \n<p>The observatory said Ragasa is the strongest tropical cyclone in the northwestern Pacific and South China Sea region so far this year. Preliminary analysis showed it also ranks as the second-strongest one in the South China Sea region since the observatory's record-keeping began in 1950, tying with typhoons Saola in 2023 and Yagi in 2024, it said.</p> <p>Ragasa earlier caused deaths and damage in Taiwan and the Philippines after the typhoon took a path between them.</p> <p>In Taiwan, heavy rain caused a barrier lake in Hualien County to overflow Tuesday and torrents of muddy water destroyed a bridge, turning roads in Guangfu township into churning rivers that carried vehicles and furniture away. Guangfu has about 8,450 people, more than half of whom sought safety on higher floors of their homes or on higher ground. Local authorities said 14 people died and contact was lost with 124 others in the township. Taiwan's Central News Agency said rescuers were going door-to-door to check on these residents.</p> <p>Separately, 34 people were injured across the self-ruled island.</p> <p>At least 10 deaths were reported in the Philippines, including seven fishermen who drowned after their boat was battered by huge waves and fierce wind and flipped over on Monday off Santa Ana town in northern Cagayan province. Five other fishermen remained missing, provincial officials said.</p> <p>Nearly 700,000 people were affected by the onslaught in the main northern Philippine region of Luzon, including 25,000 people who who fled to government emergency shelters.</p>\n</div>\n</div></body></html>",
      "author": "The Associated Press"
    },
    {
      "title": "'We have to speak out,' Jimmy Kimmel says in his late night return",
      "link": "https://www.npr.org/2025/09/24/nx-s1-5551277/jimmy-kimmel-live-abc-back-on-air-glen-powell-fcc-trump",
      "source": "NPR News",
      "pub_time": "2025-09-24T02:01:06-04:00",
      "description": "The comedian was suspended for nearly a week by ABC's parent company, Disney, before returning to airwaves on Tuesday night.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>\"I'm not sure who had a weirder 48 hours — me, or the CEO of Tylenol,\" Jimmy Kimmel joked as he opened his show Tuesday night to a standing ovation after nearly a week away.</p> <p>In a monologue that turned emotional, the comedian choked up addressing the family of Charlie Kirk, the right-wing activist who was killed Sept. 10.</p> <p>\"I've been hearing a lot about what I need to say and do tonight,\" he said. \"And the truth is, I don't think what I have to say is going to make much of a difference … I have no illusions about changing anyone's mind.\"</p>\n<p>Kimmel said, however, that he wanted to make one thing clear: \"It was never my intention to make light of the murder of a young man.\"</p> <p>He said he meant it when he posted a message on Instagram sending love to Kirk's family after he was killed. And Kimmel said he understood why some folks were upset last week when he made comments about Kirk's assassination.</p> <p>But the host also warned about threats to free speech.</p> <p>\"This show isn't important — what's important is that we get to live in a country that <em>allows </em>us to have a show like this,\" he said.</p> <p>The comedian acknowledged that bringing <em>Jimmy Kimmel Live!</em><br/>back on the air puts Disney at risk, because, he said, the president \"can't take a joke.\"</p> <p>\"We have to speak out against it.\"</p> <p>After Kimmel's show taped — and about an hour before it aired on the East Coast — President Trump took to Truth Social to warn ABC.</p> <p>\"I can't believe ABC Fake News gave Jimmy Kimmel his job back,\" Trump wrote. \"The White House was told by ABC that his Show was cancelled! Something happened between then and now because his audience is GONE, and his 'talent' was never there. Why would they want someone back who does so poorly, who's not funny, and who puts the Network in jeopardy by playing 99% positive Democrat GARBAGE.\"</p>\n<p>In his post, Trump also hinted at legal action.</p> <p>\"He is yet another arm of the DNC and, to the best of my knowledge, that would be a major Illegal Campaign Contribution. I think we're going to test ABC out on this.\"</p> <p>Kimmel was suspended by ABC and Disney last Wednesday after the Trump administration took issue with his comments about the suspect in Charlie Kirk's killing.</p> <p>\"We hit some new lows over the weekend with the MAGA gang desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them, and doing everything they can to score political points from it,\" Kimmel said on his show last Monday.</p>\n<p>Brendan Carr, chair of the Federal Communications Commission, wasn't pleased that the comedian had characterized the suspect as a MAGA conservative. \"We can do this the easy way or the hard way,\" he told podcaster Benny Johnson, taking aim at ABC and Disney. \"These companies can find ways to take action on Kimmel or there is going to be additional work for the FCC ahead.\"</p> <p>Carr encouraged local stations to push back and refuse to run <em>Jimmy Kimmel Live! </em></p> <p>Nexstar and Sinclair, which operate ABC stations around the country, including in Nashville, Salt Lake City, New Orleans, Washington, D.C., Seattle, and Portland, Ore., both pulled the show off their airwaves. ABC and Disney then suspended Kimmel indefinitely.</p> <p>This week, even after Disney said the host would return to his regular 11:35 p.m. ET timeslot on ABC, Sinclair and Nexstar said they would continue preempting the show. Kimmel said that some of his own family couldn't watch on Tuesday.</p> <p>\"Discussions with ABC are ongoing as we evaluate the show's potential return,\" Sinclair said in a Monday statement.</p> <p>Nexstar, which needs FCC approval for a multibillion-dollar merger with TEGNA, said on Tuesday that it stood by the decision to preempt Kimmel's show, \"pending assurance that all parties are committed to fostering an environment of respectful, constructive dialogue in the markets we serve.\"</p>\n</div>\n</div></body></html>",
      "author": "Clare Lombardo"
    },
    {
      "title": "Camp Mystic plans to reopen in Texas next summer, a year after floods killed 27",
      "link": "https://www.npr.org/2025/09/23/nx-s1-5551334/camp-mystic-plans-to-reopen-in-texas-next-summer-a-year-after-floods-killed-27",
      "source": "NPR News",
      "pub_time": "2025-09-23T23:48:42-04:00",
      "description": "Camp Mystic plans to reopen next summer near the site where 27 girls and counselors died in a July flood.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>Camp Mystic plans to reopen next summer near the site where 27 girls and counselors died in a July flood.</p> <p>The campers and counselors were swept to their deaths when fast-rising floodwaters of the Guadalupe River roared through the girls' summer camp in a low-lying area known as flash flood alley. All told, the destructive flooding in Texas on the Fourth of July killed at least 136 people and washed away homes and vehicles.</p>\n<p>In an email sent Monday to the families of the victims, the camp said when it reopens, its planning and procedures will follow the \"requirements of the camp safety legislation you bravely championed.\" About an hour later, the camp sent an email to the rest of the families announcing the decision.</p> <p>The camp also announced that it will build a memorial to the girls who died in the flooding.</p> <p>\"In the memorial's design, we will strive to capture the beauty, kindness and grace they all shared, while focusing on the joy they carried and will always inspire in us all,\" the email said.</p>\n<p>Camp Mystic parents successfully pushed for Texas to pass bills aimed at preventing similar tragedies. The measures aim to improve the safety of children's camps by prohibiting cabins in dangerous parts of flood zones and requiring camp operators to develop detailed emergency plans, to train workers and to install and maintain emergency warning systems. One allocates $240 million from the state's rainy day fund for disaster relief, along with money for warning sirens and improved weather forecasting.</p> <p>\"It will hurt my family forever that, for reasons I still do not know, these protections were not in place nor thought out thoroughly for my daughter and the rest of the girls here,\" he said. \"Please pass this bill, protect our kids and do not let their deaths be in vain.\"</p>\n<p>The announcement means that Camp Mystic Cypress Lake, a sister site that opened to campers in 2020, will reopen next summer. But the 99-year-old Camp Mystic Guadalupe was too damaged to open next summer, according to the camp.</p> <p>The email said leaders are \"working with engineers and other experts to determine how we will implement the changes required\" under the newly passed bills.</p>\n</div>\n</div></body></html>",
      "author": "The Associated Press"
    },
    {
      "title": "Want a seat at this synagogue for the High Holidays? You have to register to vote first",
      "link": "https://www.npr.org/2025/09/23/nx-s1-5539314/want-a-seat-at-this-synagogue-for-the-high-holidays-you-have-to-register-to-vote-first",
      "source": "NPR News",
      "pub_time": "2025-09-23T17:08:35-04:00",
      "description": "A Brooklyn synagogue has taken an unusual step by requiring congregants to show proof of voter registration in order to secure seats for High Holidays. Their biggest concern? The city's mayoral seat.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>Two and a half weeks before the start of the Jewish New Year, Congregation Shaare Zion in Brooklyn sent out a letter to its congregants with an unprecedented request. It said that in order to secure seats for High Holidays services — the holiest days of the Jewish year — you must show proof of voter registration.</p> <p>The synagogue's letter comes weeks before New York City's mayoral election on November 4. It reads in part, \"We believe we must put in our best effort to try to avoid a very serious danger that can affect all of us.\"</p>\n<p>The letter does not mention any candidate by name. Nor does it tell congregants what party to register with, or who to vote for or against. But it does warn that the outcome of the election could result in \"very serious problems\" for the Jewish community, and that as a result the synagogue had no choice but to make this requirement.</p> <p>Shaare Zion is the largest Syrian synagogue in New York City, and an important and influential part of the Sephardic Jewish community. That includes Jews with roots in the Iberian Peninsula, and sometimes Mizrahi Jews from the Middle East and North Africa.</p> <h3 class=\"edTag\">Synagogue-state relations</h3> <p>Scholars who study church-state relations say they cannot recall another house of worship ever taking this kind of step.</p> <p>\"Asking a congregant to register with the implications that it's for the mayoral election in a Jewish congregation implies very much a divine sanction for voting and perhaps leaning one way or the other,\" said Mark Valeri, professor of religion and politics at Washington University in St. Louis.</p> <p>\"My surmise is there is fear of [Zohran] Mamdani being elected,\" said Valeri.</p> <p>Mark Treyger is CEO of the Jewish Community Relations Council and a former city councilmember who represented the south Brooklyn district that includes Shaare Zion. He says the concerns raised in the letter are ones he's heard elsewhere about Mamdani, who won the Democratic primary in June.</p>\n<p>\"Given his victory, it has compounded existing concerns that were raised before this primary occurred about public safety and the future of policing and how to handle protests and how to protect shuls [synagogues] and schools,\" said Treyger.</p> <h3 class=\"edTag\">Is it religiously permissible?</h3> <p>Even with these concerns in mind, there are lingering questions about a synagogue's ability to require voter registration.</p> <p>Valeri says because of the letter's careful wording — it doesn't name a candidate or tell people how to vote — there's no obvious legal issue with it.</p> <p>Religiously, the question is different.</p> <p>\"It is terribly unusual,\" said Rabbi David Bleich, a high ranking and respected rabbinical authority at Yeshiva University in New York. \"The question isn't whether it's unusual — it's whether it's permissible.\"</p> <p>By \"permissible,\" Bleich means according to Jewish law.</p> <p>\"On what grounds would a religious organization impose all sorts of conditions that have nothing to do with religion or spirituality?\" said Bleich.</p> <p>Rabbi Bleich says synagogues often have membership requirements. And — he thinks people <em>should </em>vote. But combining the two – having requirements in order to attend services? It doesn't sit well with him.</p> <p>\"The only way they can even work under any kind of color of religious right is by claiming that these people are in violation of a religious duty,\" said Bleich. \"And I respond by asking — do you require that any Jew entering be a Sabbath observer also? It's a little bit ludicrous.\"</p>\n</div>\n</div></body></html>",
      "author": "Sarah Ventre"
    },
    {
      "title": "Trump, in major shift, suggests Ukraine can win back territory long held by Russia",
      "link": "https://www.npr.org/2025/09/23/nx-s1-5551269/trump-ukraine-territory",
      "source": "NPR News",
      "pub_time": "2025-09-23T16:57:42-04:00",
      "description": "Last month, President Trump said Ukraine needed to be open to giving up some of its territory in peace talks with Russia. But those talks haven't happened. Now, he says Ukraine could win it all back.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>President Trump on Tuesday shifted his position on whether Ukraine should hold out for all the territory seized by Russia, saying on social media that he thinks Ukraine is in a position to win it all back.</p>\n<p>It's a reversal from his long-held position that Kyiv would need to give up some of its territory to Moscow to end the war – such as Crimea, which Russia annexed in 2014.</p> <p>But now, \"after getting to know and fully understand the Ukraine/Russia Military and Economic situation,\" Trump said he believes Ukraine – backed by the European Union and NATO – can win back all its territory.</p> <p>\"Why not?\" he said in a post after he met Ukrainian President Volodymyr Zelenskyy on the sidelines of the U.N. General Assembly, even suggesting that Ukraine could \"maybe even go further than that!\"</p>\n<p>The reversal is the latest example of how Trump has swung between deference, frustration and indirect threats against Russia. Early in his second term, Trump boasted that his close relationship with Russian President Vladimir Putin would help him broker a quick resolution to the conflict.</p> <p>But as the war dragged on, Trump has grown increasingly frustrated with Putin. In July, during a meeting with the NATO Secretary General, Trump lashed out at Putin and announced that he was sending Patriot air defense missiles to Ukraine.</p>\n<p>As recently as last month – when Trump met Putin in Alaska to try to broker an end to the war – Trump had said he believed \"some land-swapping\" would take place. Zelenskyy has been resistant to that idea.</p>\n<p>Afterward, Trump said the two countries needed to discuss \"the possible exchanges of territory, taking into consideration the current line of contact. That means, the war zone.\"</p> <p>But since the Alaska talks, there have been no signs that Putin is willing to meet Zelenskyy. Russia has ramped up its strikes on Ukraine, and there have been a series of incursions by Russian military aircraft into NATO airspace in the month since the talks.</p> <p>Trump said he thinks NATO members should shoot down Russian aircraft in such cases. \"Yes, I do,\" he said in answer to a question from a reporter.</p>\n<p>Asked whether he would back up NATO allies if that happened, Trump said: \"Depends on the circumstance, but you know we're very strong toward NATO.\"</p> <p>In his social media post, Trump said Russia looks like \"a paper tiger\" because the war has dragged on for so long, and said that the United States would continue to supply weapons to NATO. \"Good luck to all!\" Trump said.</p> <p>Trump has so far resisted calls for tougher sanctions, insisting that European leaders first need to stop buying oil from Russia, as well as apply steep tariffs for major buyers of Russian oil, like China.</p>\n<p>In a pointed speech to world leaders at the United Nations General Assembly on Tuesday, Trump said it was inexcusable that some NATO members were still buying Russian energy. \"Think of it: they're funding the war against themselves. Who the hell ever heard of that one?\"</p> <p>Zelenskyy said he was hoping to see more sanctions on Russia, and said he supported Trump's push to get NATO members to stop buying Russian energy.</p> <p>Zelenskyy said he had spoken with Slovakia's prime minister who seemed open to cutting off its imports. \"I'm not sure the Hungarians are ready,\" Zelenskyy said. Trump said he hasn't spoken to Hungarian Prime Minister Viktor Orban about it yet. \"I had a feeling if I did, he might stop,\" Trump said.</p>\n</div>\n</div></body></html>",
      "author": "Franco Ordoñez"
    },
    {
      "title": "MLB will allow players to challenge balls and strikes starting in 2026",
      "link": "https://www.npr.org/2025/09/23/nx-s1-5551259/mlb-will-allow-players-to-challenge-balls-and-strikes-starting-in-2026",
      "source": "NPR News",
      "pub_time": "2025-09-23T16:55:37-04:00",
      "description": "With a tap of their head, players will be able to trigger an automated review when they disagree with an umpire's call. In spring training this year, just over half of challenges were successful.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>Starting in the 2026 season, Major League Baseball players will be able to challenge called balls and strikes in regular and postseason games for the first time.</p>\n<p>The widely expected adoption of the challenge system — which is powered by baseball's automated strike zone, known as ABS — was announced Tuesday after years of testing in the minor leagues and a major-league debut this year in spring training and the All-Star Game.</p> <p>The new system \"[strikes] the right balance of preserving the integral role of the umpire in the game with the ability to correct a missed call in a high-leverage situation, all while preserving the pace and rhythm of the game,\" said MLB commissioner Rob Manfred in a press release.</p>\n<p>Only batters, pitchers and catchers are allowed to challenge the umpire's call. The challenge, indicated by a player tapping his head, must be made immediately after the call of ball or strike. Afterward, an automated video will play on the scoreboard showing the location of the pitch and strike zone as detected by a series of 12 cameras placed around every ballpark.</p> \n<p>Each team will begin each game with two challenges. If a call is overturned, the team retains that challenge; if a call is upheld, the team loses that challenge. Once a team loses both its challenges, no player can challenge any more calls.</p>\n<p>Tayler Saucedo, a relief pitcher who played with the Seattle Mariners this season, says he's glad it's coming to the Major Leagues after some initial reluctance. \"I was always anti ABS but after experiencing it this year this will be a great change and fans will love it as well,\" he posted on X. \"Also felt it made umpires better. Doesn't slow down the game at all and it takes about in total 10 seconds.\" </p> <p>In spring training this year, players collectively challenged more than 1,000 balls and strikes. The umpire's calls were overturned just over half the time. Catchers, correct 56% of the time, were the most effective at challenging, and pitchers, at 41%, were the least. MLB reported that each challenge added around 14 seconds to the duration of a game.</p>\n<p>Most MLB players have already experienced the ABS challenge system, whether in spring training this season or during their time in the minor leagues, where MLB has been testing ABS since 2021.</p> <p>John Stanton, the owner of the Seattle Mariners, called the system a \"big step forward for the game.\"</p> <p>\"ABS Challenge strikes the right balance of putting a tool in the players' hands to correct a missed call in a high leverage spot while retaining the human element of the game and adding a new fan-friendly engagement moment,\" said Stanton, who is also currently the chairman of MLB's joint competition committee, a rotating group of six team owners, four active players and one active umpire that votes on new rules.</p> \n<p>Replay review has been part of baseball since 2008, when MLB first allowed the use of video to review home runs. Since then, replay review has widened to include many other types of calls, including force-outs on bases and whether fly balls were caught before touching the ground.</p> <p>Called balls and strikes, though, were long accepted as a \"human element\" of the game, even as technology made it easier to spot bad calls and increased the pressure on umpires. The pressure came both internally from league officials and externally from TV audiences and fans on social media, to standardize the zone and increase their accuracy.</p>\n<p>The ABS system was created by Hawk-Eye, the company behind automated replay systems in other sports, including out-of-bounds calls in tennis and offside reviews in soccer. Over four seasons of testing in Minor League Baseball, officials collected feedback from players, umpires and fans. Then they made tweaks — first to the strike zone by lowering the height of the automated zone after players reported the system produced a taller zone than they expected.</p> <p>MLB also tried out a \"full ABS\" system in which the system fed umpires the call of every pitch, but players and fans alike reported preferring the challenge system. According to an internal MLB poll conducted last summer with Triple-A players and field staff, only 8 percent preferred the fully automated system, compared to 54% who preferred the challenges and 38% who preferred traditional human umpires.</p>\n<p>\"Throughout this process we have worked on deploying the system in a way that's acceptable to players,\" said Manfred. \"The strong preference from players for the Challenge format over using the technology to call every pitch was a key factor in determining the system we are announcing today.\"</p>\n</div>\n</div></body></html>",
      "author": "Becky Sullivan"
    },
    {
      "title": "When it comes to Tylenol, what are parents to do?",
      "link": "https://www.npr.org/sections/shots-health-news/2025/09/23/nx-s1-5551228/acetaminophen-tylenol-autism-trump-explainer",
      "source": "NPR News",
      "pub_time": "2025-09-23T15:55:20-04:00",
      "description": "The science on Tylenol and autism isn't clear, despite President Trump's claims. Here's what parents need to know to make their own decisions about acetaminophen.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>Headache? Sore back? Bad cold? In the past, many Americans would reach into their medicine cabinets and pull out acetaminophen, known by the brand-name Tylenol, without any concern at all. It's long been a staple of home medicine, seen as a safe way to treat pain and fever in pregnancy as well as in childhood, when used as directed. But President Trump has come out swinging against this common over-the-counter drug, blaming it for rising cases of autism in recent years.</p> <p>\"Don't take Tylenol if you're pregnant, and don't give Tylenol to your child,\" Trump said in a White House briefing, emphatically repeating this warning more than a dozen times. \"Fight like hell not to take it.\"</p>\n<p>Physician groups, plus the maker of Tylenol, immediately pushed back on the president's stance, saying it just wasn't supported by the research — and could have serious repercussions for women and babies.</p> <p>All of this means that many parents and would-be parents, plus others who sometimes take acetaminophen, are suddenly wondering what they should think about this old mainstay of medicine, and whether they truly need to be concerned.</p> <h3 class=\"edTag\">What have research studies actually found?</h3> <p>Researchers have spent years trying to tease out any links between autism and acetaminophen, but the evidence is uncertain, according to the Food and Drug Administration's new warning sent to physicians. It noted that while some studies have found an association between use of this drug and development of autism in children, other studies have come to the opposite conclusion.</p>\n<p>One reason such research is difficult is that parents may not remember, or may misreport, how much of the drug they actually took during pregnancy. That's why researchers were particularly interested in one 2019 study in the journal JAMA Psychiatry that made objective measurements of drug levels in umbilical cord blood in nearly a thousand mother-and-child pairs. It found that children with the highest levels of acetaminophen in their cord blood were roughly three times more likely to be diagnosed with autism or ADHD later on, compared with kids that had the lowest levels in their cord blood. However, the lead researcher was careful to note that the study did not show that the drug <em>caused</em> those disorders — just that there was an association.</p>\n<p>Another influential study, one of the largest and best controlled, was published in 2024, and it analyzed the records of over two million children in Sweden. It initially found a small link between acetaminophen use in pregnancy and autism. But the researchers knew that genes have a powerful effect on autism risk, and they wanted to control for this. Since siblings share genes and also other commonalities such as the same home environment, they did an analysis that compared siblings who had been exposed to acetaminophen with those who had not. And when they did that, the link between autism and acetaminophen disappeared.</p>\n<p>\"In other words, the association was not a causal one, and it was most likely due to other factors like genetics, infections, fevers, that sort of thing,\" Brian Lee of Drexel University, one of the study's authors, said in an interview with NPR's Allison Aubrey.</p> <p>So far, he says, the evidence largely suggests that acetaminophen does not cause autism.</p> <p>\"I wouldn't say that the chapter is closed on this by any means, but certainly the mound of evidence from the best studies to date points to no causal effect of acetaminophen on autism.\"</p> <p>One researcher whose work has suggested that the drug may increase the risk of autism is epidemiologist Ann Bauer of the University of Massachusetts. She told NPR's Jon Hamilton that the \"case is still open\" on acetaminophen. She thinks that while expectant parents should be told about a potential risk, they should also be told there's real uncertainty about that risk.</p> <p>She also thinks it's<strong> t</strong>oo soon for the government to be offering guidance on the use of this drug and how that might be related to autism.</p> <p>\"I think they may be jumping the gun,\" she said. \"I think those of us in the research community would like to see stronger evidence.\"</p>\n<h3 class=\"edTag\">Why not just avoid Tylenol altogether in pregnancy?</h3> <p>President Trump said repeatedly that there was \"no downside\" to not taking acetaminophen and that women should just try to tough it out. But experts in maternal-fetal medicine say that untreated fever is known to be dangerous in pregnancy, and pain is a problem too.</p> <p>The Society for Maternal-Fetal Medicine has pointed out that \"untreated fever, particularly in the first trimester, increases the risk of miscarriage, birth defects, and premature birth.\"</p> <p>Untreated pain, meanwhile, can be linked to depression and high blood pressure. Nicole Baldwin, MD, a pediatrician from Cincinnati, Ohio, told NPR's Allison Aubrey that \"I remember when I was pregnant with my daughter, I had an injury. I fell in mid-pregnancy. And if I hadn't had Tylenol to take, I can't imagine the suffering I would have had for two months.\"</p> <p>\"There are no other medications that these pregnant women can take,\" Baldwin said, as other pain and fever reducing drugs have been proven unsafe in pregnancy. Ibuprofen, for example, has been linked to kidney problems in fetuses.</p> <p>\"Acetaminophen is one of the few options available to pregnant patients to treat pain and fever,\" the American College of Obstetricians and Gynecologists said in a statement following the president's press conference. \"When considering the use of medication in pregnancy, it's important to consider all potential risks along with any benefits.\"</p> <p>And that's basically what the FDA told physicians this week, saying that while \"clinicians should consider minimizing the use of acetaminophen during pregnancy for routine low-grade fevers,\" this had to be balanced with the fact that acetaminophen is the safest over-the-counter option in pregnancy against fever and pain.</p> <h3 class=\"edTag\">Who should parents trust on these issues?</h3> <p>Worried parents might wonder how they're supposed to make decisions when the research community might debate autism and acetaminophen for years to come.</p>\n<p>\"Who has time to sit there and go through the dozens or hundreds of scientific articles on any given topic?\" sympathizes Lee. \"We trust our experts. And if our experts are telling us one thing, but other experts are saying another thing, it causes confusion.\"</p> <p>\"I would say, what parents need to do is to step back and think about who they are hearing the messages from,\" Helen Tager-Flusberg, director of Boston University's Center for Autism Research Excellence, told NPR's Michel Martin. \"Are they going to listen to people who are not physicians, who have no expertise in autism, or are they going to turn to their medical providers, their treatment providers and ask them what their view of the current science is? That's what they should be doing.\"</p> <p>Baldwin, the pediatrician in Cincinnati, likes to explain that any association that's been seen between autism and acetaminophen in studies doesn't necessarily mean there's a causal relationship. Both shark attacks and eating ice cream increase in summer, she says, but that doesn't mean that one causes the other.</p> <p>\"These studies that have been out show correlation, but don't actually show causation,\" says Baldwin.\" \"And I think that's an important thing for parents to realize — that the science is not known just yet, despite what has been said.\"<br/></p>\n</div>\n</div></body></html>",
      "author": "Nell Greenfieldboyce"
    }
  ]
}