{
  "title": "NPR News",
  "link": "https://www.npr.org/",
  "description": "Latest news from NPR",
  "items": [
    {
      "title": "Why friends are teaming up to buy homes",
      "link": "https://www.npr.org/2025/09/28/nx-s1-5497777/housing-buying-friends-siblings-affordability",
      "source": "NPR News",
      "pub_time": "2025-09-28T05:00:00-04:00",
      "description": "Buying a home is a conventional milestone for couples. But as home prices skyrocket, many Americans are buying homes with someone who isn't their romantic partner.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p><em>NPR's series </em><em>Cost of Living: The Price We Pay</em><em> is examining what's driving price increases and how people are coping after years of stubborn inflation. How are higher prices changing the way you live? Fill out </em><em>this form</em><em> to share your story with NPR.</em></p>  <h3 class=\"edTag\">What's the issue?</h3> <p>Home prices</p> <h3 class=\"edTag\">How have housing prices changed since before the pandemic?</h3> <p>They're up 56% since February 2020, according to data from the National Association of Realtors.</p> <h3 class=\"edTag\">Why has the price gone up?</h3> <p>There are too many buyers for too few homes. Several reasons explain the supply shortage, including a lag in home building, rising construction costs and high mortgage rates that discourage current homeowners from moving and giving up their lower rate.</p>\n <p>After Hayley Currier and  Tammy Kremer put in an offer on a house, they paced around the backyard of the apartment they shared, nerves jangling.</p> <p>\"We've done everything we can,\" Kremer said.</p> <p>\"And all we can do is be anxious at each other,\" Currier added, before laughing.</p> <p>Currier and Kremer, both in their late 30s, are longtime friends who bonded over their mutual passions for open-water swimming, Jewish rituals and political organizing. They've lived together for the last nine months in a rental in Berkeley, Calif., along with one other roommate.</p> \n<p>This shared home has given Currier what she calls \"such a beautiful community and feeling of connection and home.\" It has also confirmed for her that she and Kremer would live well together for the long term.</p>\n<p>The ideal arrangement, she says, is that \"Tammy and I still have intertwined lives and lives that we get to build together, but just a little bit of private space also.\"</p> <p>Perhaps a duplex, the two of them thought, or two units on the same plot of land. So in March, they started searching for a place to buy together.</p> <h3 class=\"edTag\"><strong>The draws of co-buying </strong></h3> <p>A significant number of Americans have done what Currier and Kremer are doing. Several housing industry reports from 2024 found that about 15% of homebuyers bought their home with a friend or relative.</p>\n<p>Daryl Fairweather, chief economist at the real estate company Redfin, got wind of the growing interest in co-buying through stories from the company's agents. \" We've heard of more buyers having to team up to be able to afford a home,\" she says. \" This is a story that we've been hearing really for a long time because affordability just keeps getting worse and worse.\"</p> <p>Part of the allure of co-buying is that, in an era of rising prices, two wallets are better than one. Home prices have risen more than 50% since 2020.</p>\n<p>\"Five years ago, the median household would be able to buy a typical home with room to spare,\" says Kara Ng, a senior economist at the real estate marketplace company Zillow. \"Now the median owner would need a $17,000 raise in order to afford a typical home,  and that's assuming they already saved 20% down.\"</p> <p>In some parts of the U.S., homeownership is even further out of reach. Ng says that in California, the median earner would need a six-figure raise.</p> <p>California happens to be where Currier and Kremer were looking for a home. Like other co-buyers who spoke to NPR, Kremer couldn't afford to buy alone, at least not where she wants to live.</p>\n<p>Though housing prices are steep for everyone, Kremer and Currier have an additional economic factor working against them: They're single.</p> <p>\"There is a couple's advantage where if you're one person shopping for a home, the amount of listings you can afford is relatively small,\" says Ng. \"But the moment you partner with another person, it unlocks a whole lot of listings for you.\"</p> <p>According to an analysis from Zillow, a couple in the U.S. earning the median income can afford nearly quadruple the number of listings as an individual buyer can. As Americans increasingly delay or forgo marriage, more and more prospective buyers are on the losing end of the couple's advantage.</p>\n<p>Co-buying with a friend or relative is a work-around, allowing people to combine income and assets, especially in areas where the housing stock is mostly single-family homes. \"If there were more duplexes or triplexes available, then people would have an easier entry point to be able to afford a home alone,\" Fairweather says. \"But since single-family homes are often the only homes available and they tend to be maybe larger than what an individual might need, it makes more sense to team up with somebody.\"</p> <h3 class=\"edTag\"><strong>Obstacles to co-buying</strong></h3> <p>When Currier's mother, Sari Currier, first heard about her daughter's plan, she thought, \"Oh, this sounds so bad.\"</p> <p>\"It's not something my generation did. You didn't buy property with someone else,\" she says.</p>\n<p>Research backs her up. Surveys show that younger people are more likely to co-buy. Millennial homeowners were more likely to have purchased a home with one or more friends (14%) than Gen X homeowners (4%) or baby boomer homeowners (1%), according to a 2024 survey from the consumer finance company Bankrate. And a 2024 report from the insurance agency JW Surety Bonds found that 70% of Generation Z is willing to co-buy with a friend, the highest of any generation it surveyed.</p> <p>Sari Currier understands that homeownership has become less far affordable for younger people. But she still had concerns about her daughter co-buying with a friend. Unlike married couples, friends don't have built-in legal protections for splitting property if they want to part ways.</p> <p>So she wrote up a list of questions for her daughter and Kremer to discuss — more than two dozen. They include: If one person can't afford the property tax, is the other liable for the whole amount? If a problem inside one unit affects the other, who pays? What happens when one wants to sell the property?</p> <p>Housing experts advise people who co-buy to put an agreement in writing, as Currier and Kremer have done. \"Whether you're romantically involved or not romantically involved, you need to plan for those worst-case scenarios,\" Fairweather says. \" You never know what's going to happen if one of you loses your job or one of you needs to move or you decide to break up.\"</p>\n<h3 class=\"edTag\"><strong>Co-buying isn't all about money</strong></h3> <p>Some people don't co-buy solely for financial reasons. They do it for companionship. A 2024 Zillow report found that many buyers chose this route because they didn't want to live alone.</p> <p>That's also true for Kremer. During the COVID-19 pandemic, she'd lived on her own in a studio apartment. \"There was something about having my own space that felt like this notion of adulthood, of having made it,\" she recalls. But she was lonely: \" I missed the feeling of coming home to people, and I missed the feeling of sharing food and being in community.\"</p> <p>That won't be a problem for her anymore. Though Currier and Kremer didn't get the house they bid on this summer, by September they had cause to celebrate. Their offer on another property — two units on one lot, with a shared yard — was accepted. Now, it's possible for them to turn a design idea they'd dreamed up into a reality: stringing tin cans between their units to talk to each other.</p>\n</div>\n</div></body></html>",
      "author": "Rhaina Cohen"
    },
    {
      "title": "DACA has bipartisan support in Congress. Still, Republicans are following Trump's lead",
      "link": "https://www.npr.org/2025/09/28/nx-s1-5534436/daca-dream-act-congress-republicans-trump",
      "source": "NPR News",
      "pub_time": "2025-09-28T05:00:00-04:00",
      "description": "President Trump failed to revoke DACA in his first term and his focus on immigration this time has mostly ignored the policy. Still, Republican lawmakers are deferring to the president on the issue.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>Congressional Republicans are waiting on President Trump to signal he is ready to negotiate a permanent solution for recipients of the Deferred Action for Childhood Arrivals program, or DACA.</p> <p>Over the last decade, DACA has received varying degrees of support from Republican lawmakers. The program, created in 2012 to protect children who arrived in the country illegally prior to 2007 from deportation, now benefits around half a million people. During the last few months, there have been reports of DACA recipients without criminal records being detained by federal immigration officials despite the protection the program offers from immigration enforcement.</p>\n<p>As Trump expands the reach of his mass deportation effort bolstered by record funding from Congress, immigration advocates and Democrats are raising concern that those on DACA may get caught in the crosshairs. Nearly 20 DACA recipients have been detained by immigration officials this year, according to the immigrant rights group Home is Here. But Republican lawmakers open to a solution are still deferring to the executive branch to broker a deal.</p> <p>\"I understand they are undocumented. I get it that they broke the law. I get it. But they're needed in the economy and someone gave them a job,\" said Rep. Maria Elvira Salazar, a Republican from Florida who earlier this year introduced a bill that would provide a pathway to legal status for DACA recipients and others. \"President Trump is a guy who gets things done and he can do it. And I am sure that he will come to the realization that this is what's good for America so we can make America greater.\"</p> <p>Salazar's bill has received bipartisan support. But in interviews with Republican lawmakers who have previously supported a pathway to legal status for DACA recipients, nearly every lawmaker was clear: Trump needs to be the one to start talks.</p>\n<p>Trump spent the bulk of the campaign vowing to launch the largest deportation effort in American history. While he has occasionally voiced support for finding a policy solution for certain groups, like farmworkers and other migrant laborers, there has been little effort to do so.</p> <p>\"The Trump Administration's top immigration enforcement priority is arresting and removing the dangerous violent, illegal criminal aliens that Joe Biden let flood across our Southern Border – of which there are many,\" said Abigail Jackson, a White House spokesperson. \"America is safer because of President Trump's immigration policies.\"</p>\n<h3 class=\"edTag\"><strong>The DACA coalition has weakened in Congress</strong></h3> <p>In 2017, 34 Republicans signed onto a letter urging then-House Speaker Paul Ryan to pass a permanent fix for DACA after Trump attempted to rescind the program, arguing that \"reaching across the aisle to protect DACA recipients…is the right thing to do.\"</p> <p>But strategists and immigration advocates said that the coalition of Republicans supporting DACA has shrunk over the years, as has the sense of urgency to find a solution after Trump's first attempt to repeal the program failed. Of those 34 Republicans who signed that letter, only eight are still voting members in the House.</p> <p>\"Allowing DACA to go forward became a political hot potato for the Republicans,\" said Muzaffar Chishti, senior fellow at the nonpartisan Migration Policy Institute. \"Congress always tries to kick the can down the street.\"</p>\n<p>During his first network interview after winning the election, Trump said he would be open to negotiating a deal for DACA with Democrats. More recently, border czar Tom Homan told reporters at the White House that \"no one is prioritizing DACA\" for enforcement.</p> <p>On the Hill, strategists said that this early in the administration's tenure, it may be a tall order to envision the cabinet's immigration enforcement leaders at the negotiating table with the Capitol Hill Democrats that would be needed to see a Congressional fix through.</p> <p>\"The Trump administration's position is that the only thing that is important on immigration is shutting the border. Almost everything [else] to this administration looks secondary,\" Chishti said. \"As long as that doesn't change as a signal from President Trump, I don't think we're going to see much movement from Republicans in the House or the Senate.\"</p> <h3 class=\"edTag\"><strong>House holds out hope on a bipartisan deal</strong></h3> <p>Attempts to work across the aisle can be seen scattered throughout the chamber. The strongest effort is seemingly from Rep. Salazar.</p>\n<p>\"I have no doubt that we have started a national conversation as to what are we going to do with those people, including the DACA kids, who have roots in the country, who have children, who have been working, paying taxes and do not have a criminal record,\" Elvira Salazar told NPR in an interview. \"That is the national conversation that we need to sit down on the table and specifically the GOP, my party and my president. We can definitely solve it.\"</p> <p>Rep. Brian Fitzpatrick, R-Penn., said his support for DACA has not wavered. A member of the Problem Solvers Caucus, he was joined by fellow caucus members earlier this month to announce the group would provide a framework to hopefully kickstart negotiations on legislation that could include providing a solution to those who have been here for decades.</p> <p>\"I look in America and look [at] how immigrants built this country,\" he said. \"So it's really a question for my colleagues as to whether they view America that way.\"</p>\n<p>Separately, earlier this year the caucus sent a letter to the White House requesting a meeting to discuss a bipartisan compromise on immigration. For now, the goal is to come up with a general framework.</p> <p>Still, there needs to be a strong directive from Trump in order to get the process moving, reiterated Todd Schulte, president of FWD.us, an immigration advocacy organization.</p> <p>\"The political reality here is he could snap his fingers and tomorrow we'll have an intelligent conversation,\" Schulte said.</p> <p>Still, any measure also needs bipartisan support in the Senate where enthusiasm is low.</p> <p>Sen. Lindsey Graham, R-S.C., cosponsored the Dream Act in 2024, which would provide a pathway to legal status for people brought to the U.S. illegally as children. Speaking at the Capitol with NPR, Graham said he didn't see any of the current efforts making much headway while the priority stays on enforcement.</p>\n<p>\"If you start legalizing anybody now, that's just another magnet. So I want to turn off the magnets before we do anything,\" Graham said.</p> <p>Sen. Thom Tillis, R-N.C., who introduced measures to provide some pathway to legalization for DACA, said he doesn't see movement before the new year.</p> <p>\"I hope the president goes back to what he said in his first term – he thinks there's room for legal immigration and more people immigrating legally here,\" Tillis said.</p> <p>Sen. John Cornyn, who, in the past spoke strongly about the need to provide a pathway for DACA recipients, said he believes there are others ahead of DACA recipients in terms of the administration's immigration priorities.</p> <p>\"These young people who've now grown to be adults have found themselves in a very bad situation but don't see any prospects for immigration bills, including for them, any time soon,\" Cornyn said. \"Thankfully, the border has settled down, but we still have a lot of people in the country who are under final orders of deportation shouldn't be here. And I think at some point, hopefully, we can have that conversation. But I don't think any time soon.\"</p>\n</div>\n</div></body></html>",
      "author": "Ximena Bustillo"
    },
    {
      "title": "Large Russian drone and missile attack on Kyiv kills 4 and wounds at least 10",
      "link": "https://www.npr.org/2025/09/28/nx-s1-5555885/russian-drone-attack-kyiv-kills-4",
      "source": "NPR News",
      "pub_time": "2025-09-28T04:52:23-04:00",
      "description": "Ukrainian President Volodymyr Zelenskyy said the large-scale attacks involved nearly 500 strike drones.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>KYIV, Ukraine — At least four people were killed when Russia unleashed a barrage of drones and missiles on Ukraine overnight into Sunday, with the capital city of Kyiv suffering the heaviest assault.</p>\n<p>This is the first major bombardment since an air attack on Kyiv killed at least 21 people last month.</p> <p>Tymur Tkachenko, head of the Kyiv City Administration, confirmed Sunday's casualties via Telegram, and said 10 others were wounded in the attack that targeted civilian areas across the city. A 12-year-old girl was among the dead. Thick black smoke could be seen rising from a blast near the city center.</p> <p>\"The Russians have restarted the child death counter,\" Tkachenko wrote on Telegram.</p> <p>Writing on X, Ukrainian President Volodymyr Zelenskyy said the large-scale attacks involved \"nearly 500 strike drones and more than 40 missiles.\"</p>\n<p>Besides Kyiv, he said the bombardment targeted the regions of Zaporizhzhia, Khmelnytskyi, Sumy, Mykolaiv, Chernihiv, and Odesa. According to Zelenskyy, at least 40 people were wounded across the country.</p> <p>Zaporizhzhia's regional head, Ivan Fedorov, said three children were among the 27 wounded in the region, adding that over two dozen buildings were damaged in the region's capital that bears the same name.</p> <p>\"This vile attack came virtually (at) the close of UN General Assembly week, and this is exactly how Russia declares its true position. Moscow wants to keep fighting and killing, and it deserves the toughest pressure from the world,\" Zelenskyy wrote.</p>\n<p>Speaking at the U.N. General Assembly, Russian Foreign Minister Sergey Lavrov insisted to world leaders Saturday that his nation doesn't intend to attack Europe but will mount a \"decisive response\" to any aggression.</p> <p>The strikes that began overnight and continued after dawn on Sunday also targeted residential buildings, civilian infrastructure, a medical facility and a kindergarten, according to Kyiv Mayor Vitali Klitschko, who also said damage was reported at more than 20 locations across the capital.</p> <p>At Kyiv's central train station, passengers arrived to the crackle of anti-aircraft gunfire and the low buzz of attack drones. Mostly women, they waited quietly in a platform underpass until the air raid alert ended. Parents checked the news on their phones while children played online games.</p> \n<p>\"The sky has turned black again,\" said one woman at the station, who gave only her first name, Erika. \"It's happening a lot.\"</p>\n<p>At a multi-story residential building heavily damaged by a drone attack, a large section of the upper floors was gutted and windows blown out. Emergency services personnel, including firefighters with an extended ladder truck, used power saws to clear the debris. Piles of glass littered nearby sidewalks as building residents, some looking shaken, sat on benches.</p> <p>Ukraine's Foreign Minister Andrii Sybiha described the scope of the assault as involving \"hundreds of drones and missiles.\" \"We must maximise the cost of further escalation for Russia,\" Sybiha said, writing on X.</p> <p>Russian officials did not immediately comment on the attacks.</p> <p>The assault also triggered military responses in neighboring Poland, where fighter jets were deployed early Sunday morning as Russia struck targets in western Ukraine, according to the Polish armed forces.</p> <p>Polish military officials characterized these defensive measures as \"preventative.\"</p> <p>International concerns have mounted recently that the fighting could spread beyond Ukraine's borders as European countries rebuked Russia for what they said were provocations. The incidents have included Russian drones landing on Polish soil and Russian fighter aircraft entering Estonian airspace.</p> <p>Russia denied its planes entered Estonian airspace and said none of its drones targeted Poland.</p> <p>The latest bombardment follows President Volodymyr Zelenskyy's announcement Saturday of what he called a \"mega deal\" for weapons purchases from the United States. The $90 billion package includes both the major arms agreement and a separate \"drone deal\" for Ukrainian-made drones that the U.S. will purchase directly.</p> <p>Meanwhile, Russia's Defense Ministry said its air defenses shot down 41 Ukrainian drones overnight into Sunday.<br/></p>\n</div>\n</div></body></html>",
      "author": "The Associated Press"
    },
    {
      "title": "Stampede at a political rally for popular actor Vijay in southern India kills 36, injures 40",
      "link": "https://www.npr.org/2025/09/28/nx-s1-5555871/stampede-political-rally-actor-vijay-india-kills-36",
      "source": "NPR News",
      "pub_time": "2025-09-28T02:39:53-04:00",
      "description": "A stampede at a rally for a popular Indian actor and politician in the southern state of Tamil Nadu killed at least 36 people and injured 40 others.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>NEW DELHI — A stampede at a rally for a popular Indian actor and politician in the southern state of Tamil Nadu killed at least 36 people and injured 40 others, the state's health minister said late Saturday.</p> <p>Ma Subramanian told The Associated Press that the victims were dead by the time they were taken to a hospital and that the injured were stable. The dead included eight children, Subramanian said.</p> <p>The rally, which officials say was attended by tens of thousands of people, was being addressed by Vijay, one of Tamil Nadu's most successful actors-turned-politician in the district of Karur.</p>\n<p>Indian media reports, quoting local officials, said as Vijay spoke to the surging crowd, a group of his supporters and fans fell while trying to get close to his bus, causing the stampede. Supporters had gathered at the political rally amid intensely hot temperatures and Vijay arrived hours late, officials said.</p> <p>\"There was indiscipline\" at the rally, Subramanian said, adding that an investigation had been ordered.</p> <p>Quoting officials, the Press Trust of India news agency reported that at least 30 people fainted while Vijay was addressing the rally from atop his campaign vehicle and were rushed in ambulances to area hospitals. He halted his speech mid-way when workers raised alarm after noticing that people were fainting and falling, it said, adding that as they were removed to hospitals, Vijay continued his speech.</p> <p>However, he ended his speech shortly after sensing an abnormal situation in a section of the huge gathering, the news agency said.</p> <p>Hours after the accident, Vijay offered his condolences.</p> <p>\"My heart is shattered,\" he posted on X. \"I am writhing in unbearable, indescribable pain and sorrow that words cannot express.\"</p> \n<p>Indian Prime Minister Narendra Modi said the \"unfortunate incident\" was \"deeply saddening.\"</p> <p>My thoughts are with the families who have lost their loved ones. Wishing strength to them in this difficult time. Praying for a swift recovery to all those injured,\" he said on social media.</p>\n<p>In southern Indian states, particularly Tamil Nadu, some film stars have larger than life status, rooted in the ancient Tamil culture of hero worship and image worship. Many have become politicians and some have even been given divine status.</p> <p>In 2024, Vijay retired from acting and launched his own political party. It was unclear whether he plans to run for office in Tamil Nadu state.</p> <p>Stampedes are relatively common in India when large crowds gather. In January, at least 30 people were killed as tens of thousands of Hindus rushed to bathe in a sacred river during the Maha Kumbh festival, the world's largest religious gathering.<br/></p>\n</div>\n</div></body></html>",
      "author": "The Associated Press"
    },
    {
      "title": "UN imposes 'snapback' sanctions on a hungrier, poorer and more anxious Iran",
      "link": "https://www.npr.org/2025/09/28/nx-s1-5555869/un-sanctions-iran",
      "source": "NPR News",
      "pub_time": "2025-09-28T01:29:33-04:00",
      "description": "The United Nations reimposed sanctions on Iran early Sunday over its nuclear program, further squeezing the Islamic Republic as its people increasingly find themselves priced out of the food they need to survive and worried about their futures.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>DUBAI, United Arab Emirates — The United Nations reimposed sanctions on Iran early Sunday over its nuclear program, further squeezing the Islamic Republic as its people increasingly find themselves priced out of the food they need to survive and worried about their futures.</p>\n<p>The sanctions will again freeze Iranian assets abroad, halt arms deals with Tehran, and penalize any development of Iran's ballistic missile program, among other measures. It came via a mechanism known as \"snapback,\" included in Iran's 2015 nuclear deal with world powers, and comes as Iran's economy already is reeling.</p> <p>Iran's rial currency sits at a record low, increasing pressure on food prices and making daily life that much more challenging. That includes meat, rice and other staples of the Iranian dinner table.</p>\n<p>Meanwhile, people worry about a new round of fighting between Iran and Israel — as well as potentially the United States — as missile sites struck during the 12-day war in June now appear to be being rebuilt.</p> <p>Activists fear a rising wave of repression within the Islamic Republic, which already has reportedly executed more people this year than over the past three decades.</p> \n<p>Sina, the father of a 12-year-old boy who spoke on condition that only his first name be used for fear of repercussions, said the country has never faced such a challenging time, even during the deprivations of the 1980s Iran-Iraq war and the decades of sanctions that came later.</p> <p>\"For as long as I can remember, we've been struggling with economic hardship, and every year it's worse than the last,\" Sina told The Associated Press. \"For my generation, it's always either too late or too early — our dreams are slipping away.\"</p> <h3 class=\"edTag\">Iran sanctions set to 'snapback'</h3> <p>Snapback was designed to be veto-proof at the U.N. Security Council, meaning China and Russia could not stop it alone, as they have other proposed actions against Tehran in the past. Russian Foreign Minister Sergey Lavrov called them a \"trap\" for Iran on Saturday.</p>\n<p>France, Germany and the United Kingdom triggered snapback over Iran 30 days ago for its further restricting monitoring of its nuclear program and the deadlock over its negotiations with the U.S.</p> <p>Iran further withdrew from the International Atomic Energy Agency monitoring after Israel's war with the country in June, which also saw the U.S. strike nuclear sites in the Islamic Republic. Meanwhile, the country still maintains a stockpile of uranium enriched up to 60% purity — a short, technical step away from weapons-grade levels of 90% — that is largely enough to make several atomic bombs, should Tehran choose to rush toward weaponization.</p>\n<p>Iran has long insisted its nuclear program is peaceful, though the West and IAEA say Tehran had an organized weapons program up until 2003.</p>\n<p>The three European nations on Sunday said they \"continuously made every effort to avoid triggering snapback.\" But Iran \"has not authorized IAEA inspectors to regain access to Iran's nuclear sites, nor has it produced and transmitted to the IAEA a report accounting for its stockpile of high-enriched uranium.\"</p> <p>Tehran has further argued that the three European nations shouldn't be allowed to implement snapback, pointing in part to America's unilateral withdrawal from the accord in 2018, during the first term of President Donald Trump's administration.</p> <p>U.S. Secretary of State Marco Rubio praised the three European nations for \"an act of decisive global leadership\" for imposing the sanctions on Iran and said \"diplomacy is still an option.\"</p> <p>\"For that to happen, Iran must accept direct talks,\" Rubio said.</p> <p>However, it remains unclear how Tehran will respond Sunday.</p> <p>\"The Trump administration appears to think it has a stronger hand post-strikes, and it can wait for Iran to come back to the table,\" said Kelsey Davenport, a nuclear expert at the Washington-based Arms Control Association. \"Given the knowledge Iran has, given the materials that remain in Iran, that's a very dangerous assumption.\"</p> <p>Risks also remain for Iran as well, she added: \"In the short term, kicking out the IAEA increases the risk of miscalculation. The U.S. or Israel could use the lack of inspections as a pretext for further strikes.\"</p> <h3 class=\"edTag\">Hunger and anxiety grow in Iran</h3> <p>The aftermath of the June war drove up food prices in Iran, putting already expensive meat out of reach for poorer families.</p> \n<p>Iran's government put overall annual inflation at 34.5% in June, and its Statistical Center reported that the cost of essential food items rose over 50% over the same period. But even that doesn't reflect what people see at shops. Pinto beans tripled in price in a year, while butter nearly doubled. Rice, a staple, rose more than 80% on average, hitting 100% for premium varieties. Whole chicken is up 26%, while beer and lamb are up 9%.</p>\n<p>\"Every day I see new higher prices for cheese, milk and butter,\" said Sima Taghavi, a mother of two, at a Tehran grocery. \"I cannot omit them like fruits and meat from my grocery list because my kids are too young to be deprived.\"</p> <p>The pressure over food and fears about the war resuming have seen more patients heading to psychologists since June, local media in Iran have reported.</p> <p>\"The psychological pressure from the 12-day war on the one hand, and runaway inflation and price hikes on the other, has left society exhausted and unmotivated,\" Dr. Sima Ferdowsi, a clinical psychologist and professor at Shahid Beheshti University, told the Hamshahri newspaper in an interview published in July.</p> <h3 class=\"edTag\">Executions surge in 2025</h3> <p>Iran has faced multiple nationwide protests in recent years, fueled by anger over the economy, demands for women's rights and calls for the country's theocracy to change.</p> <p>In response to those protests and the June war, Iran has been putting prisoners to death at a pace unseen since 1988, when it executed thousands at the end of the Iran-Iraq war. The Oslo-based group Iran Human Rights and the Washington-based Abdorrahman Boroumand Center for Human Rights in Iran put the number of people executed in 2025 at over 1,000, noting the number could be higher as Iran does not report on each execution.<br/></p>\n</div>\n</div></body></html>",
      "author": "The Associated Press"
    },
    {
      "title": "Wyoming town erects new monument to violent, anti-immigrant history",
      "link": "https://www.npr.org/2025/09/28/nx-s1-5519752/wyoming-town-erects-new-monument-to-violent-anti-immigrant-history",
      "source": "NPR News",
      "pub_time": "2025-09-28T00:01:00-04:00",
      "description": "<strong>At a time when President Trump is going after foreign laborers in the U.Ss, and saying unflattering accounts of U.S. history should be removed, Rock Springs, Wyoming has put up a new monument to ethnic violence there.</strong><br /><br />",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>ROCK SPRINGS, WYO — Towering plateaus dotted with sage brush and roaming wild horses surround the desert town of Rock Springs, Wyoming, with a population of about 23,000.</p> <p>A short drive from Main Street, two rectangular holes form a checkerboard pattern in a grassy lawn connecting a Catholic church with a nearby schoolyard. Six Grinnell College researchers spent the summer here digging, scraping and screening the soil, most of whom have never been to Wyoming before.</p> <p>The Iowa-based researchers are looking for artifacts from when a mob burned down what was once the Rock Springs Chinatown.</p> <p>In 1885, labor tensions boiled over in the Union Pacific Railroad's coal mines, stemming from an argument over who had the best work opportunities. The mob, many of them European migrants, blamed the Chinese.</p>\n<p>\"And it was right here where we're standing,\" said Professor Laura Ng, from four feet deep in the trenches of the dig site, where she's guiding students mapping diagrams of burnt down building foundations.</p> <p>After burning several blocks once made up of homes and shops, the mob killed 28 Chinese people and injured another 14, in what is one of the deadliest incidents of anti-Chinese violence in U.S. history.</p> <p>\"[Because of this], there's going to be a layer that is very distinctive in the archaeological record,\" said Ng.</p> \n<p>In what she refers to as the \"burn layer,\" Ng's team has found artifacts, ranging from pottery sherds, animal bones, an ornamental door handle and a wooden beam from an old building.</p> <p>The town dates back to the 1860s, when Union Pacific's nearby coal deposits lured thousands of immigrant laborers to the mines and railyards as the company neared the completion of the transcontinental railroad.</p> <p>As a result, Rock Springs has long proudly called itself the \"Home of 56 nationalities.\" It's had an International Day celebration for more than a hundred years.</p> <p><strong>Rock Springs turns a corner </strong></p> <p>But now, the town is digging up this part of its migrant history and finding new ways to shed light on a dark moment in its past.</p>\n<p>A new statue was dedicated this fall to mark the 140th anniversary commemoration already memorializing the 55 other nationalities whose labor in the coal mines also built the town.</p> <p>Until recently, Rock Springs' main monument was a small plaque fixed to a boulder to recognize the 28 killed in the massacre. But it sits on a grassy median, turned away from the road that passes by the site of the old Chinatown, making it easy to miss.</p> <p>Over Labor Day weekend, the town unveiled a much more prominent monument to commemorate the 140th anniversary.</p> <p>\"[The] bronze statue 'Requiem,' standing more than seven feet tall, depicts a Chinese miner amidst the ruins of Chinatown, holding the remnants of a ceremonial dragon flag,\" Rock Springs Mayor Max Mickelson read during the statue dedication. He was joined by his town council, which for the most part, supported the statue.</p> <p>The town's growing acknowledgement of its past comes at an odd time for a county that voted 76% for the president in 2024, which since being reelected has tried to erase negative depictions of the country's past.</p> <p>Local students, who now learn about the massacre at school, helped host the more than 200 attendees at the statue ceremony while the county's two history museums helped fundraise for the statue.</p> <p>A memorial like this one is long overdue, according to the mayor.</p> <p>At the same time, he acknowledges the irony of honoring the town's migrant history while Sweetwater County, home to Rock Springs, cracks down and renews contracts with ICE, the federal Immigration and Customs Enforcement agency. Wyoming's state highway patrol and National Guard followed suit earlier this summer.<br/>\"As someone who is a descendant of immigrants that came to this country from Europe, I find it very frustrating that as a country we have decided to take an anti-immigrant stance,\" Mickelson said.</p>\n<p>Like 76% of the county he lives in, Mickelson voted for President Trump in 2024. But he said the crackdown wasn't what he voted for.</p> <p>\"We have real problem areas where those resources would be better put than tracking down somebody who is here working, putting up stucco,\" Mickelson said.</p> <p>He'd rather see resources directed toward the drug and human tracking that have recently plagued his town.</p> <p>As a self-dubbed \"Old School Republican\" and a critic of the president's immigration policies, Mickelson said it's an awkward time to be a member of the party.</p> <p>The mayor has several friends who migrated to Rock Springs as teenagers and have since received citizenship. Immigrant labor is still important to his town, which now relies on mining the mineral trona, used in baking soda, trona mining rather than coal, with just under 20% of residents Hispanic or Latino, according to the Census Bureau.</p> <p>\"We don't love America any more than those people. They worked really hard to get here,\" Mickelson said.</p> <h3 class=\"edTag\"><strong>Descendants of the massacre join the commemoration</strong></h3> <p>This summer, Ricky and Grace Leo returned to their hometown of Rock Springs to join the archaeology dig.</p> \n<p>Despite growing up there, it wasn't until 2019 that the couple learned about the massacre — and that they have ties to it.</p> <p>\"We didn't know that we were related to the people that died in the massacre,\" Grace said.<br/>The massacre wasn't something the couple learned about when they attended the local high school.</p> <p>A chance run in with Rock Springs archaeologist Dudley Gardner at a history conference, considered one of the experts on the massacre and western Chinatowns, turned into the Leos later becoming one of the hosts of this fall's commemoration.</p> <p>At the Labor Day ceremony honoring those who died in the massacre, traditional lion dancers performed and visitors from across the country recited the names of those killed with traditional blessings. The Leo family organized lectures, ceremonial blessing rituals and cooking demonstrations ahead of the unveiling of the statue.</p>\n<p>Ng has also made the effort to reach out to the descendants of the massacre and the survivors. At least five made it to the ceremony,<em> </em>the majority of whom had never heard about the massacre until recently.</p> <p>Robert Lew, who lives in California, was one of them.</p> <p>He knew his father grew up orphaned in Rock Springs. But only learned at 75 years old, after talking with the archaeologists, that his ancestors also made a life in the Wyoming town much earlier.</p> <p>\"In terms of [learning about] my great-grandfather and 1885 in the massacre, that was only two weeks ago, three weeks ago,\" Lew said. His daughter Beth Lew-Williams is an esteemed scholar of Chinese-American history.</p> <p>While here, Lew talked with a young man from Rock Springs, who said he was glad to see his community become more familiar with the massacre.</p> <p>\"It's just amazing, very inspirational,\" Lew said, \"And made me feel really good about our country.\"<br/></p>\n</div>\n</div></body></html>",
      "author": "Jenna McMurtry"
    },
    {
      "title": "George E. Hardy, Tuskegee Airman, dies at 100",
      "link": "https://www.npr.org/2025/09/27/nx-s1-5555412/george-hardy-tuskegee-airman-obit",
      "source": "NPR News",
      "pub_time": "2025-09-27T22:29:41-04:00",
      "description": "George E. Hardy was the youngest Red Tail fighter pilot at 19 years old and completed 21 missions across Europe during World War II.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>Lt. Col. George E. Hardy, the last surviving member of the Tuskegee Airmen who flew combat missions during WWII in Europe, has died. He was 100 years old.</p> <p>Hardy died on Thursday, a spokesperson for Tuskegee Airmen, Inc., told NPR on Saturday. The organization remembered his legacy as one of \"courage, resilience, tremendous skill and dogged perseverance against racism, prejudice and other evils, in a social media post on Friday.</p>\n<p>\"Colonel Hardy was an amazing man. He was a patriot. He loved his family. He loved his community. He loved our organization,\" Leon Butler Jr., national president of Tuskegee Airmen, Inc., told NPR on Saturday. \"He worked very hard. He worked tirelessly to preserve the legacy, not for himself, but for those that he served with, and he cared about the families of other original Tuskegee Airmen.\"</p> <p>Born on June 8, 1925 in Philadelphia, he joined the U.S. Army Air Corps at age 18 in July 1943 and started pilot training at the Tuskegee Army Air Field in December of that year. He graduated from pilot training in September 1944 at age 19, and was commissioned a second lieutenant.</p>\n<p>During World War II, he was part of the 332nd Fighter Group at Ramitelli Air Base, Italy and assigned to the 99th Fighter Squadron. He completed 21 missions across Europe, according to the U.S. Air Force. He was the youngest Red Tail fighter pilot with the Tuskegee Airmen, the first Black aviators of the U.S. Armed Forces, according to the Tuskegee Airmen, Inc.</p> <p>Hardy recalled during an interview with the Veterans History Project that while he was stationed in Italy he did not encounter the systemic racism that he did while in the states but there was still segregation.</p> \n<p>\"We had our own club in Naples…so you didn't go to the White club,\" he said in the interview. \"That's…the way life was.\"</p> <p>He left Italy as a first lieutenant when the war in Europe ended in 1945 and returned to the Tuskegee Army Air Field base where he was a supervising pilot until 1946 when it closed. He then went back home to Philadelphia before attending New York University and getting married in 1947.</p> <p>Hardy was assigned to the 19th Bomb Group, where he was the only Black American officer, and sent to Guam in 1949. The following year, the Korean War began and he was transferred to Okinawa. During the Korean War, Hardy flew 45 combat missions and would again take to the skies in a conflict for the Vietnam War, where he flew 70 combat missions, according to the U.S. Air Force.</p>\n<p>He retired from military service in 1971, according to an interview with AVI-8's The Aviation Journal.</p> <p>Hardy received numerous honors for his military service, including the Distinguished Flying Cross with Valor, a Commendation Medal with one Oak Leaf Cluster and an Air Medal with 11 Oak Leaf Clusters. In 2007, he and other Tuskegee Airmen were awarded the Congressional Gold Medal.</p> <p>While he was proud of his military service, his education was his greatest achievement, Butler Jr. said.</p> <p>He graduated from South Philadelphia High School and received a bachelor's degree in electrical engineering and a master's degree in systems engineering-reliability from the U.S. Air Force Institute of Technology, according to the U.S. Air Force. Hardy also received an honorary doctorate of public service from Tuskegee University, the U.S. Air Force said.</p>\n</div>\n</div></body></html>",
      "author": "Chandelis Duster"
    },
    {
      "title": "Marc Maron, Human Rights Watch and others slam Saudi comedy festival",
      "link": "https://www.npr.org/2025/09/27/nx-s1-5555462/saudi-comedy-festival-chappelle-hart-maron",
      "source": "NPR News",
      "pub_time": "2025-09-27T21:38:31-04:00",
      "description": "The participation of big name funnymen, including Dave Chappelle, Aziz Ansari and Kevin Hart, provoked criticism from fellow comedians and human rights groups.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>Saudi Arabia is not known as a center for comedy. But through Oct. 9, the country's capital, Riyadh, is hosting dozens of A-list comedians — many of them American — at the first ever Riyadh Comedy Festival.</p> <p>The participation of big-name funnymen, including Dave Chappelle, Aziz Ansari, Kevin Hart and Jimmy Carr, has provoked criticism from fellow comedians, including Marc Maron, Shane Gillis and Stavros Halkias, as well as human rights groups and other commentators.</p> <p>\"The Saudi government is using the Riyadh Comedy Festival … to deflect attention from its brutal repression of free speech and other pervasive human rights violations,\" said Human Rights Watch in a statement this week. \"Participating comedians, to avoid contributing to laundering the Saudi government's reputation, should use the comedy festival to publicly urge Saudi authorities to free unjustly detained Saudi dissidents, journalists, and human rights activists.\"</p>\n<p>A recent U.S. State Department report on Saudi Arabia's human rights record in 2024 listed abuses including \"arbitrary or unlawful killings, disappearances, torture, arbitrary arrest and detention, and serious restrictions on freedom of expression and media freedom,\" among other issues.</p> <h3 class=\"edTag\">Comedians' spat</h3> <p>In a video on Maron's Instagram channel, the WTF podcast host took aim at colleagues who signed up to perform at the festival, while referencing the allegations of the Saudi government's possible involvement in the Sept. 11 attacks and its role in the 2018 murder of journalist Jamal Khashoggi.</p> <p>\"From the folks that brought you 9/11. Two weeks of laughter in the desert, don't miss it!'\" joked Maron acerbically. \"The same guy that's gonna pay them is the same guy that paid that guy to bone-saw Jamal Khashoggi and put him in a f***ing suitcase. But don't let that stop the yucks, it's gonna be a good time!\"</p> <p>Gillis and Halkias were both invited to perform at this event, which was announced in July by General Entertainment Authority chairman Turki Alalshikh. On his podcast, Gillis said he declined a \"significant bag\" to perform at the event. \"I took a principled stand,\" he said. In a podcast conversation with Chris DiStefano, Halkias said \"Can't do it.\"</p>\n<p>Fellow comedian DiStefano, conversely, told Halkias he accepted the invitation: \"I didn't want to do it either,\" he said, adding that it was his wife who urged him to take the money.</p> <h3 class=\"edTag\">Saudi Arabia's play</h3> <p>NPR reached out to representatives of nearly every participating comedian for comment, as well as the Saudi embassy in Washington, D.C., and the country's General Entertainment Authority. No one had responded by the time of publication. However, in its statement announcing the event, the General Entertainment Authority described the festival as \"the largest of its kind globally,\" adding that it \"reflects the efforts to amplify Riyadh's status as a leading destination for major cultural and artistic events.\"</p> <p>As a nation heavily dependent on oil, Saudi Arabia is currently engaged in a plan to diversify itself economically, socially and culturally. Its Vision 2030 program, implemented in 2016, encompasses efforts to increase the country's visibility on the cultural stage. \"Vision 2030 is a blueprint that is diversifying the economy, empowering citizens, creating a vibrant environment for both local and international investors, and establishing Saudi Arabia as a global leader,\" the website states.</p> <h3 class=\"edTag\">A history of pushback </h3> <p>The Riyadh Comedy Festival isn't the first time artists have inspired blowback for accepting invitations to participate in events in Saudi Arabia.</p> <p>Big name pop music acts including Mariah Carey, The Black Eyed Peas and Justin Bieber all earned criticism for opting to perform in the country in recent years. \"Doesn't she know Saudi Arabia is one of the most repressive and murderous regimes on the planet?\" wrote the activism group Code Pink in a 2019 statement calling for Carey to cancel her show that year.</p> <p>And American visual artists who've exhibited their work at Desert X AlUla, a spinoff of the U.S. Desert X art festival in the Saudi Arabian desert, as well as the event's organizers, have also received criticism. In a 2019 article, <em>Los Angeles Times </em>art critic Christopher Knight called the show \"morally corrupt.\" Knight added: \"Saudi Arabia is an absolute monarchy built on theocratic law. Free expression is forbidden. Illegal. A criminal act.\"</p>\n<p>Comedian Tim Dillon said on his podcast last month that he signed up for financial reasons. He said he had been offered \"a large sum of money\" — $375,000 for one performance — and said that other comedians had been offered as much as $1.6 million. He told his detractors to \"get over it,\" adding, \"So what if they have slaves, they're paying me enough to look the other way.\"</p> <p>But in an episode of the Tim Dillon Podcast last week, the comedian announced he'd been removed from the lineup for the comments he made about the country's record on slavery. (NPR reached out to Saudi's General Entertainment Authority for verification, but has not yet heard back.) \"I addressed it in a funny way and they fired me,\" Dillon said on his podcast. \"I certainly wasn't gonna show up in your country and insult the people that are paying me the money.\"</p>\n</div>\n</div></body></html>",
      "author": "Chloe Veltman"
    },
    {
      "title": "'I want his name to be known:' Wife of immigrant injured at ICE facility shooting speaks out",
      "link": "https://www.npr.org/2025/09/27/nx-s1-5555467/wife-of-immigrant-injured-at-dallas-ice-facility-shooting-speaks-out",
      "source": "NPR News",
      "pub_time": "2025-09-27T19:06:05-04:00",
      "description": "Stephany Gauffeny says she wants the world to know that her husband, Miguel Angel Garcia-Hernandez, is more than \"just an immigrant or a detainee, or a criminal.\"",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>DALLAS – Stephany Gauffeny rubs her pregnant belly as she sits on a brown leather chair inside a law office. She's tired and worried.</p> <p>Gauffeny can go into labor any time now. But instead of preparing for this moment – the birth of her fifth child – she's anguished about her husband Miguel Angel Garcia-Hernandez.</p> <p>He's on life support after being critically injured on Wednesday in the shooting at an Immigration and Customs Enforcement facility in Dallas. He was being detained there after being arrested on Aug. 8 for driving under the influence. He is in the U.S. without legal status.</p>\n<p>\"It hurts to think like, what if he never even gets to meet him,\" Gauffeny told NPR on Saturday, referring to her unborn child, a son.</p> <p>That is very possible.</p> <p>Gauffeny said that the medical personnel at Parkland Memorial Hospital in Dallas told her on Friday evening Garcia-Hernandez might not survive the night. As of Saturday afternoon, machines were keeping him alive.</p> <p>One of the things that shocked her the most when she saw Garcia-Hernandez in the hospital was how he looked.</p> <p>\"When I first arrived at the hospital, he was shackled, even though he couldn't move,\" Gauffeny said. He's still unconscious, but because he remains in ICE custody, agents are controlling access to his room.</p> <p>All of this is making it harder for her to visit her husband, and for his brothers to see him, too.</p> \n<p>In addition to Garcia-Hernandez, Venezuelan detainee Jose Andres Bordones-Molina was also injured in the shooting. A third was killed, and the Dallas County Medical Examiner's Office identified him as 37-year-old Norlan Guzman Fuentes, from El Salvador.</p> <p>In a statement to NPR, ICE confirmed the identities of all three victims on Saturday. The agency said that all three were \"criminal illegal aliens.\"</p> <p>The shooter was identified by ICE Acting Director Todd Lyons as Joshua Jahn, a 29-year-old who died of self-inflicted wounds. According to law enforcement officials, the man sought to \"terrorize\" ICE agents. However, none of the victims were law enforcement officers. Instead, all of the victims were detainees, according to the government.</p>\n<h3 class=\"edTag\">'He's a great dad'</h3> <p>Gauffeny said the government's long delay identifying the victims is what made her want to tell the world more about who her husband is.</p> <p>\"I want his name to be known,\" Gauffeny said. \"I want people to know who he really was. He wasn't just an immigrant or a detainee, or a criminal.\" She said that she hoped this incident prompted more security to be put in at ICE immigration facilities to protect those inside.</p> <p>Garcia-Hernandez, 31, is originally from Mexico, and has lived in the U.S. since he was a teenager. He doesn't have legal status, his wife said, but based on the fact that she was a U.S. citizen, they were trying to get him permanent residency.</p> \n<p>She told NPR Garcia-Hernandez had a great sense of humor, always making people laugh. He was always helping people – from those in need in the streets, to his family members and friends. He'd give people rides, help fix their cars, help them with household tasks like hanging TVs.</p> <p>And he always worried about his family and took care of her. Even while in detention, he would ask her whether anyone was helping her cut the grass at their new home.</p> <p>She said he worked as a house painter before he was detained, and would often surprise her by coming home from work with her favorite snacks, including elotes.</p> <p>They met when they were 15 years old, and started dating when they were around 19. They've been married for a decade.</p> <p>And he loved being a dad, she said. Together they were raising four kids, ages 3, 8, 12, and 14.</p> <p>\"He spoiled them a lot … and they miss him,\" Gauffeny said.</p> <p>Gauffeny has not told the kids what happened to Garcia-Hernandez. She's hoping for her husband to get better, although she acknowledges that is nearly impossible.</p>\n<p>The kids are noticing her absence – she spends most of her days at the hospital. She's allowed to visit her husband for a few hours in the morning and the evening.</p> <p>And she's also worried about how she'll provide for her kids since Garcia-Hernandez was the main source of income. The family is now relying on a GoFundMe campaign to pay for groceries and bills.</p> <p>\"Before he got arrested … he had told me, 'Okay, my next paycheck, you know, we're gonna go out and buy the baby all this stuff,'\" she said. \"And, you know, it never happened.\"</p>\n</div>\n</div></body></html>",
      "author": "Sergio Martínez-Beltrán"
    },
    {
      "title": "'The cases swung, not me': Ex-Justice Kennedy reflects on a changing Supreme Court",
      "link": "https://www.npr.org/2025/09/27/nx-s1-5554409/justice-kennedy-book",
      "source": "NPR News",
      "pub_time": "2025-09-27T19:00:00-04:00",
      "description": "In an interview with NPR to be aired in October, Kennedy said he is \"very worried\" about America today.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>In the decades I have covered the Supreme Court, I have read lots of books written by justices, and with a couple of notable exceptions, they are…sigh, pretty boring. </p> <p>Retired Supreme Court Justice Anthony Kennedy, however, has written a very interesting book — \"Life, Law, &amp; Liberty,\" scheduled for release Oct. 14 — because he reveals more than usual about himself and his 30 years of service on the nation's highest court — a period of time in which he was often the \"swing justice\" whose vote was determinative in controversial cases ranging from same-sex marriage to, campaign finance, affirmative action, and  abortion.</p>\n<p>Kennedy and Justice Sandra Day O'Connor for much of their overlapping tenures represented the ideological center of the court at a time when the institution became increasingly conservative. Interestingly, both justices were products of the West, much like the President who appointed them, Ronald Reagan. And both justices viewed their Western origins as essential to the their personalities and views. Both started out as pretty firm conservatives, but eventually saw the court transform into a far more conservative group of justices. Or as Kennedy puts it in his book, \"The cases swung, not me.\"</p> <p><strong>Concerned about the country </strong></p> <p>In an interview with NPR to be aired in October, Kennedy said that he is \"very worried\" about America today. </p> <p>\"We live in an era where reasoned, thoughtful, rational, respectful discourse has been replaced by antagonistic, confrontational conversation,\" he said, adding that \"Democracy is not guaranteed to survive.\" </p> <p>Indeed, he says that he is worried even about the tone of some Supreme Court opinions. </p> <p>\"It seems to me the idea of partisanship is becoming much more prevalent and more bitter,\" he said. \"And my concern is that the court in its own opinions…has to be asked to moderate and become much more respectful.\"</p>\n<p>When he retired from the court in 2018, Kennedy told a small group of journalists that he was confident that the court's major decisions would remain intact. But when I asked him if he still thinks that is true, he demurred.</p>\n<p>Though Kennedy, in close cases, voted most often with the court's conservatives, perhaps most revealing in the book are his accounts of how and why he cast decisive votes with the court's liberals on abortion and same-sex marriage. Of the two issues, it turns out that same-sex marriage was easier for Kennedy to resolve, but harder on his relationship with his conservative colleague, Justice Antonin Scalia.</p> <p><strong>Gay marriage decision</strong> </p> <p>Starting in 1996 Kennedy wrote every major decision about gay rights, culminating in 2015 when he wrote the court's majority opinion in Obergefell v. Hodges declaring that same-sex couples must be allowed to marry everywhere in the country. </p> <p>\"No union is more profound than marriage, for it embodies the highest ideals of love, fidelity, devotion, sacrifice and family,\" he wrote.</p>\n<p>Kennedy says that perhaps the most persuasive argument for gay marriage came with his realization that many states barred gay couples from adoptions, so that only one could be the legal parent, and the other had no legal right to make decisions for the child, sign school papers for the child, in some cases could not visit the child in the hospital, and the children could not say they had two parents, which was \"terribly demeaning for the children of gay parents.\" </p> <p>That was the situation faced by \"hundreds of thousands of children of gay parents,\" he observed in our interview. \"That was eye-opening for me, and it was very important in influencing me for the result.\"</p> <p>It was the gay marriage cases, however, that for almost a year led to a rupture with his colleague, Justice Antonin Scalia. The break came over Scalia's dissenting opinion in the same-sex marriage case in which he wrote that if ever he were to join an opinion like Kennedy's \"I would hide my head in a bag.\" According to Kennedy, the other conservatives thought the dissent \"offensive\" and \"intemperate\" and tried to get Scalia to modify it. But they failed, prompting Chief Justice John Roberts to write the lead dissent.<br/>Kennedy says that while he was able to \"shrug off\" the Scalia dissent, his children and their spouses \"were devastated\" by its tone.\" And by the beginning of the next term Scalia, known to all as Nino, \"rarely came to lunch\" with his colleagues and no longer stopped by Kennedy's chambers to chat.</p>\n<p>Months went by and then one day in February of 2016 Scalia \"came down the long corridor of the court to my chambers to talk.\" Once there, \"he turned to the subject on both our minds: our own relationship. Nino said he had come to regret deeply his Obergefell dissent\" and he apologized for being intemperate. \"The visit became a pleasure, even a landmark for us,\" writes Kennedy. \"Neither of us was big on hugging but we hugged, both of us smiling.\" </p> <p>Scalia was leaving shortly for a hunting trip in Texas, but the two men pledged that when he returned, they and their wives would get together again. Kennedy recalls that he told Scalia not to overschedule himself, and Scalia promised that this would be his last long trip.</p> <p>Those parting words were the last they ever spoke to each other. About a week later, Scalia died in his sleep while on that hunting trip. \"If friendships are slipping away, we must renew them soon, lest time does not permit us to celebrate them for long,\" Kennedy writes.</p> <p><strong>Record on abortion</strong> </p> <p>The other emotional legal issue that Kennedy talks about in the book is abortion. A devout and Mass-attending Catholic, Kennedy then, as now, views abortion as a moral wrong. And at one point he was so conflicted that he even considered resigning. \"Another life is involved, one that cannot speak for itself. For many of us the unborn child cries out from the womb, cries out with a soulful voice to us and the law: let me exist, let me live,\" he writes.</p> <p>Ultimately, though, he concluded that \"a moral wrong is not necessarily a legal wrong, nor do my own personal views control what I must decide as a judge.\" As a co-author of the decision that upheld the right to abortion, he writes, \"The constitution promises…a realm of personal liberty which the government may not enter\" and among those decisions, the mother's choice to bear a child is among the most personal known to our law.\"</p>\n<p>The abortion decision that Kennedy co-authored is exhibit A of his opposition to the doctrine that today dominates the conservative Supreme Court: originalism. Six members of the court to a large degree have embraced the idea that the Constitution should be interpreted by following the words in the Constitution at the time the it was ratified, and in some cases the way it was interpreted after the post-Civil War amendments to the Constitution guaranteeing equal protection of the law.</p> <p><strong>Views on originalism</strong> </p> <p>Kennedy has a different view. </p> <p>\"Liberty must be understood over time,\" he said in our interview, adding that it helps little to do what originalists do, refer to dictionaries of the 1700s to figure out what the meaning of the Constitution was at the time it was adopted. In the book, he leads the section on liberty by quoting from his same-sex marriage opinion: \"The nature of injustice is that we may not always see it in our own times. The generations that wrote and ratified the Bill of Rights and the Fourteenth Amendment did not presume to know the extent of freedom in all its dimensions, and so they entrusted to future generations a charter protecting the right of all persons to enjoy liberty as we learn its meaning.\"</p> <p>Or as he puts in in the book, \"In my view the framers of the constitution were not so self assured as to think they knew what the spacious term 'liberty' should mean in all its reach. If they had been certain, they would have written a more detailed explanation\" but the Framers were \"cautious enough and modest enough\" that they \"intentionally chose capacious terms that would inspire and protect freedom.\"</p> <p><strong>A man of the American West </strong></p> <p>While some conservative scholars are less than kind to Kennedy over his changes of heart on some issues, for others it may be somehow reassuring to hear his account of those changes of mind. How, for instance, he initially thought that juvenile killers should be eligible for the death penalty, but later changed his mind for a variety of reasons, among them that the U.S. was among fewer than a handful of nations to permit such punishment. And because studies of the brain indicate that \"the urge to act without thinking is much more prevalent among minors.\"</p>\n<p>Even as much of Kennedy's book is serious, there are some hilarious moments, too. My favorite is the red emergency phone in his chambers that never rang. Then one day it did. It was a prisoner in Ohio, who somehow had gotten the telephone number. The court police quickly said they would change the number, but Kennedy said he enjoyed the occasional chats with the prisoner, who told the justice which rulings he agreed with and which ones he disapproved of.</p> <p>There is a great deal more in Kennedy's book—about his family, the court, his upbringing in Sacramento, Calif., in the '30s and '40s, and about his father, who took the unpopular position of opposing the Japanese internment during World War II. Kennedy, who at 89, is still a tall strapping man, was by his telling, a sickly kid whose father and mother taught him to read at an early age,  and had him read Shakespeare aloud in the car when he was less than 10 years old.</p> <p>After his father died unexpectedly in 1963, Kennedy, who had just begun his legal career in San Francisco, moved back to his family home in Sacramento to take over his father's law practice. He was just 27 years old, and would remain in the place he loved for another 25 years. At age 38 he became the youngest federal appeals court judge in the country, but left Sacramento only when appointed to the U.S. Supreme Court in 1988.</p> <p>In those days, Kennedy observes, Sacramento was a small town of about 130,000 people, and through his eyes, you can almost smell the air, see the scenery and feel the West. Those are the poetic parts of the book.</p> <p><em>Nina Totenberg has covered the Supreme Court for NPR since 1975</em> </p>\n</div>\n</div></body></html>",
      "author": "Nina Totenberg"
    }
  ]
}