{
  "title": "NPR News",
  "link": "https://www.npr.org/",
  "description": "Latest news from NPR",
  "items": [
    {
      "title": "A judge ruled their firings were illegal. The government got to do it anyway",
      "link": "https://www.npr.org/2025/09/25/nx-s1-5544317/federal-probationary-employees-firing-supreme-court",
      "source": "NPR News",
      "pub_time": "2025-09-25T05:01:00-04:00",
      "description": "A judge ruled the firing of thousands of federal employees was illegal. But he stopped short of ordering the government to reinstate them, predicting the Supreme Court would overturn it.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>More than six months after being terminated from her job with the federal government, Jessie Beck got the news she'd been hoping for — sort of.</p> <p>On Sept. 12, U.S. District Judge William Alsup issued his final decision in a case challenging the Trump administration's mass firings of probationary employees, mostly those in their first year or two on the job.</p> <p>In a 38-page order, Alsup wrote that the terminations, dating back to February, were unlawful. But he stopped short of requiring the government to reinstate workers. It was clear to him, he explained, that the Supreme Court would overrule such relief given recent decisions the court had issued on related matters. He also wrote that too much time had passed.</p>\n<p>\"The terminated probationary employees have moved on with their lives and found new jobs,\" Alsup wrote. \"Many would no longer be willing or able to return to their posts.\"</p> \n<p>Beck, who was a fisheries biologist with the National Oceanic and Atmospheric Administration, says that is simply not true.</p> <p>\"Immediately, I would return to my job, as would many, many others,\" she says. \"We loved our jobs. We worked really hard to be there. And a lot of us have found short-term or other work to fill that gap. But a lot of us have also taken pay cuts to do so and really have suffered a lot of damage to our careers.\"</p> <p>While Beck says it's validating to read that Alsup found malfeasance in the government's actions, she's extremely frustrated that the relief he offered was so limited.</p> <p>\"I think that from the outset, Judge Alsup really had his hands tied,\" she says. \"It seems like the judicial process is being undermined by a higher court.\"</p> <h3 class=\"edTag\">A victory in court offers little meaningful relief</h3> <p>Through multiple decisions issued on its shadow docket, the conservative majority on the Supreme Court has made clear it believes the Constitution gives the president expansive powers over the executive branch, including the power to hire and fire as he sees fit, despite federal law granting civil servants, including probationary employees, some job protections.</p>\n<p>Alsup has clearly taken notice. In April, the court vacated his temporary pause on the probationary firings, leading him to remark the next day in court, \"They are the boss. I'm just a district judge.\"</p>\n<p>Although the Supreme Court's shadow docket orders are themselves meant to be temporary, Alsup wrote \"the Supreme Court has made clear enough by way of its emergency docket that it will overrule judicially granted relief respecting hirings and firings within the executive, not just in this case but in others.\"</p> <p>The result for fired employees like Beck is deeply unsatisfying. In the end, the government got to fire her and thousands of others, despite a court's finding that it was illegal. The Trump administration has appealed Alsup's decision.</p> <h3 class=\"edTag\">Pushed into a tough job market</h3> <p>Beck was ten months into her job at NOAA when she was fired on February 27 as part of the Trump administration's purge of probationary workers. She had been working with fisheries in Alaska to find ways to reduce harm to seabirds while not harming the bottom line of fishing communities.</p> \n<p>She had come to the government after more than a decade doing related work at a nonprofit, because she wanted a more direct role in figuring out solutions to conservation challenges.</p> <p>Now, she's struggling to get her career back on track. Under the Trump administration, there have been deep cuts to funding for science, and the market is flooded with qualified candidates searching for jobs.</p> <p>At 38, Beck has been piecing together short-term work, but it's not enough to make up for what she lost. She and her husband were trying to have a child when she got fired, and she says her financial instability is making that all the more difficult.</p> <p>\"It's been a real lesson in living in uncertainty,\" she says.</p>\n<h3 class=\"edTag\">His skills were in demand, but now he's struggling to find work</h3> <p>A federal employee fired from the Centers for Medicare &amp; Medicaid Services is likewise still grappling with the consequences of his termination.</p> <p>At 50, the health care technology expert has been unable to land a new job. He has gotten some initial interviews only to be told the companies are not interested in moving forward with him. Sometimes he hears nothing at all. NPR agreed not to name him, because he fears speaking out publicly could further complicate his efforts to get another job.</p>\n<p>Meanwhile, his attempts to get unemployment insurance through the state of New York, where he worked, have gone nowhere. Online, he sees that his claim is \"under review.\" He's tried calling 20 or 25 times in hopes of reaching someone who can help.</p> <p>\"Nobody's available to talk to you,\" he says. \"The phone gets disconnected.\"</p> <p>It's a trying situation for someone whose decades of experience in health care IT appeared highly prized as recently as last year. When he was hired by the government in 2024, he was told he was one of 1,300 applicants for three positions.</p> <p>\"I was totally enjoying it, doing some meaningful work,\" the former government employee says. He'd received a strong performance review in January, shortly before he was fired.</p> <p>He was looking forward to finding ways to use artificial intelligence to find inaccuracies in clinical data. Now, he's not sure whether someone else will pick up the work. He only knows with Alsup's order, it's not going to be him.</p> <h3 class=\"edTag\">A judge highly critical of the Trump administration's actions</h3> <p>Since February, Alsup has been highly critical of the government, calling the mass firing of probationary employees for performance reasons \"a sham in order to try to avoid statutory requirements\" for downsizing the government. At times, he questioned whether government lawyers were telling him the truth.</p>\n<p>Back in March, White House Press Secretary Karoline Leavitt released a statement, accusing the judge of \"attempting to unconstitutionally seize the power of hiring and firing from the Executive Branch,\" and inviting him to run for president himself.</p>\n<p>In his Sept. 12 order, Alsup again chastised the government, this time for failing to produce key documents and records as required by the court, frustrating the judicial review process.</p> <p>\"The 'administrative record' leaves the reader with the feeling that he is being led, blindfolded, along a carefully plotted path through a dense, unseen wood,\" Alsup wrote. \"Here and there, he may hear a rustle in the trees, feel the dark silhouette of a towering form, or intuit some other hint at the forest beyond, but never is he afforded an unfettered view of the landscape through which he passes.\"</p> <h3 class=\"edTag\">An order to set the record straight on performance</h3> \n<p>While the relief Alsup ordered fell far short of what Beck, the fisheries biologist, had hoped for, she is glad that he has ordered agencies to make clear, in official paperwork and letters to fired employees, that their terminations had nothing to do with their performance.</p> <p>Alsup first ordered agencies to issue such a letter months ago, after finding that agencies had not actually assessed the individual performance of employees before firing them. He said without such letters, the employees may be dogged by questions over their job performance.</p> <p>\"Countless high-performing employees… were terminated through a lie,\" he wrote in an April 18 order. \"Termination under the false pretense of performance is an injury that will persist for the working life of each civil servant.\"</p> <p>In the months that followed, Beck received two letters from the government — first, a form letter, and later, a similar one that included her name. She calls them \"the apology/non-apology.\"</p>\n<p>The letters, indeed, say that she was not terminated because of her performance. The letters also say that the government is only providing such notice due to a court order, and that the government believes the order is \"legally and factually erroneous\" and therefore is appealing it.</p> <p>This time, Alsup has given federal agencies until Nov. 14 to reissue the letters, without all the disclaimers.</p> <p>\"There is no need to lard the letters with such distractions,\" Alsup wrote.</p> <p>The government has appealed Alsup's final order to the 9th Circuit Court of Appeals.</p> <p>Meanwhile, Beck wonders if she'll forever have a mark on her record.</p> <p>\"It's going to make it difficult to explain to future employers outside of the government and will absolutely make it difficult to get another federal job,\" she says.<br/></p>\n</div>\n</div></body></html>",
      "author": "Andrea Hsu"
    },
    {
      "title": "Tensions are high in a Utah redistricting fight that didn't start with Trump",
      "link": "https://www.npr.org/2025/09/25/nx-s1-5552779/utah-redistricting-trump-texas-congress",
      "source": "NPR News",
      "pub_time": "2025-09-25T05:00:00-04:00",
      "description": "Like Texas, Utah Republicans are redrawing congressional maps mid-decade. Unlike Texas, Utah's new maps could give Democrats more of a shot at winning a seat.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>SALT LAKE CITY — Utah is getting closer to redrawing its congressional boundaries in an unusual mid-decade redistricting process, but it's not yet clear what that map will look like. In a heated committee meeting Wednesday, state lawmakers said they're considering a lot of options before deciding in October.</p> <p>Unlike other Republican-led states redistricting this year, Utah's new map is expected to give Democrats more of a chance at winning at least one of the state's four congressional districts, which could help Democrats in the race to control the U.S. House. State lawmakers were ordered to draw the new districts after a<strong> </strong>Utah judge ruled they had acted unconstitutionally in creating the map used in 2022.</p>\n<h2 class=\"edTag\">GOP \"complying under protest\" </h2> <p>The Legislature's Republican supermajority has made it clear they are not happy they had to go back to the drawing board and are complying under protest. The map must be approved by lawmakers and the court by Nov. 10 to be used in the 2026 midterms, according to Lt. Gov. Deidre Henderson's <strong>o</strong>ffice.</p> <p>Utah's voided congressional map split the bluest area of the state, Salt Lake County, among the state's four districts, making four U.S. House seats safe for Republicans. That split was the biggest critique of the map, especially by county residents.</p> <p>All of the proposed new boundaries also divide the county, the most populous one in the state, but some only split it into two districts.</p> <p>Instead of advancing a single proposed map, the Legislature's redistricting committee said Wednesday it will let the public weigh in on any map that has been posted on its website before making a decision. That includes six maps commissioned by lawmakers, as well as proposals submitted by citizens.</p> <p>Lawmakers will choose from one of those maps, and only those maps, on Oct. 6. The map will go back to court for the judge to approve.</p> <h2 class=\"edTag\">The national picture</h2> <p>Though Utah's redistricting originated from a local court case, it's playing out amid a redistricting race around the country set off by President Trump.</p>\n<p>Usually, states redistrict early in the decade using new census numbers. In order to try to keep the GOP hold on the U.S. House and worried about midterm election losses, Trump has asked states led by Republicans to redistrict ahead of 2026 and help their party win seats.</p> <p>At Trump's urging, Texas passed a new map that could help Republicans win five more seats. To counter, California's Democratic leaders are asking voters to approve a new map that could help their party win five seats on November 4. Missouri has followed Trump's lead, with the Republican-led Legislature passing a map that could oust a Democratic congressman.</p> <p>Republican leaders in Indiana and Florida say they are working to follow Trump's call. They and other Republicans across the country say holding the U.S. House is key to maintaining Trump's agenda and preventing investigations of his administration that could be launched by a Democratic-led House.</p> <h2 class=\"edTag\">The Utahns who sued</h2> <p>In 2018, Utah voters narrowly approved a ballot initiative known as Proposition 4 that, among other things, created an independent redistricting commission and prohibited gerrymandering. In 2020, the Legislature repealed and replaced the initiative with a law that weakened the commission's role and took out the prohibition on partisan gerrymandering.</p> <p>In 2022, the League of Women Voters of Utah, Mormon Women for Ethical Government and a handful of Utah voters sued the Legislature. They alleged that the Legislature violated Utahns' right to alter and reform their government and that the state's 2021 congressional map was gerrymandered to favor Republicans.</p> <p>In August of this year, a Utah judge ruled that the Legislature's override of Proposition 4 was unconstitutional. Because the state's 2021 congressional map was a product of that unconstitutional act, the judge said it had to go.</p> <p>Without valid maps, the Legislature has to redraw the boundaries in accordance with Proposition 4, which the judge also reinstated.</p>\n<p>At the same time, GOP state lawmakers are trying to pass a bill that creates a single standardized method for testing \"partisan symmetry\" in congressional maps to determine if boundaries are fair.</p> <p>But Democrats on the committee argued that the test does not work in states like Utah where one party dominates in statewide elections.</p> <p>That proposed test is what most concerns Elizabeth Rasmussen, executive director of Better Boundaries, the group that backed Proposition 4.</p> <p>\"I just see this as weaponization of the process to get a map they want,\" Rasmussen says.</p> <p>If the plaintiffs in the lawsuit have objections to the Legislature's map, they are also allowed to submit a proposal to the court. If that happens, there will be additional court hearings in late October to decide which map will be used.</p>\n</div>\n</div></body></html>",
      "author": "Martha Harris"
    },
    {
      "title": "Housing prices are causing some people to have smaller families than planned",
      "link": "https://www.npr.org/2025/09/25/nx-s1-5540077/housing-prices-fewer-children",
      "source": "NPR News",
      "pub_time": "2025-09-25T05:00:00-04:00",
      "description": "Home prices skyrocketed during the pandemic — and have stayed high. For some Americans, making their budget work means having fewer children than they'd envisioned.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p><em>NPR's series </em><em>Cost of Living: The Price We Pay</em><em> is examining what's driving price increases and how people are coping after years of stubborn inflation. How are higher prices changing the way you live? Fill out </em><em>this form</em><em> to share your story with NPR.</em></p>  <p><strong>What's the item?</strong></p> <p>Housing</p> <p><strong>How has the price changed since before the pandemic?</strong></p> <p>Up 56% since Feb. 2020, according to the National Association of Realtors.</p> <p><strong>Why has the price gone up?</strong></p> <p>Low mortgage rates and work-from-home policies spurred a homebuying rush in the first two years of the pandemic, causing home prices to spike. Then mortgage rates shot up in 2022 and homebuying slowed significantly. But prices have stayed high as many current homeowners have locked in low mortgage rates and aren't in a hurry to sell.</p>\n <p>For Ava Rimal, the options became clear: She and her husband could have a second kid, or move to the bigger house in a more upscale area. But they couldn't afford to do both.</p> <p>They chose the house.</p> <p>\"I'd rather have one kid that I can give everything to than try to spread it thin between two children just for the sake of having two children,\" she says.</p> <p>Housing costs have risen sharply in recent years, leading people to make some hard choices. To make the math work on housing and daycare and everything else, some Americans are opting to have a smaller family than they had once envisioned.</p> <p>Rimal says she had always wanted to have two kids. She and her husband married during the pandemic, and had a son not long after. For a time, they all fit well enough into the two-bedroom house in Asbury Park, N.J., the couple had bought in 2016.</p> <p>But as their son reached preschool, the house started feeling small. They weren't excited about the local schools. A new plan came into focus when they visited Rimal's coworker in the South Jersey town of Collingswood, near Philadelphia.</p> <p>\"It looked like a Hallmark movie. There were kids everywhere, and people singing,\" she recalls. \"It was just nuts.\"</p>\n<p>So they sold their Asbury Park home, and last June managed to buy a three-bedroom in Collingswood. But it stretched their budget. Their monthly payment is now almost $5,000, more than double what they were paying before. The mortgage rate on their old house was 3% — now it's 7.25%.</p> <p>\"We bought the house with three bedrooms to kind of preserve the possibility of having another kid. But we didn't know that the interest rates were going to be so high or that we'd end up spending $100,000 more than we wanted to,\" Rimal says.</p> <p>When they ran the numbers on paying for daycare for a theoretical second child, plus their mortgage payment, it was just too expensive. They decided to be one and done.</p> <h2 class=\"edTag\">Since the pandemic, affording a house has gotten harder for many</h2> <p>The pandemic created a watershed moment in the U.S. housing market.</p> <p>Many who bought a home before rates shot up in 2022 locked in super low interest rates they can keep forever. That means their housing costs may be significantly lower than those who bought later — but they can also feel locked in place, in a home that no longer fits their needs.</p> <p>Some who bought a home in the last few years, when both prices and mortgage rates have been high, feel squeezed by monthly payments that leave little cash left over. They stretched to afford a home — and they're still stretching.</p> <p>And many who haven't bought a home yet say they don't know when they'll ever be able to afford one. High rents make it hard to save for a down payment. Some people waited for prices or rates to fall so that they could jump in — and they're still waiting.</p> <p>The median monthly payment on a home bought in 2024 was $2,207, compared to $1,525 for a home bought in 2021, according to an analysis by Bankrate.</p>\n<p>The median sales price for existing single-family homes rose 56% between February 2020 and July of this year, according to data from the National Association of Realtors. And high mortgage rates have further slashed affordability: Rates jumped from pandemic lows below 3% to above 7% earlier this year — though in recent weeks, they've dipped below 6.5%.</p>\n<p>The high cost of housing is even causing some people to conclude they don't want kids at all.</p> <p>Chelsea Clouser is 29 and lives in Davis, Calif. She works in fundraising, and her husband teaches high school.</p> <p>When she was younger, Clouser was interested in having kids. \"But then as I've gotten older and as I started working and kind of experienced how difficult it is to feel financially comfortable, it's just become less and less desirable for me,\" she says.</p> <p>Part of that calculation is the cost of housing. Clouser and her husband pay $2,400 a month to rent a one-bedroom apartment that sometimes already feels too small, with just their cat.</p> <p>Over the last six years, rents nationally rose 17%. Clouser's rent has gone up every year she's lived in Davis.</p> <p>\"We want to eventually buy a house. And so if we had a kid, while we're renting, that would just be so impossible,\" she says.</p> <p>The cost of their rent — plus the fees for parking, storage, and a pet — has made saving up for a down payment difficult. Especially when the cost to buy is so high: Last month the typical home in Davis sold for $843,000.</p> <p>But even if housing were cheaper, Clouser says she would still have reservations. She worries about the economy and layoffs at work. She doesn't want the worry of providing enough opportunities for a child, too.</p> <p>As she and her husband talk through their goals, they weigh the benefits of having a child against how much harder it would make their financial situation. In the end, she says, it \"just doesn't really seem worth it.\"</p>\n</div>\n</div></body></html>",
      "author": "Laurel Wamsley"
    },
    {
      "title": "8 walking and biking safety tips that just might save your life",
      "link": "https://www.npr.org/2025/09/25/nx-s1-5547076/safety-tips-bikers-cyclists-pedestrians",
      "source": "NPR News",
      "pub_time": "2025-09-25T05:00:00-04:00",
      "description": "In 2024, 7,100 pedestrians were killed on the road, and in recent years, more than 1,000 cyclists have been hit and killed annually. Safety experts explain how bikers and walkers can stay safe.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>You've heard of defensive driving — driving practices to help you stay safe on the road, like reducing your speed in bad weather or signaling before switching lanes. But what about defensive walking and cycling?</p> <p>They're a crucial part of pedestrian and cyclist safety, and more people should practice them, says Ryan Sharp, a transportation consultant with Alta, a transportation design firm.</p>\n<p>\"It means paying attention to your surroundings and having a constant awareness of the environment so you can anticipate potential hazards,\" he says. Because if you're a biker or a pedestrian and you get hit by a car, you're likely to be the more injured one.</p> <p>According to estimates from the National Highway Traffic Safety Administration, about 7,100 pedestrians were killed in traffic crashes in the U.S. in 2024. In recent years, more than 1,000 cyclists have been hit and killed annually.</p>\n<p>But casualties are preventable. Sharp and Julia Kite-Laidlaw, a pedestrian and cyclist safety advocate with the National Safety Council, share their top do's and don'ts for walkers and bikers.</p> \n<p><strong>1. DO look left, right and behind you. </strong>\"Oftentimes the greatest hazards if you're a pedestrian trying to cross at an intersection are actually coming from behind you,\" Sharp says. </p> <p>So, look in all directions and turn around before walking or biking across a road. A driver trying to turn into the intersection may not see you in the crosswalk, for example, because they're looking at oncoming traffic. </p> \n<p><strong>2. DO be visible and predictable. </strong>\"Never assume that a driver sees you,\" Kite-Laidlaw says. More than three-quarters of pedestrian deaths happen after dark, and many people get struck and killed in places without sidewalks, where drivers may not expect people to be walking, according to a 2025 report from the Governors Highway Safety Association. </p>\n<p>Always walk on the sidewalk or a walking path. If there is none, walk on the shoulder of the street against traffic so you can see oncoming cars and drivers can see you. </p> <p>If you're biking at night, put white lights at the front and red lights at the back of your bike so cars can see you. Even when you have the right of way, try to make eye contact with an oncoming driver or look for other indications that they see you, such as slowing down.  </p> \n<p><strong>3. DO use sidewalks, bike paths and safe pedestrian crossings whenever possible. </strong>Most pedestrian and cyclist deaths \"happen in between intersections,\" Kite-Laidlaw says, for instance, when dodging traffic across the middle of a street with no crosswalks. So stay in areas designed to keep bikers and walkers safe. </p>\n<p>In some cities, the walk and bike signals turn green before the stoplights do. That gives pedestrians and bikers a few extra seconds of lead time, boosting their visibility and showing drivers they have the right of way. Design elements like curb extensions, which shorten the length of a crosswalk, lessen the amount of time a pedestrian is exposed on the road.  </p> \n<p><strong>4. DON'T be distracted while biking or walking, especially while crossing the road. </strong>No listening to music or podcasts in your headphones or looking at your phone. You want to be able to hear the sounds of oncoming traffic and see what's happening around you.</p> <p><strong>5. DON'T ignore people on e-scooters and e-bikes</strong>. Because they're motorized and typically faster than someone on a bicycle, they may be a potential hazard for pedestrians and cyclists, Sharp says. Many cities and communities have yet to create the road infrastructure to accommodate these vehicles, so you may have to share space with them on sidewalks, bike paths and roads. </p> <p>If you feel nervous about crashing into an e-bike rider while walking down the road, \"that's understandable,\" Sharp says. But keep in mind that \"data has shown that there are not a lot of collisions between e-bike riders and pedestrians.\"</p> \n<p><strong>6. DO wear your helmet correctly when cycling.</strong> It can protect you from head injuries in case of an accident.<strong> </strong>Make sure the helmet is covering your forehead, about one or two finger-widths above your eyebrow. The side-strap should form a V shape under and slightly in front of your ears on both sides of your face. Buckle and tighten your chin strap until it's snug. When your helmet is on, it shouldn't be rocking more than one inch side to side or front to back on your head.</p>\n<p><strong>7. DO use turn signals when cycling </strong>to stay in constant communication with other cars, cyclists and pedestrians on the road. The easiest rules to remember are: left arm straight out for a left turn and right arm straight out for a right turn. You can also raise your left arm up in an L shape to show that you're turning right.</p> <p><strong>8. DON'T put yourself in danger just because you have the right of way.</strong> While drivers are responsible for driving safely, road safety is everyone's responsibility. \"We have decades of data to show that expecting people to always act the right way [on the road] does not work,\" Sharp says. </p> <p>By taking ownership of your safety, you are helping to create a safe system, which protects everyone on the road. </p>  <p><em>This story was edited by Meghan Keane. The visual editor is Beck Harlan. We'd love to hear from you. Leave us a voicemail at 202-216-9823, or email us at LifeKit@npr.org.</em></p> <p><em>Listen to Life Kit on </em><em>Apple Podcasts</em><em> and </em><em>Spotify</em><em>, and sign up for our </em><em>newsletter</em><em>. Follow us on Instagram: </em><em>@nprlifekit</em><em>.</em></p>\n</div>\n</div></body></html>",
      "author": "Pien Huang"
    },
    {
      "title": "Strict rules can foster calm classrooms. But some students pay the price",
      "link": "https://www.npr.org/2025/09/25/nx-s1-5459934/school-students-disabilities-discipline",
      "source": "NPR News",
      "pub_time": "2025-09-25T05:00:00-04:00",
      "description": "An Indiana charter school network has won praise for its strong academics. But some students with disabilities struggle to follow the school system's discipline policies.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n<p>Thirteen-year-old Levent goes to an Indianapolis middle school that's been celebrated for its test scores – but he's behind academically. His mother, Shania, believes that's because of how often he's been disciplined and suspended.</p> <p>Levent has ADHD, or attention-deficit/hyperactivity disorder, which his school, Paramount Englewood, has documented as a disability. School records show he has been disciplined for misbehavior like repeatedly disrespecting teachers and for leaving campus during the school day, raising safety<strong> </strong>concerns; he's been suspended for fighting, for \"not following school rules\" when he was already in trouble and for \"horseplaying (fighting) in the restroom.\"</p>\n<p>NPR is referring to both Levent and Shania, as well as the other student and parent in this story, by their middle names because the article describes the students' disabilities and how they have been disciplined at school.</p> <p>It often feels to Levent, who is in eighth grade, like he's being unfairly punished. Take an incident last school year, when he was suspended for wrestling with a classmate.</p> <p>\"It felt like I was getting suspended for just playing around with my friend,\" Levent says.</p> <p>To his mom, when her son gets suspended from school and sent home, it feels like the school is ignoring his disability. Shania says ADHD makes Levent impulsive – and contributes to many of the incidents that get him suspended.</p> <p>\"Why is he getting in trouble for what ADHD looks like?\" she asks.</p> <p>In records, school staff have said they don't believe all of Levent's misbehavior is related to his disability.</p> <p>Nationwide, students with disabilities are suspended at far higher rates than their non-disabled peers.</p> <p>Levent's school is part of a charter network that stands out in Indiana: An NPR analysis of 2024-25 state data found that the system, Paramount Schools of Excellence, suspended students with disabilities about three times as often as the state average.</p>\n<p>Paramount's supporters, including many parents, have praised the network for calm classrooms and strong academic performance, especially among students from low-income families and students of color.</p> <p>But several current and former Paramount parents told NPR that some students – especially those with disabilities – struggle to follow the rules that foster those quiet classrooms.</p> <p>\"It's either you fit this mold or you don't,\" Shania says. \"And if you don't, then we're going to suspend, suspend, suspend.\"</p> <h3 class=\"edTag\">\"Calm\" hallways and very high suspension rates</h3> <p>Paramount Schools of Excellence is a growing charter network in Indiana. As a K-8 charter system, its campuses are privately managed but publicly funded and free to attend.</p> <p>When Paramount CEO Tommy Reddicks describes his schools, one of the first words he uses is calm. The halls are quiet. In classrooms, students are focused on school work. \"We're very much a calm, collected school environment rather than a kind of really jazz you up cheerleading type of environment,\" he says.</p>\n<p>Federal data shows Indiana schools rely on exclusionary discipline like out-of-school suspension more than schools in most other states. And Paramount's suspension rates surpass Indiana's state averages among students with and without disabilities.</p> <p>For every 100 students in general education in the Paramount system, there were about 45 suspensions, according to an NPR analysis of state data from the 2024-25 school year. The statewide average was 10.</p> <p>For every 100 children receiving special education services, there were about 73<strong> </strong>suspensions. The statewide average was 22.</p> <p>This data reflects the total number of suspensions, not the number of students suspended.</p> <p>Reddicks attributes the network's high suspension rates in part to its structured approach, which he believes protects the learning environment and ultimately benefits students, including those with disabilities.</p> <p>\"You know, a lot of our special education incidents typically involve safety of others or safety of the students in question,\" Reddicks explains.</p>\n<p>Reddicks says, and state data confirms, that Paramount schools reduced suspensions among students with disabilities during the 2024-25 school year.</p> <p>He says the decline reflects both the maturing of campuses that opened in recent years and that enrolled first-time Paramount students, as well as the network's focus on training staff to reduce suspensions.</p> <p>When suspensions do happen, Reddicks says he doesn't believe they hold students back.</p> <p>\"We know that, in our more structured system, students with suspensions still perform very well and typically outperform state averages,\" he says.</p> <p>Reddicks shared data from two Paramount schools. It showed students who have been suspended do outperform state averages on standardized tests, but only in some grades. He did not provide data for the network's other campuses, including Paramount Englewood.</p> <h3 class=\"edTag\">Why some families of students with disabilities are drawn to Paramount</h3> <p>For some parents, the discipline policies that help foster Paramount's quiet classrooms are a selling point. It's one reason Nicol, who has sent five children to a Paramount school, kept driving her family there even after she moved across town.</p> <p>\"I like that they're strict,\" Nicol says. \"You walk into Paramount, their kids are sitting at the desk. Their kids are doing what needs to be done.\"</p> <p>Even when her own children have been suspended, Nicol has seen some benefit.</p> <p>Her 12-year-old son, Leon, has autism and other disabilities. Last year, Leon's behavior spiraled after his grandfather died, Nicol says. He began cussing and throwing objects in class. Nicol says that not every suspension he received was necessary but that he should be suspended when he pushes or fights with other students.</p> <p>\"He does need to be held accountable,\" she says. \"Because I don't want to say, 'Oh, well, let's let [Leon] get by with this because he has autism.'\"</p> <p>Overall, Nicol says educators at Paramount have worked hard to meet Leon's needs. She trusts Paramount in part because she believes her two oldest children's experience there set them up to succeed in high school.</p>\n<h3 class=\"edTag\">The costs of missing school</h3> <p>Some experts say that when schools suspend students with disabilities, it's little more than a Band-Aid that gives educators a break from misbehavior and a chance to think through how to respond.</p>\n<p>\"I would say suspension doesn't fix much,\" says Federico Waitoller, a professor of special education at the University of Illinois Chicago. Waitoller says suspensions don't help students with disabilities learn and grow.</p> <p>\"You're not teaching anything, right?\" says Waitoller, a former special educator. \"You're saying, 'Don't do this.' But you're not telling the student what to do, how to do it — and give them the supports to do it.\"</p> <p>Levent's mother, Shania, says that she's seen some of his difficult behavior at home and that she would like him to learn to control his impulses — to stop horseplaying and arguing when adults ask him to do something.</p> <p>But Shania says suspensions do little to teach her son how to behave. And the missed days of school add up. Records show Levent's school suspended him for at least 10 days last school year. Then, after Levent walked off campus a few weeks before the end of the year, he had to spend most of the final days of school at home, where he received about an hour of remote instruction a day, according to school records.</p> <p>All that missed school has taken a toll, Shania says.</p> <p>\"I don't want him to get even further behind,\" she says. \"Because again, this is a kid that's behind.\"</p> <p>Levent started his final year of middle school in August – and already Shania is frustrated by how the school is handling his behavior. She says she's considering pulling him out.</p>\n</div>\n</div></body></html>",
      "author": "Dylan Peers McCoy"
    },
    {
      "title": "A question of intent: Is what's happening in Gaza genocide?",
      "link": "https://www.npr.org/2025/09/25/g-s1-89678/israel-gaza-genocide-debates-united-nations",
      "source": "NPR News",
      "pub_time": "2025-09-25T05:00:00-04:00",
      "description": "As accusations of genocide in Gaza mount against Israel, NPR looks at how the term is defined legally and why previously reticent scholars have changed their minds.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>As world leaders gather in New York this week for the U.N. General Assembly, a growing number of experts are calling on diplomats to address what they describe as genocide and famine in Gaza.</p> <p>Israel strongly rejects accusations that it is guilty of genocide in its nearly two-year campaign in Gaza following the Hamas-led Oct. 7, 2023, attack that killed nearly 1,200 people, with another 250 taken hostage, according to Israeli officials.</p> <p>The Israeli military campaign that followed has killed more than 64,000 people, including more than 18,000 children, according to Gaza health authorities. Almost all of Gaza's estimated 2 million residents have been forced to flee their homes, often multiple times. Many Palestinians, as well as rights groups and some prominent Americans, have said Israel is responsible for genocide in the enclave.</p>\n<p>In the United States, the word has started to enter the public discourse. Polls show Democrats and independents are increasingly likely to describe Israel's actions as genocide, even as Republican views have remained steady.</p> <p>To understand what the term means and how it has become such a battleground, NPR spoke with historians, legal scholars, military analysts and people living through the war. The scholars say it's difficult to hold states legally responsible for any crimes. And some pointed to a thornier issue: the burden of proving that Israel's war in Gaza is motivated by \"genocidal intent.\"</p> <h3 class=\"edTag\">What does genocide mean?</h3>\n<p>The term \"genocide\" was introduced in 1944 by Polish Jewish lawyer Raphael Lemkin to describe the extermination of European Jews during the Holocaust. Lemkin's early exposure to the history of Ottoman attacks on Armenians and the pogroms in Poland was instrumental in shaping his belief that groups needed protection under international law.</p> <p>In 1948, four years later, the United Nations adopted the Convention on the Prevention and Punishment of the Crime of Genocide, often called the Genocide Convention, defining genocide as \"any of the following acts committed with intent to destroy, in whole or in part, a national, ethnical, racial or religious group, as such:</p>\n<p>(a) Killing members of the group;</p> <p>(b) Causing serious bodily or mental harm to members of the group;</p> <p>(c) Deliberately inflicting on the group conditions of life calculated to bring about its physical destruction in whole or in part;</p> <p>(d) Imposing measures intended to prevent births within the group;</p> <p>(e) Forcibly transferring children of the group to another group.\"</p> <p>Both Israel and the U.S. have ratified the convention — Israel in 1950 and the U.S. in 1988.</p> <h3 class=\"edTag\">How are countries tried for genocide in courts?</h3>\n<p>The International Court of Justice (ICJ) in The Hague, Netherlands, handles disputes between countries, including under the Genocide Convention. A separate court, the International Criminal Court, entered into force in 2002 to prosecute individuals for genocide, war crimes and crimes against humanity. But it has no jurisdiction over countries that haven't joined, among them the U.S., Israel, Myanmar and China. Outside the courts, the U.N. Security Council can authorize the protection of civilians, but that power is often paralyzed by the veto powers of the council's five permanent members.</p> <p>In Rwanda, the International Criminal Tribunal for Rwanda ruled that the 1994 mass killings of the Tutsi minority constituted genocide, and it convicted several political and military leaders for organizing and inciting it. In the war following the breakup of the former Yugoslavia, the ICJ found that genocide occurred in 1995 in Srebrenica, where around 8,000 Bosnian Muslims were killed by a Serbian-aligned force. But the court did not hold Serbia directly responsible for committing genocide, only for failing to prevent it.</p> <p>The U.S. has also formally recognized genocides against Armenians and Darfuris. Then-President Barack Obama labeled ISIS's actions genocide, and President Trump<strong> </strong>used the term to describe the situation facing white South Africans.</p> <p>Gambia brought a still-ongoing case against Myanmar to the ICJ in 2019, accusing it of genocide over a military campaign that forced more than 700,000 Rohingya to flee. The U.K. and other states argued in that case that intent could be inferred from the mass displacement and harm to children. Myanmar claims it was targeting terrorists, but the court rejected its bid to throw out the case and is now weighing it on the merits.</p>\n<h3 class=\"edTag\">Why is \"intent\" in genocide cases hard to prove?</h3> <p>Genocide is considered the hardest crime to prove in court.</p> <p>The \"intent\" requirement makes it distinct, said Shannon Fyfe, a legal scholar at Washington and Lee University.</p> <p>\"Proving intent tends to be the most difficult part of any criminal case,\" she said. \"The ICJ says genocidal intent must be the only reasonable inference from the available evidence.\"</p> <p>The Genocide Convention's drafters added \"as such\" to require that acts be carried out because of who the group is, not just to achieve another goal — something judges struggle to assess.</p> <h3 class=\"edTag\">Gaza: Early warnings, early rejections</h3> \n<p>Just days after Israel began its bombing campaign in Gaza, Raz Segal, an Israeli-American scholar of Jewish history and Holocaust and genocide studies, wrote that it represented a \"textbook case of genocide.\"</p> <p>In particular, Segal pointed to what he viewed as a deliberate intent to destroy, citing then-Defense Minister Yoav Gallant's order to impose a siege on the enclave.</p> <p>Shortly after he publicly accused Israel of genocide in Gaza, the University of Minnesota rescinded its offer for him to lead the school's Center for Holocaust and Genocide Studies.</p>\n<p>\"People ask me, 'Wasn't it too soon on Oct. 13?' No. The convention is activated by the risk of genocide, not just its occurrence. That's the whole point of prevention. That's the meaning of 'Never Again,'\" Segal told NPR, referencing a common saying calling for the Holocaust to never be repeated.</p> <p>He added that denying Israel was committing any war crimes, including genocide, allowed for Israel's actions to be justified.</p> <p>\"As if the Hamas-led massacres that day were not terrible enough, Israel and its allies, primarily the United States, including President Biden, immediately started circulating this atrocity propaganda,\" he said. \"The lies and fabrications — like the false claim about beheaded babies — continuously shifted the focus not to Israeli violence but to the alleged barbarity of the Palestinians, to the point where they were seen as a danger that no international law should apply to.\"</p>\n<h3 class=\"edTag\">When did a Palestinian \"genocide\" become a legal claim? A timeline</h3> <p>In November 2023, the Biden administration was named in a federal lawsuit filed by the Center for Constitutional Rights and the law firm Van Der Hout LLP on behalf of Palestinian individuals and the human rights organizations Al-Haq and Defense for Children International-Palestine, along with eight other plaintiffs.</p> <p>The suit alleged that the \"unfolding genocide of the Palestinian people in Gaza has so far been made possible because of the unconditional support\" of President Joe Biden, Secretary of State Antony Blinken and Defense Secretary Lloyd Austin.</p> <p>Laila Elhaddad, a Palestinian American author from Gaza and one of the plaintiffs, went to court on Jan. 26, 2024, and later told NPR that she knew it was a long shot, but she felt \"uniquely obligated, as an American whose taxes were partly financing the killing of my family members,\" to take legal action.</p> <p>She added, \"We as Palestinians understood from the start the intent to genocide. Israeli leaders spelled out exactly what they planned to do and then carried it out. We never expected it to go this far. But with no one to stop Netanyahu and no red lines in place, it was no surprise that he felt emboldened to destroy everything.\"</p> <p>On Jan. 31, 2024, U.S. District Judge Jeffrey White wrote that he found indications that \"the ongoing military siege in Gaza is intended to eradicate a whole people and therefore plausibly falls within the international prohibition against genocide.\" Still, White dismissed the case in 2024, saying the court could not intervene in U.S. foreign policy decisions.</p> <p>For Elhaddad, the ruling was both validating and bitter.</p> <p>\"It was cathartic,\" she said, to testify about what her family had endured. But outside the courtroom, she felt silenced. \"Even using the word 'genocide' in opinion pieces was a no from editors I worked with.\"</p>\n<p>The hearing of Elhaddad's case, along with those of the other plaintiffs, began just hours after the International Court of Justice in The Hague ruled that it is plausible that Israel has violated the terms of the Genocide Convention in the war in Gaza, in a case brought forward by South Africa. The proceedings remain ongoing and have drawn support from more than 25 countries.</p> <p>In its case against Israel, South Africa devotes nine pages to claims of genocidal incitement. The filing says Israeli Prime Minister Benjamin Netanyahu twice referred to the biblical story of Amalek, saying: \"Remember what Amalek has done to you, says our holy Bible. We remember.\" He mentioned Amalek again in a letter to Israeli soldiers and officers.</p> <p>In the Hebrew Bible, Amalek is a figure who tried to destroy the Jewish people. The reference has historically been used by the Israeli far right to justify killing Palestinians.</p>\n<p>Amnesty International was the first major international organization to accuse Israel of carrying out genocide in Gaza. Amnesty International Israel, which publicly disputed the genocide allegation in rare dissent from the global rights group, was later suspended for breaking with that conclusion. Human Rights Watch, B'Tselem, Doctors Without Borders and Physicians for Human Rights–Israel have also accused Israel of committing genocide. Separately, a U.N. commission concluded that Israel has committed four of the five genocidal acts outlined in the Genocide Convention. While such findings carry no enforcement power, they could influence the International Court of Justice and the International Criminal Court.</p> <h3 class=\"edTag\">Arguments against calling it a genocide</h3> \n<p>Israel's defense against the genocide case brought by South Africa rests on two claims: that it lacks genocidal intent and that its actions target legitimate military objectives. It also argues that the case reflects bias, citing a lack of trust in the U.N. and other international bodies.</p> <p>Israel told the court it is fighting a legitimate war of self-defense against Hamas. The Israeli legal team said South Africa's accusations that Israel has intent to destroy the Palestinian people in Gaza are based on comments by Israeli officials that have been taken out of context and are based only on \"random assertions\" in order to show genocidal intent.</p>\n<p>In an interview with NPR's<em> Morning Edition</em>, Amos Yadlin, the former head of Israeli military intelligence, called the charge of genocide \"nonsense,\" saying that the goal is to destroy Hamas, not Palestinians.</p> <p>Eran Shamir-Borer, director of the Israel Democracy Institute's Center for Security and Democracy and former head of the Israel Defense Forces' international law division, defended the legality of Israel's campaign in an email to NPR:</p> <p>\"Available evidence regarding Israel's policies and conduct in the war in Gaza – whether it relies on statements by Israeli officials or on Israel's conduct on the ground – does not suggest that such standards are even close to being met,\" he said, adding that \"jumping straight to the genocide claim not only empties the sacred term of its meaning; it also undermines other categories of potential violations of the law.\"</p> <p>John Spencer, a retired U.S. Army officer who has advised the Israeli military, told <em>Morning Edition</em><em> </em>that Israel is not engaged in genocide and cited \"the mountain of evidence of what Israel is doing to preserve infrastructure, civilian life, to provide services.\"</p> <p>At times during the war, Israel has completely blocked aid from entering Gaza, citing reasons such as pressuring Hamas to surrender and accusing the group of seizing humanitarian supplies. Under pressure from the United States, Israel has allowed some aid into the territory, but humanitarian organizations say the conditions imposed by Israel severely limit the amount that can reach civilians. </p> <p>Israeli officials have not provided public evidence to support their claim that Hamas systematically steals aid. Unlike in previous Gaza conflicts, international journalists are not permitted access to Gaza unless they are embedded with the Israeli military.</p> <p>The U.S. government, under Biden and now under Trump, has firmly supported Israel's military actions, going well beyond diplomatic statements and even imposing sanctions on International Criminal Court judges and prosecutors, U.N. official Francesca Albanese and nongovernmental human rights organizations like Al-Haq.</p>\n<p>Since the outbreak of the war in 2023, the U.S. government has sold at least $30 billion in weapons to Israel, delivered more than 90,000 tons of weapons and provided the Israeli government with $12.5 billion in funds to purchase weapons.</p> <h3 class=\"edTag\">Legal definitions and political justifications</h3> \n<p>As scholars grapple with whether the war in Gaza is genocide, they return to the question of intent.</p> <p>Fyfe, the Washington and Lee University legal scholar, said, \"Genocide can occur within or outside of war. But it is never permissible, even if the war itself is. So war is not a defense. If the legal elements are met, they are met, regardless of other circumstances.\"</p> <p>On intent, she said, \"If a military leader intends to gain land and removing a group is the only way to do it, that's not necessarily genocide. But if the only reasonable inference from a siege or campaign is that the group itself is being destroyed as such, then that is genocidal intent.\"</p> <p>In Gaza, she said, that distinction has blurred.</p> <p>\"There are statements from Israeli officials that suggest intent to destroy, but it's not always clear if they mean Hamas or Gazans,\" she said. \"But I do not think it is reasonable to claim that the siege is a military objective, given that Hamas is already crippled.\"</p> <p>\"So it may be that the only reasonable inference that can be made about the siege is that it reflects genocidal intent. Objective behavior can, and may here, stand in for objective statements.\"</p> <p>\"Each Israeli strike may be a war crime, but serially they've destroyed more than 70% of Gaza's buildings and killed tens of thousands, mainly civilians,\" said A. Dirk Moses, Spitzer professor of international relations at City College of New York and editor of the <em>Journal of Genocide Research</em>. \"In no way can this outcome be seen as collateral.\"</p>\n<p>He also said that it is often forgotten that the Genocide Convention includes the destruction of a group \"in whole or in part.\" \"In Srebrenica, 'only' 8,000 men and boys were killed, but they were deemed a substantial part of the Bosnian population. That was enough for a genocide ruling.\"</p> <p>Sonia Boulos, a professor of international human rights law at Nebrija University in Spain, argued that Israel's justification — that Hamas uses civilians as human shields — has functioned to deny Palestinians civilian status altogether.</p> <p>\"Even if one were to accept the premise that Hamas uses civilians as human shields, that fact does not alter the genocidal nature of rhetoric that dehumanizes Palestinians as 'human animals,' calls for the complete destruction of Gaza or invokes biblical references to Amalek,\" she said.</p> <p>\"Such utterances are not only genocidal in nature — they help explain the apocalyptic reality currently unfolding in Gaza,\" Boulos said.</p> <h3 class=\"edTag\">What led two scholars to change their minds about Gaza?</h3> \n<p>Some scholars who initially rejected or avoided the term \"genocide\" have since shifted their stance, citing mass civilian killings, widespread destruction and restrictions on humanitarian aid as key reasons for their change.</p>\n<p>Omer Bartov, an Israeli-born genocide scholar and military veteran, was among those who reconsidered his position. \"There were people who expected that there would be genocide right away. There are people who think that Israel has always been involved in genocide. And I did not think that,\" he said in a <em>Morning Edition</em> interview. But he added that he found evidence and came to his conclusion in May 2024. \"I asked myself: What is actually the goal of what the [Israel Defense Forces] is doing? Is it what it said — to destroy Hamas and to release the hostages? Or is it something else?\"</p> <p>In May 2024, nearly 1 million Palestinians were displaced from the southern city of Rafah and northern Gaza after Israeli forces issued evacuation orders. By August of that year, Rafah, once home to about 275,000 people, had been reduced to a desolate landscape of rubble. Many of those who fled south to areas deemed \"safe\" from the heavy bombardment in the north found little to no protection there.</p> <p>Dov Waxman, a British-American professor of Israel studies at the University of California, Los Angeles, has also revised his stance after once publicly disputing Raz Segal's early claim that Israel was engaged in genocide. As of this writing, he is the only U.S.-based scholar in the field of Israel studies — an academic discipline focused on the history, politics and culture of contemporary Israel — to have done so publicly.</p> <p>\"I struggled to accept the possibility that Jews, the victims of genocide, could become perpetrators of genocide,\" Waxman said.</p> <p>\"As the months passed and the death and destruction mounted, I understood why experts were calling it genocide, but I still wasn't convinced,\" Waxman said, adding that his turning point came in March 2025, when Israel broke a ceasefire, cut off humanitarian aid and resumed its offensive.</p>\n<p><strong>\"</strong>Deliberately making it impossible for Palestinians to live as a group in Gaza crosses the legal threshold for genocide,\" Waxman said.</p> <p>Israeli officials have considered plans for pushing Palestinians out of Gaza since the early days of the war, and a proposal by Trump to build a \"Riviera\" in Gaza has added momentum.</p> <h3 class=\"edTag\">How the war in Gaza is changing the discourse about genocide </h3> \n<p>Sen. Bernie Sanders, I-Vt., said on Sept. 17 that Israel's actions in Gaza constitute a genocide, marking the first time the longtime senator has used the term to describe the war.  Rep. Marjorie Taylor Greene, R-Ga., and Rep. Alexandria Ocasio-Cortez, D-N.Y., have also called it genocide.</p> <p>Cultural figures such as YouTuber Ms. Rachel, comedian Theo Von — who has interviewed Trump and built a MAGA-friendly following — and Joe Rogan, the world's most popular podcaster, have also used the term.</p>\n<p>David Simon, director of the Genocide Studies Program at Yale University, says the word's use itself has surged in the public discourse. He links the rise to a broader awareness sparked first by Russia's 2022 invasion of Ukraine and again by images of Gaza's famine and destruction.</p> <p>\"Some of this may be driven by the images and reporting on the famine, which paint a much more vivid picture of the threat to human life than does mere statistics. But also, people considering the element of 'intent to destroy' that is part of the U.N. definition of genocide seem to find it more consistently now, in the context of a man-made famine, than they did with respect to the previous elements of conflict, which at least from a distance read more as 'war.'\"</p> <p>In an August 2025 <em>Economist/</em>YouGov poll, 69% of Democrats and 44% of independents said that Israel was committing genocide against Palestinian civilians. In a January 2024 survey from the same pollsters, only 45% of Democrats and 29% of independents said Israel was committing genocide. The percentage of Republicans who thought that genocide was being committed against Palestinians was unchanged at 17%.</p> <p>In Israel, only a minority of the population shares that view.</p> <p>A survey conducted in March 2025 and the subject of an essay in <em>Haaretz</em> newspaper found that 82% of Jewish Israelis polled backed the expulsion of Gazans and that nearly half, 47%, said they supported killing all Palestinians in \"enemy cities captured by the Israeli army.\"</p> <p>Martin Shaw, a historical sociologist and the author of <em>What Is Genocide? </em>and<em> The New Age of Genocide: Intellectual and Political Challenges After Gaza</em>, says that the public discourse reveals how \"some people still think that only events like the Holocaust count as genocide, which no expert would argue. Gaza is different from the Holocaust, but it is still a deliberate attempt to destroy a people, which is the meaning of genocide.\"</p> <p>Shaw, who wrote early in the war that Hamas' killings of Israeli civilians constituted \"genocidal massacres\" and who now believes Gaza is experiencing a genocide, said there is a new dynamic in how the public understanding of the word is being shaped. Israel, he said, believed that by banning international journalists from entering Gaza, \"it could prevent the world from seeing its atrocities.\"</p>\n<p>\"It has tried to kill local Palestinian journalists,\" he said, \"but so many ordinary people in Gaza have filmed what Israel is doing that the world has seen it nevertheless.\"</p> <p>Israel denies deliberately targeting journalists. International news agencies have criticized past Israeli investigations into its military, stating in a recent joint letter following Israeli strikes that killed five journalists in Gaza that such investigations \"rarely result in clarity and action.\"</p> <p>The Committee to Protect Journalists says the war in Gaza is the deadliest conflict for journalists since it started gathering data in 1992.</p>\n<p>Simon, of Yale University, observes that media blackouts are not new. But in the case of Gaza, \"having social media serve as the source of information has made it much harder to agree on the basic understanding of what's actually been going on, and [has] added more to the algorithmic amplification that contributed to the acute polarization over the past two years.\"</p> <h3 class=\"edTag\">Beyond debates</h3> \n<p>For many Palestinians, the public debates over the word are not just an abstract concept.</p> <p>Elhaddad told NPR that since the 2023 lawsuit against the Biden administration — at which time at least 86 of her relatives had been killed — Israeli airstrikes, drones and shootings at the Gaza Humanitarian Foundation's food distribution sites have raised the death toll on her mother's side to 200. She shared a spreadsheet detailing the deaths, including notes when she was able to get them.</p> <p>\"It felt like the ground was moving beneath my feet, as if everything that made my parents' home familiar was being systematically erased,\" said Elhaddad.</p> <p>Now that more prominent figures of different political persuasions have slowly begun to call Israel's actions in Gaza a \"genocide,\" Elhaddad said, she has felt recognition of her own story.</p> <p>\"The tragedy is that it took over 60,000 Palestinian bodies and a full-blown starvation to reach this conclusion,\" she said.</p> <p><em>This story was edited by Tony Cavin, Nishant Dahiya, James Hider. For more coverage, as well as for differing views and analysis of the conflict, please visit NPR's special series </em><em>Middle East conflict</em><em>.</em></p>\n</div>\n</div></body></html>",
      "author": "Majd Al-Waheidi"
    },
    {
      "title": "White House threatens layoffs -- not furloughs -- if the government shuts down",
      "link": "https://www.npr.org/2025/09/24/nx-s1-5552789/trump-government-shutdown-plan-memo",
      "source": "NPR News",
      "pub_time": "2025-09-24T23:28:19-04:00",
      "description": "In past government shutdowns, workers have been put on temporary furloughs until funding resumes. This time, the Trump White House is looking for bigger and more permanent cuts, a new memo shows.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>If the government shuts down on Oct. 1, the White House said it will look for ways to use the funding dispute to permanently eliminate some federal workers, rather than just temporarily send them home on unpaid leave.</p>\n<p>This proposed \"reduction in force\" — outlined in a memo obtained by NPR on Wednesday — would be a significant shift from past government shutdowns, when employees have been temporarily furloughed until a budget deal is reached.</p> <p>The White House Office of Management and Budget told agency heads that a funding lapse would give the administration the chance to issue \"reduction in force\" (RIF) notices to people who work on programs that are \"not consistent with the president's priorities.\" The plans were first reported by Politico.</p>\n<p>It's the latest push by President Trump's budget director, Russell Vought, to aggressively cut government programs created and funded by Congress, including foreign aid, spending on electric vehicle charging stations, and funding for the Corporation for Public Broadcasting. Vought has argued that presidents – rather than Congress – have considerable power to control more spending, Democrats and the nonpartisan Government Accountability Office (GAO) have disagreed.</p> <p>House Republicans have passed a bill that would fund the government at current levels through Nov. 21. But in the Senate, where 60 votes are required to pass the bill, Democrats have insisted on adding a number of measures, including subsidies for Affordable Care Act insurance premiums. They are set to expire, hitting Americans who buy insurance on the Obamacare exchanges with shocking price increases this year.</p> <h3 class=\"edTag\">Schumer calls the memo 'an attempt at intimidation'</h3> <p>Democratic leaders had been set to sit down with Trump on Thursday to talk about the issues, but Trump canceled the meeting, saying Democrats were making \"unserious and ridiculous demands.\"</p> <p>The White House said it supports the bill passed by House Republicans. In the memo, the OMB said its layoff notices could be avoided if Democrats decide to support the bill.</p>\n<p>Senate Minority Leader Chuck Schumer, D-N.Y., called the memo \"an attempt at intimidation\" in a statement released late Wednesday night.</p> <p>\"This is nothing new and has nothing to do with funding the government,\" Schumer wrote. \"These unnecessary firings will either be overturned in court or the administration will end up hiring the workers back, just like they did as recently as today.\"</p> <p>Congressional Democrats are under intense pressure from their voters to stand up to Trump after they provided the votes to pass a six-month spending bill in March.</p>\n<p>At the time, Schumer said that a shutdown would give Trump the power to pick and choose what departments and agencies to reopen.</p> <p>The plan for layoff notices is a break from the Trump administration's approach during his first term. In 2018, Trump refused to sign a bipartisan stopgap government funding bill because it didn't include funding for his border wall, sparking a 35-day shutdown, the longest on record. But the administration worked to reduce the pain from the shutdown by keeping as much of the government open as possible, and pledging to give furloughed workers back pay as quickly as possible.</p>\n</div>\n</div></body></html>",
      "author": "Tamara Keith"
    },
    {
      "title": "For the first time in nearly 6 decades, a Syrian president steps up to speak at the U.N.",
      "link": "https://www.npr.org/2025/09/24/g-s1-90401/syrian-president-ahmad-al-sharaa-united-nations-general-assembly",
      "source": "NPR News",
      "pub_time": "2025-09-24T19:42:45-04:00",
      "description": "Turning the page on decades of distance, Syria's President Ahmad al-Sharaa addressed the U.N. General Assembly, marking the first time any president from his country has done so in almost 60 years.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>UNITED NATIONS — Turning the page on decades of distance, Syria's president addressed the U.N. General Assembly on Wednesday, marking the first time any president from his country has done so in almost 60 years. As he spoke, hundreds of people gathered in front of giant screens in Syrian cities and towns to witness the speech while waving the country's flags.</p>\n<p>Ahmad al-Sharaa said Syria is returning to the international community after six decades of dictatorship that killed 1 million people and tortured hundreds of thousands. \"Syria is reclaiming its rightful place among the nations of the world,\" he told the assembly's annual gathering of world leaders.</p> <p>Al-Sharaa became the first Syrian head of state to speak at the United Nations since Noureddine Attasi gave a speech in 1967 shortly after the Arab-Israeli war, during which Damascus lost control of the Golan Heights that Israel later annexed in 1981.</p>\n<p>Since the Assad family came to power in Syria in 1970 in a bloodless coup that overthrew Attasi, relations with the United States have been mostly cold as Damascus was an ally of the former Soviet Union. Over the past decades, it was foreign ministers of Syria who represented the country at the U.N. General Assembly.</p> <h3 class=\"edTag\">An appearance after the collapse of the Assad family's regime</h3> <p>The Assad family dynasty's autocratic, repressive 54-year rule in Syria abruptly collapsed in December, when then-President Bashar Assad was ousted in a lightning insurgent offensive led by al-Sharaa. Assad's fall marked a major shift in the 14-year civil war.</p> <p>Al-Sharaa blasted Israel in his speech saying that it did not stop its threats to his country since the fall of Assad adding that its policies \"contradict with the international community's support to Syria and its people\" in what endangers the region and could make enter conflicts that no one know how they could end.</p> <p>Negotiations have been underway for a security deal that al-Sharaa has said he hopes will bring about a withdrawal of Israeli forces and return to a 1974 disengagement agreement. While al-Sharaa said last week that a deal could be reached in a matter of days, Israeli Prime Minister Benjamin Netanyahu in remarks Sunday appeared to downplay the odds of a breakthrough.</p>\n<p>Later Wednesday, Netanyahu's office said in a statement that negotiations are underway with Syria adding that their conclusion \"involves ensuring Israel's interests, which include, among other things, the demilitarization of southwestern Syria and maintaining the safety and security of the Druze in Syria.\"</p>\n<p>Since assuming power, al-Sharaa has preached coexistence and sought to reassure Syria's minority communities, but the country has been threatened by outbreaks of sectarian violence that left hundreds dead earlier this year. Gunmen affiliated with the new government were also accused of atrocities against civilians from the Druze and Alawite religious minorities in southern Syria's Sweida province and the coastal region.</p> <p>Al-Sharaa said in his speech that the Syrian state has worked on forming fact-finding missions and gave the United Nations the right to investigate the killings that took place this year adding: \"I promise to bring anyone whose hands are tainted with the blood of Syrian people to justice.\"</p>\n<h3 class=\"edTag\">The fight against drugs has progressed</h3> <p>Al-Sharaa said that the new authorities in Syria have destroyed the drugs business that Assad used to fund his government as it was under harsh Western sanctions that, along with the war, paralyzed the economy. Assad's fall revealed industrial-scale manufacturing facilities of the amphetamine-like stimulant Captagon, also known as fenethylline, which experts say fed a $10 billion annual global trade in the highly addictive drug.</p> <p>Over the past months, Syrian authorities have closed Captagon factories in different parts of Syria part of their campaign to end the illegal trade.</p> <p>Al-Sharaa urged Western countries to lift the sanctions that were imposed on Assad, saying, \"We call for lifting them completely so that they are not a tool to shackle the Syrian people.\"</p>\n<p>President Trump met with al-Sharaa in Saudi Arabia in May and announced that he would lift decades of sanctions imposed on Syria under the Assad's rule. He followed through by ordering a large swath of sanctions lifted or waived.</p>\n<p>However, the most stringent sanctions were imposed by Congress under the Caesar Syria Civilian Protection Act passed in 2019 and will require a congressional vote to permanently remove them.</p> <p>Speaking to reporters outside the U.N. building after giving his speech, al-Sharaa said that he hopes that the sanctions would eventually be lifted adding that the majority of Congress members are for lifting the Congress under the Caesar Syria Civilian Protection Act.</p> <p>\"Syria does not wish the pain it passed through for anyone. We are among the most people who feel the suffering of war and destruction,\" al-Sharaa said. \"Therefore we support the people of Gaza.\"</p> <h3 class=\"edTag\">Syrian divisions manifest in New York</h3> <p>In Damascus, cheering crowds gathered in the central Umayyad Square to celebrate al-Sharaa's speech. At Dag Hammarskjöld Plaza square in New York, members of the Syrian diaspora faced off in dueling demonstrations, one in support of the new authorities in Damascus and one against.</p>\n<p>Pro-government demonstrators hoisted the three-starred \"revolution flag\" that has now become the official flag of Syria. On the other side, many lifted the five-color Druze flag. Some shouted and cursed at each other across the barricades.</p> <p>On the Druze side, Farah Taki, originally from Sweida, said her aunts there were displaced by the recent violence and she had come from Chicago to protest al-Sharaa's visit.</p> <p>\"It's disgrace that New York is welcoming an ex-Qaida member at the U.N., and allowing him even to speak,\" she said. The insurgent group that al-Sharaa formerly led was once affiliated with al-Qaida but later cut ties.</p>\n<p>On the other side of the barricades, Dina Keenawari, a Syrian American originally from Damascus, had come from Florida to show her support for al-Sharaa.</p> <p>\"We've lived under tyranny for the past 50 years, and now we're turning a new chapter and we're looking forward,\" she said. \"And we're proud of him.\"</p>\n</div>\n</div></body></html>",
      "author": "The Associated Press"
    },
    {
      "title": "Victim's widow files the first lawsuit after January's D.C.-area midair crash",
      "link": "https://www.npr.org/2025/09/24/nx-s1-5552694/american-airlines-army-black-hawk-dca-midair-collision-lawsuit",
      "source": "NPR News",
      "pub_time": "2025-09-24T18:06:59-04:00",
      "description": "Family members of a passenger who died in the January collision are suing American Airlines, PSA Airlines, and the federal government. It's the first of what could be dozens of lawsuits.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>WASHINGTON — Casey Crafton was one of 60 passengers who were killed when an American Airlines regional jet collided with a U.S. Army Blackhawk helicopter near Washington, D.C. in January.</p>\n<p>On Wednesday, his wife Rachel Crafton became the first family member to file a wrongful death lawsuit.</p> <p>\"Casey was a devoted father and husband, and we built a beautiful life together,\" Rachel Crafton said in prepared remarks. \"Our lives were shattered in a moment, and the grief has been unimaginable.\"</p> <p>The lawsuit, filed in federal court in Washington, D.C. on Wednesday, names American Airlines and PSA Airlines, the regional carrier that operated the flight, as defendants, along with the federal government. It's the first of what are expected to be dozens of similar suits.</p>\n<p>A total of 67 people, including the crew of the helicopter and the regional jet, died in the collision near Ronald Reagan Washington National Airport, making it the deadliest air traffic disaster in the U.S. in decades. On Jan. 29., the jet had been cleared to land when the Army helicopter, which was on a nighttime training mission, struck the plane at an altitude of 278 feet. Both aircraft plunged into the Potomac River.</p> <p>Federal investigators at the National Transportation Safety Board held a three-day hearing on the collision in August. So far, that investigation has revealed problems with the altimeters in the Army helicopter, which gave incorrect altitude readouts to the Black Hawk pilots. There were also serious concerns about numerous near misses at the airport that predated the crash.</p>\n<p>Lawyers for the plaintiffs argue that American Airlines should be held liable, as well.</p> <p>\"The crash of American Eagle 5342 was predictable, it was preventable, and caused the needless loss of 67 lives on that fateful evening,\" said Robert Clifford, a lawyer representing the Crafton family, at a press conference in Washington.</p> <p>Clifford argues that the airline did not adequately train its crew on how to safely navigate congestion around DCA, and that its efforts to maximize the number of flights in and out of the airport amount to \"corporate negligence.\"</p>\n<p>American Airlines immediately pushed back.</p> <p>\"American has a strong track record of putting the safety of our customers and team members above everything else,\" the company said in a statement. \"We continue to support the ongoing NTSB investigation and will defend American and PSA Airlines against any legal action claiming the airline caused or contributed to this accident.\"</p>\n<p>Several dozen family members of other crash victims also attended the press conference to show their support for the Crafton family.</p> <p>\"Many of us have been asked whether we dread the idea of rehashing the worst days of our lives in court,\" said Doug Lane, whose wife Christine Conrad Lane and son Spencer Seojin Lane died in the collision. \"We are here to see this process through, however long it takes, to ensure that our family members have a lasting legacy that makes the world safer for everyone who flies.\"</p>\n</div>\n</div></body></html>",
      "author": "Joel Rose"
    },
    {
      "title": "As AI advances, doomers warn the superintelligence apocalypse is nigh",
      "link": "https://www.npr.org/2025/09/24/nx-s1-5501544/ai-doomers-superintelligence-apocalypse",
      "source": "NPR News",
      "pub_time": "2025-09-24T16:21:33-04:00",
      "description": "AI is advancing fast, and AI doomers say humanity is at risk.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n\n<p>What happens when we make an artificial intelligence that's smarter than us? Some AI researchers have long warned that moment will mean humanity's doom.</p> <p>Now that AI is rapidly advancing, some \"AI Doomers\" say it's time to hit the brakes. They say the machine learning revolution that led to everyday AI models such as ChatGPT has also made it harder to figure out how to \"align\" artificial intelligence with our interests – namely, keeping AI from outsmarting humans. Researchers into AI safety say there's a chance that such a superhuman intelligence would act quickly to wipe us out.</p> <p>NPR's Martin Kaste reports on the tensions in Silicon Valley over AI safety.</p>\n<p>For a more detailed discussion on the arguments for — and against — AI doom, please listen to this special episode of <em>NPR Explains:</em></p>   <p>And for the truly curious, a reading list:</p> <p>The abbreviated version of the \"Everyone Dies\" argument, in the Atlantic.</p> <p>The \"useful idiots\" rebuttal, also in the Atlantic</p> <p>The potential timeline of an AI takeover</p> <p>Research into \"AI Faking\" and deception</p> <p>Smith College economics professor James Miller reflects on the game theory of expecting AI apocalypse, while hoping for AI salvation</p> <p>Maybe AI isn't speeding up smarter AI, at least not yet. Research from METR</p> <p>Analysis — and skepticism — from experts about the near-term likelihood of human- or superhuman-level artificial intelligence<br/></p>\n</div>\n</div></body></html>",
      "author": "Martin Kaste"
    }
  ]
}