{
  "title": "NPR News",
  "link": "https://www.npr.org/",
  "description": "Latest news from NPR",
  "items": [
    {
      "title": "Camp Mystic plans to reopen in Texas next summer, a year after floods killed 27",
      "link": "https://www.npr.org/2025/09/23/nx-s1-5551334/camp-mystic-plans-to-reopen-in-texas-next-summer-a-year-after-floods-killed-27",
      "source": "NPR News",
      "pub_time": "2025-09-23T23:48:42-04:00",
      "description": "Camp Mystic plans to reopen next summer near the site where 27 girls and counselors died in a July flood.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>Camp Mystic plans to reopen next summer near the site where 27 girls and counselors died in a July flood.</p> <p>The campers and counselors were swept to their deaths when fast-rising floodwaters of the Guadalupe River roared through the girls' summer camp in a low-lying area known as flash flood alley. All told, the destructive flooding in Texas on the Fourth of July killed at least 136 people and washed away homes and vehicles.</p>\n<p>In an email sent Monday to the families of the victims, the camp said when it reopens, its planning and procedures will follow the \"requirements of the camp safety legislation you bravely championed.\" About an hour later, the camp sent an email to the rest of the families announcing the decision.</p> <p>The camp also announced that it will build a memorial to the girls who died in the flooding.</p> <p>\"In the memorial's design, we will strive to capture the beauty, kindness and grace they all shared, while focusing on the joy they carried and will always inspire in us all,\" the email said.</p>\n<p>Camp Mystic parents successfully pushed for Texas to pass bills aimed at preventing similar tragedies. The measures aim to improve the safety of children's camps by prohibiting cabins in dangerous parts of flood zones and requiring camp operators to develop detailed emergency plans, to train workers and to install and maintain emergency warning systems. One allocates $240 million from the state's rainy day fund for disaster relief, along with money for warning sirens and improved weather forecasting.</p> <p>\"It will hurt my family forever that, for reasons I still do not know, these protections were not in place nor thought out thoroughly for my daughter and the rest of the girls here,\" he said. \"Please pass this bill, protect our kids and do not let their deaths be in vain.\"</p>\n<p>The announcement means that Camp Mystic Cypress Lake, a sister site that opened to campers in 2020, will reopen next summer. But the 99-year-old Camp Mystic Guadalupe was too damaged to open next summer, according to the camp.</p> <p>The email said leaders are \"working with engineers and other experts to determine how we will implement the changes required\" under the newly passed bills.</p>\n</div>\n</div></body></html>",
      "author": "The Associated Press"
    },
    {
      "title": "Want a seat at this synagogue for the High Holidays? You have to register to vote first",
      "link": "https://www.npr.org/2025/09/23/nx-s1-5539314/want-a-seat-at-this-synagogue-for-the-high-holidays-you-have-to-register-to-vote-first",
      "source": "NPR News",
      "pub_time": "2025-09-23T17:08:35-04:00",
      "description": "A Brooklyn synagogue has taken an unusual step by requiring congregants to show proof of voter registration in order to secure seats for High Holidays. Their biggest concern? The city's mayoral seat.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>Two and a half weeks before the start of the Jewish New Year, Congregation Shaare Zion in Brooklyn sent out a letter to its congregants with an unprecedented request. It said that in order to secure seats for High Holidays services — the holiest days of the Jewish year — you must show proof of voter registration.</p> <p>The synagogue's letter comes weeks before New York City's mayoral election on November 4. It reads in part, \"We believe we must put in our best effort to try to avoid a very serious danger that can affect all of us.\"</p>\n<p>The letter does not mention any candidate by name. Nor does it tell congregants what party to register with, or who to vote for or against. But it does warn that the outcome of the election could result in \"very serious problems\" for the Jewish community, and that as a result the synagogue had no choice but to make this requirement.</p> <p>Shaare Zion is the largest Syrian synagogue in New York City, and an important and influential part of the Sephardic Jewish community. That includes Jews with roots in the Iberian Peninsula, and sometimes Mizrahi Jews from the Middle East and North Africa.</p> <h3 class=\"edTag\">Synagogue-state relations</h3> <p>Scholars who study church-state relations say they cannot recall another house of worship ever taking this kind of step.</p> <p>\"Asking a congregant to register with the implications that it's for the mayoral election in a Jewish congregation implies very much a divine sanction for voting and perhaps leaning one way or the other,\" said Mark Valeri, professor of religion and politics at Washington University in St. Louis.</p> <p>\"My surmise is there is fear of [Zohran] Mamdani being elected,\" said Valeri.</p> <p>Mark Treyger is CEO of the Jewish Community Relations Council and a former city councilmember who represented the south Brooklyn district that includes Shaare Zion. He says the concerns raised in the letter are ones he's heard elsewhere about Mamdani, who won the Democratic primary in June.</p>\n<p>\"Given his victory, it has compounded existing concerns that were raised before this primary occurred about public safety and the future of policing and how to handle protests and how to protect shuls [synagogues] and schools,\" said Treyger.</p> <h3 class=\"edTag\">Is it religiously permissible?</h3> <p>Even with these concerns in mind, there are lingering questions about a synagogue's ability to require voter registration.</p> <p>Valeri says because of the letter's careful wording — it doesn't name a candidate or tell people how to vote — there's no obvious legal issue with it.</p> <p>Religiously, the question is different.</p> <p>\"It is terribly unusual,\" said Rabbi David Bleich, a high ranking and respected rabbinical authority at Yeshiva University in New York. \"The question isn't whether it's unusual — it's whether it's permissible.\"</p> <p>By \"permissible,\" Bleich means according to Jewish law.</p> <p>\"On what grounds would a religious organization impose all sorts of conditions that have nothing to do with religion or spirituality?\" said Bleich.</p> <p>Rabbi Bleich says synagogues often have membership requirements. And — he thinks people <em>should </em>vote. But combining the two – having requirements in order to attend services? It doesn't sit well with him.</p> <p>\"The only way they can even work under any kind of color of religious right is by claiming that these people are in violation of a religious duty,\" said Bleich. \"And I respond by asking — do you require that any Jew entering be a Sabbath observer also? It's a little bit ludicrous.\"</p>\n</div>\n</div></body></html>",
      "author": "Sarah Ventre"
    },
    {
      "title": "Trump, in major shift, suggests Ukraine can win back territory long held by Russia",
      "link": "https://www.npr.org/2025/09/23/nx-s1-5551269/trump-ukraine-territory",
      "source": "NPR News",
      "pub_time": "2025-09-23T16:57:42-04:00",
      "description": "Last month, President Trump said Ukraine needed to be open to giving up some of its territory in peace talks with Russia. But those talks haven't happened. Now, he says Ukraine could win it all back.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>President Trump on Tuesday shifted his position on whether Ukraine should hold out for all the territory seized by Russia, saying on social media that he thinks Ukraine is in a position to win it all back.</p>\n<p>It's a reversal from his long-held position that Kyiv would need to give up some of its territory to Moscow to end the war – such as Crimea, which Russia annexed in 2014.</p> <p>But now, \"after getting to know and fully understand the Ukraine/Russia Military and Economic situation,\" Trump said he believes Ukraine – backed by the European Union and NATO – can win back all its territory.</p> <p>\"Why not?\" he said in a post after he met Ukrainian President Volodymyr Zelenskyy on the sidelines of the U.N. General Assembly, even suggesting that Ukraine could \"maybe even go further than that!\"</p>\n<p>The reversal is the latest example of how Trump has swung between deference, frustration and indirect threats against Russia. Early in his second term, Trump boasted that his close relationship with Russian President Vladimir Putin would help him broker a quick resolution to the conflict.</p> <p>But as the war dragged on, Trump has grown increasingly frustrated with Putin. In July, during a meeting with the NATO Secretary General, Trump lashed out at Putin and announced that he was sending Patriot air defense missiles to Ukraine.</p>\n<p>As recently as last month – when Trump met Putin in Alaska to try to broker an end to the war – Trump had said he believed \"some land-swapping\" would take place. Zelenskyy has been resistant to that idea.</p>\n<p>Afterward, Trump said the two countries needed to discuss \"the possible exchanges of territory, taking into consideration the current line of contact. That means, the war zone.\"</p> <p>But since the Alaska talks, there have been no signs that Putin is willing to meet Zelenskyy. Russia has ramped up its strikes on Ukraine, and there have been a series of incursions by Russian military aircraft into NATO airspace in the month since the talks.</p> <p>Trump said he thinks NATO members should shoot down Russian aircraft in such cases. \"Yes, I do,\" he said in answer to a question from a reporter.</p>\n<p>Asked whether he would back up NATO allies if that happened, Trump said: \"Depends on the circumstance, but you know we're very strong toward NATO.\"</p> <p>In his social media post, Trump said Russia looks like \"a paper tiger\" because the war has dragged on for so long, and said that the United States would continue to supply weapons to NATO. \"Good luck to all!\" Trump said.</p> <p>Trump has so far resisted calls for tougher sanctions, insisting that European leaders first need to stop buying oil from Russia, as well as apply steep tariffs for major buyers of Russian oil, like China.</p>\n<p>In a pointed speech to world leaders at the United Nations General Assembly on Tuesday, Trump said it was inexcusable that some NATO members were still buying Russian energy. \"Think of it: they're funding the war against themselves. Who the hell ever heard of that one?\"</p> <p>Zelenskyy said he was hoping to see more sanctions on Russia, and said he supported Trump's push to get NATO members to stop buying Russian energy.</p> <p>Zelenskyy said he had spoken with Slovakia's prime minister who seemed open to cutting off its imports. \"I'm not sure the Hungarians are ready,\" Zelenskyy said. Trump said he hasn't spoken to Hungarian Prime Minister Viktor Orban about it yet. \"I had a feeling if I did, he might stop,\" Trump said.</p>\n</div>\n</div></body></html>",
      "author": "Franco Ordoñez"
    },
    {
      "title": "MLB will allow players to challenge balls and strikes starting in 2026",
      "link": "https://www.npr.org/2025/09/23/nx-s1-5551259/mlb-will-allow-players-to-challenge-balls-and-strikes-starting-in-2026",
      "source": "NPR News",
      "pub_time": "2025-09-23T16:55:37-04:00",
      "description": "With a tap of their head, players will be able to trigger an automated review when they disagree with an umpire's call. In spring training this year, just over half of challenges were successful.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>Starting in the 2026 season, Major League Baseball players will be able to challenge called balls and strikes in regular and postseason games for the first time.</p>\n<p>The widely expected adoption of the challenge system — which is powered by baseball's automated strike zone, known as ABS — was announced Tuesday after years of testing in the minor leagues and a major-league debut this year in spring training and the All-Star Game.</p> <p>The new system \"[strikes] the right balance of preserving the integral role of the umpire in the game with the ability to correct a missed call in a high-leverage situation, all while preserving the pace and rhythm of the game,\" said MLB commissioner Rob Manfred in a press release.</p>\n<p>Only batters, pitchers and catchers are allowed to challenge the umpire's call. The challenge, indicated by a player tapping his head, must be made immediately after the call of ball or strike. Afterward, an automated video will play on the scoreboard showing the location of the pitch and strike zone as detected by a series of 12 cameras placed around every ballpark.</p> \n<p>Each team will begin each game with two challenges. If a call is overturned, the team retains that challenge; if a call is upheld, the team loses that challenge. Once a team loses both its challenges, no player can challenge any more calls.</p>\n<p>Tayler Saucedo, a relief pitcher who played with the Seattle Mariners this season, says he's glad it's coming to the Major Leagues after some initial reluctance. \"I was always anti ABS but after experiencing it this year this will be a great change and fans will love it as well,\" he posted on X. \"Also felt it made umpires better. Doesn't slow down the game at all and it takes about in total 10 seconds.\" </p> <p>In spring training this year, players collectively challenged more than 1,000 balls and strikes. The umpire's calls were overturned just over half the time. Catchers, correct 56% of the time, were the most effective at challenging, and pitchers, at 41%, were the least. MLB reported that each challenge added around 14 seconds to the duration of a game.</p>\n<p>Most MLB players have already experienced the ABS challenge system, whether in spring training this season or during their time in the minor leagues, where MLB has been testing ABS since 2021.</p> <p>John Stanton, the owner of the Seattle Mariners, called the system a \"big step forward for the game.\"</p> <p>\"ABS Challenge strikes the right balance of putting a tool in the players' hands to correct a missed call in a high leverage spot while retaining the human element of the game and adding a new fan-friendly engagement moment,\" said Stanton, who is also currently the chairman of MLB's joint competition committee, a rotating group of six team owners, four active players and one active umpire that votes on new rules.</p> \n<p>Replay review has been part of baseball since 2008, when MLB first allowed the use of video to review home runs. Since then, replay review has widened to include many other types of calls, including force-outs on bases and whether fly balls were caught before touching the ground.</p> <p>Called balls and strikes, though, were long accepted as a \"human element\" of the game, even as technology made it easier to spot bad calls and increased the pressure on umpires. The pressure came both internally from league officials and externally from TV audiences and fans on social media, to standardize the zone and increase their accuracy.</p>\n<p>The ABS system was created by Hawk-Eye, the company behind automated replay systems in other sports, including out-of-bounds calls in tennis and offside reviews in soccer. Over four seasons of testing in Minor League Baseball, officials collected feedback from players, umpires and fans. Then they made tweaks — first to the strike zone by lowering the height of the automated zone after players reported the system produced a taller zone than they expected.</p> <p>MLB also tried out a \"full ABS\" system in which the system fed umpires the call of every pitch, but players and fans alike reported preferring the challenge system. According to an internal MLB poll conducted last summer with Triple-A players and field staff, only 8 percent preferred the fully automated system, compared to 54% who preferred the challenges and 38% who preferred traditional human umpires.</p>\n<p>\"Throughout this process we have worked on deploying the system in a way that's acceptable to players,\" said Manfred. \"The strong preference from players for the Challenge format over using the technology to call every pitch was a key factor in determining the system we are announcing today.\"</p>\n</div>\n</div></body></html>",
      "author": "Becky Sullivan"
    },
    {
      "title": "When it comes to Tylenol, what are parents to do?",
      "link": "https://www.npr.org/sections/shots-health-news/2025/09/23/nx-s1-5551228/acetaminophen-tylenol-autism-trump-explainer",
      "source": "NPR News",
      "pub_time": "2025-09-23T15:55:20-04:00",
      "description": "The science on Tylenol and autism isn't clear, despite President Trump's claims. Here's what parents need to know to make their own decisions about acetaminophen.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>Headache? Sore back? Bad cold? In the past, many Americans would reach into their medicine cabinets and pull out acetaminophen, known by the brand-name Tylenol, without any concern at all. It's long been a staple of home medicine, seen as a safe way to treat pain and fever in pregnancy as well as in childhood, when used as directed. But President Trump has come out swinging against this common over-the-counter drug, blaming it for rising cases of autism in recent years.</p> <p>\"Don't take Tylenol if you're pregnant, and don't give Tylenol to your child,\" Trump said in a White House briefing, emphatically repeating this warning more than a dozen times. \"Fight like hell not to take it.\"</p>\n<p>Physician groups, plus the maker of Tylenol, immediately pushed back on the president's stance, saying it just wasn't supported by the research — and could have serious repercussions for women and babies.</p> <p>All of this means that many parents and would-be parents, plus others who sometimes take acetaminophen, are suddenly wondering what they should think about this old mainstay of medicine, and whether they truly need to be concerned.</p> <h3 class=\"edTag\">What have research studies actually found?</h3> <p>Researchers have spent years trying to tease out any links between autism and acetaminophen, but the evidence is uncertain, according to the Food and Drug Administration's new warning sent to physicians. It noted that while some studies have found an association between use of this drug and development of autism in children, other studies have come to the opposite conclusion.</p>\n<p>One reason such research is difficult is that parents may not remember, or may misreport, how much of the drug they actually took during pregnancy. That's why researchers were particularly interested in one 2019 study in the journal JAMA Psychiatry that made objective measurements of drug levels in umbilical cord blood in nearly a thousand mother-and-child pairs. It found that children with the highest levels of acetaminophen in their cord blood were roughly three times more likely to be diagnosed with autism or ADHD later on, compared with kids that had the lowest levels in their cord blood. However, the lead researcher was careful to note that the study did not show that the drug <em>caused</em> those disorders — just that there was an association.</p>\n<p>Another influential study, one of the largest and best controlled, was published in 2024, and it analyzed the records of over two million children in Sweden. It initially found a small link between acetaminophen use in pregnancy and autism. But the researchers knew that genes have a powerful effect on autism risk, and they wanted to control for this. Since siblings share genes and also other commonalities such as the same home environment, they did an analysis that compared siblings who had been exposed to acetaminophen with those who had not. And when they did that, the link between autism and acetaminophen disappeared.</p>\n<p>\"In other words, the association was not a causal one, and it was most likely due to other factors like genetics, infections, fevers, that sort of thing,\" Brian Lee of Drexel University, one of the study's authors, said in an interview with NPR's Allison Aubrey.</p> <p>So far, he says, the evidence largely suggests that acetaminophen does not cause autism.</p> <p>\"I wouldn't say that the chapter is closed on this by any means, but certainly the mound of evidence from the best studies to date points to no causal effect of acetaminophen on autism.\"</p> <p>One researcher whose work has suggested that the drug may increase the risk of autism is epidemiologist Ann Bauer of the University of Massachusetts. She told NPR's Jon Hamilton that the \"case is still open\" on acetaminophen. She thinks that while expectant parents should be told about a potential risk, they should also be told there's real uncertainty about that risk.</p> <p>She also thinks it's<strong> t</strong>oo soon for the government to be offering guidance on the use of this drug and how that might be related to autism.</p> <p>\"I think they may be jumping the gun,\" she said. \"I think those of us in the research community would like to see stronger evidence.\"</p>\n<h3 class=\"edTag\">Why not just avoid Tylenol altogether in pregnancy?</h3> <p>President Trump said repeatedly that there was \"no downside\" to not taking acetaminophen and that women should just try to tough it out. But experts in maternal-fetal medicine say that untreated fever is known to be dangerous in pregnancy, and pain is a problem too.</p> <p>The Society for Maternal-Fetal Medicine has pointed out that \"untreated fever, particularly in the first trimester, increases the risk of miscarriage, birth defects, and premature birth.\"</p> <p>Untreated pain, meanwhile, can be linked to depression and high blood pressure. Nicole Baldwin, MD, a pediatrician from Cincinnati, Ohio, told NPR's Allison Aubrey that \"I remember when I was pregnant with my daughter, I had an injury. I fell in mid-pregnancy. And if I hadn't had Tylenol to take, I can't imagine the suffering I would have had for two months.\"</p> <p>\"There are no other medications that these pregnant women can take,\" Baldwin said, as other pain and fever reducing drugs have been proven unsafe in pregnancy. Ibuprofen, for example, has been linked to kidney problems in fetuses.</p> <p>\"Acetaminophen is one of the few options available to pregnant patients to treat pain and fever,\" the American College of Obstetricians and Gynecologists said in a statement following the president's press conference. \"When considering the use of medication in pregnancy, it's important to consider all potential risks along with any benefits.\"</p> <p>And that's basically what the FDA told physicians this week, saying that while \"clinicians should consider minimizing the use of acetaminophen during pregnancy for routine low-grade fevers,\" this had to be balanced with the fact that acetaminophen is the safest over-the-counter option in pregnancy against fever and pain.</p> <h3 class=\"edTag\">Who should parents trust on these issues?</h3> <p>Worried parents might wonder how they're supposed to make decisions when the research community might debate autism and acetaminophen for years to come.</p>\n<p>\"Who has time to sit there and go through the dozens or hundreds of scientific articles on any given topic?\" sympathizes Lee. \"We trust our experts. And if our experts are telling us one thing, but other experts are saying another thing, it causes confusion.\"</p> <p>\"I would say, what parents need to do is to step back and think about who they are hearing the messages from,\" Helen Tager-Flusberg, director of Boston University's Center for Autism Research Excellence, told NPR's Michel Martin. \"Are they going to listen to people who are not physicians, who have no expertise in autism, or are they going to turn to their medical providers, their treatment providers and ask them what their view of the current science is? That's what they should be doing.\"</p> <p>Baldwin, the pediatrician in Cincinnati, likes to explain that any association that's been seen between autism and acetaminophen in studies doesn't necessarily mean there's a causal relationship. Both shark attacks and eating ice cream increase in summer, she says, but that doesn't mean that one causes the other.</p> <p>\"These studies that have been out show correlation, but don't actually show causation,\" says Baldwin.\" \"And I think that's an important thing for parents to realize — that the science is not known just yet, despite what has been said.\"<br/></p>\n</div>\n</div></body></html>",
      "author": "Nell Greenfieldboyce"
    },
    {
      "title": "World health officials reject Trump's claims that Tylenol is linked to autism",
      "link": "https://www.npr.org/2025/09/23/g-s1-90068/world-health-officials-reject-trumps-claims-that-tylenol-is-linked-to-autism",
      "source": "NPR News",
      "pub_time": "2025-09-23T14:48:44-04:00",
      "description": "The President says pregnant women should stay away from Tylenol due to possible autism link. World health authorities strongly disagree, say the drug is safe in pregnancy.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>Health officials around the globe are rejecting President Trump's assertion that pregnant women should avoid taking acetaminophen, the active ingredient in Tylenol, during pregnancy because of unfounded links to autism.</p> <p>\"Available evidence has found no link between the use of paracetamol during pregnancy and autism,\"  the European Medicines Agency, Europe's top drug regulator, said in a statement. Paracetamol is a widely used name for acetaminophen outside the U.S.</p> <p>The European drug regulator re-iterated its guidance on Tuesday that drugs with paracetamol should be used as necessary to treat pain and fever, adding that \"Paracetamol remains an important option to treat pain or fever in pregnant women.\"</p>\n<p>In a White House press conference Monday, President Trump repeatedly pointed to research suggesting exposure to the common painkiller in utero was linked with later diagnoses of autism.</p> <p>World Health Organization spokesperson Tarik Jašarević pushed back against that claim during a press briefing in Geneva.</p> <p>\"There were some observational studies that have suggested a possible association between prenatal exposure to acetaminophen, but the evidence remains inconsistent,\" he said. \"Several studies done after that have found no such relationship. So this lack of replicability calls for caution in drawing causal conclusions about the role of acetaminophen in autism.\"</p> <p>President Trump also suggested on Monday that vaccines and their frequency were responsible for an increase in autism rates. </p> <p>\"They pump so much stuff into those beautiful little babies, it's a disgrace,\" he said.</p> <p>Jašarević rejected that claim, too. </p> <p>\"We know that vaccines do not cause autism,\" he said. \"Vaccines save countless lives. This is something that science has proven, and these things should not be really questioned.\"</p> <p>Health officials from several other countries followed suit with their own statements.</p> <p>\"Don't pay any attention whatsoever to what Donald Trump says about medicine,\"  Wes Streeting, the U.K. health secretary, said in an interview with ITV's Lorraine program. \"I've just got to be really clear about this: there is no evidence to link the use of paracetamol by pregnant women to autism in their children. None.\"</p>\n<p>Acetaminophen is one of the few options available to pregnant patients seeking treatment for fever and pain. </p> <p>\"Untreated pain and fever can pose risks to the unborn baby,\"  Alison Cave, chief safety officer at the MHRA, the U.K.'s top drug regulator, said in a statement. \"It is important to manage these symptoms with the recommended treatment.\"</p> <p>In Australia, that country's chief medical officer and its drug regulator, TGA, wrote in a statement that they \"join with other global medicines regulators, leading clinicians and scientists worldwide in rejecting claims regarding the use of paracetamol in pregnancy, and the subsequent risk of development of autism in children.\"</p> <p>Mónica García Gómez, Spain's health minister, accused President Trump of ignoring medical science. In a post on X, she said \"Denialism not only destroys trust in science: it puts lives at risk.\"<br/></p>\n</div>\n</div></body></html>",
      "author": "Jonathan Lambert"
    },
    {
      "title": "Jury convicts Ryan Routh on all charges in attempted assassination of Donald Trump",
      "link": "https://www.npr.org/2025/09/23/nx-s1-5551072/ryan-routh-convicted-attempted-trump-assassination",
      "source": "NPR News",
      "pub_time": "2025-09-23T14:43:17-04:00",
      "description": "Jurors convicted Routh on five charges, including last year's attempted assassination of Trump as he golfed at his South Florida course. Routh represented himself in court and faces life in prison.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>FORT PIERCE, Fla. — A federal jury determined Ryan Routh was guilty Tuesday of the attempted assassination of Donald Trump last year at his South Florida golf course.</p>\n<p>Jurors convicted him on all five counts, including attempted assassination and weapons violations. Even though the rifle was never fired that day, federal lawyers say Routh had \"intent\" and made a \"substantial step in the alleged attempt.\" He faces up to life in prison when he's sentenced on December 18.</p> <p>After the guilty verdicts were read but before jurors had departed, Routh attempted to stab himself in the neck with a pen. But several U.S. Marshals quickly subdued him. Routh's daughter, Sara, who was in the courtroom,  began shouting, \"Dad, I love you. Don't do anything.\" She yelled a few expletives and continued, \"He didn't hurt anybody. This is not fair,\" she said.</p>\n<p>Federal prosecutors rested their case last Friday after spending a total of seven days presenting 38 witnesses. They detailed what they say was Routh's planned attack against the then-GOP presidential candidate as he golfed at his West Palm Beach club on September 15, 2024.</p>\n<p>\"This verdict sends a clear message. An attempt to assassinate a presidential candidate is an attack on our Republic and on the rights of every citizen,\" said Deputy U.S. Attorney General Todd Blanche in a statement. \"The Department of Justice will relentlessly pursue those who try to silence political voices, and no enemy, foreign or domestic, will ever silence the will of the American people.\"</p> <p>President Trump spoke after the guilty verdict and said, \"You can't let things like that happen — nothing to do with me, but a president, or even a person — you can't allow that to happen. And so justice was served.\"</p> <p>The verdict came after a trial that took two-and-a-half weeks, proceeding quicker than prosecutors and U.S. District Judge Aileen Cannon anticipated. The main reason was that Routh, acting as his own attorney, spent relatively little time cross-examining prosecution witnesses and called just three people to testify in his defense.</p> <p>His defense, which took just a few hours, came after a prosecution case that lasted seven days and called 38 witnesses.</p>\n<p>Judge Cannon cautioned Routh as he prepared to deliver his closing argument Tuesday that he would have to restrict his remarks to evidence introduced at the trial. But he repeatedly flouted those judicial guidelines, prompting objections from the prosecution and a warning from the judge.</p> <p>Routh tried to explain to the jury why he offered such a limited defense. He said he wanted to subpoena twenty witnesses and introduce 500 exhibits, but rulings by the court prevented that. That led Judge Cannon to temporarily halt the proceedings and issue Routh a stern warning.</p> <p>In his closing, Routh told the jury the case was about \"intent and whether someone can actually pull the trigger and take someone's life.\" Acting as his own lawyer and referring to himself as \"the defendant,\" Routh suggested to jurors that he had actually planned an attempt on Trump's life while the then-presidential candidate was golfing on the 5th hole, 375 yards from the sniper's hiding place. \"The opportunity was there and the trigger was not pulled, \"he said. \"The crime was not committed.\"</p> \n<p>Routh said he wasn't capable of taking someone's life. \"Mere planning of something is not intent,\" he said. \"It is only a dream, a fantasy,\" one he never intended to execute.</p> <p>In his closing, prosecutor Christopher Browne methodically walked jurors through the trove of evidence of what he said were Routh's plans to assassinate Trump. On the question of Routh's intent, Browne said, \"Why did he take these actions? Why did he load this rifle if his intent was not to kill?\" In the rebuttal, prosecutor John Shipley reminded the jury that no one needs to be shot and no weapon needs to be fired for a charge of attempted assassination of a major presidential candidate.</p> <p>In his opening, Shipley told jurors Routh wanted to ensure that voters would not be able to elect Donald Trump as president in 2024. \"The defendant decided to take the choice away from the American voters,\" he said. The plot Routh is charged with, he said, \"was carefully crafted and deadly serious.\"</p>\n<p>Former Secret Service agent Robert Fercano, now with the Department of Homeland Security, said he foiled Routh's alleged attempt to shoot Trump. Fercano testified about his encounter with a man he first saw as a \"face in the bushes\" as Trump was golfing.</p> <p>As he scanned the 6th hole of the golf course, ahead of where Trump was playing, he told the court, \"I encountered what appeared to be the face of an individual (and) the barrel of a weapon protruding from the fence line.\"</p> <p>Fercano testified he got off his golf cart and said, \"Hey sir!\" At first, he said, he thought he was possibly encountering a homeless person and there wasn't an imminent threat. In response, he said, \"I heard what appeared to be a groan and the subject smiled at me.\"</p> \n<p>At about the same time, Fercano told jurors he saw a gun barrel protruding from the fence line, which moved toward him as he backed away. He says he also noticed ballistic \"bulletproof vest\" plates positioned on the fence. Fercano, an ex-Marine and trained marksman, said, \"This appeared to be a textbook ambush scenario.\"</p> <p>Another prosecution witness, FBI Supervisory Special Agent Kimberly McGreevy spent hours on the stand over two days. She detailed evidence that tracked Routh's activities a month prior to the attempted shooting.</p> <p>McGreevy drew on data from Routh's cell phones — he had six of them — and surveillance camera video to track his movements. The agent testified that the accused moved between Mar-a-Lago, Trump's golf club, the airport where the president keeps his plane and a truck stop where Routh was living in his SUV.</p> <p>The FBI agent said that during that time, \"He was living at that truck stop, conducting physical and electronic surveillance … and stalking the former president.\"</p> <p>McGreevy also detailed Routh's alleged purchase of the SKS-style rifle seized at the golf course by federal agents and his attempt to buy a more powerful weapon.</p>\n<p>According to McGreevy's testimony, Routh sent a text to his girlfriend in Hawaii, asking, \"How many bullets does an SKS rifle hold? An AK-47 can shoot to 500 meters. I have to get to 400.\"</p> <p>Judge Cannon agreed to allow Routh to represent himself in the trial after hearings and motions in which he said he was unhappy with his court-appointed lawyers.</p> <p>In his defense, he called two character witnesses (who discussed examples of what Routh said were his \"peacefulness, gentleness and non-violence\") and a gun expert. Michael McClay, an ex-Marine sniper, was presented to discuss a sniper's tactics and positioning.</p> <p>McClay said that when he test-fired the SKS-style rifle left at the scene several months after Routh's arrest, it malfunctioned. The gun fired — but the second round in the magazine repeatedly jammed. Prosecutors attributed that to the effects of acid used by investigators to recover the gun's obliterated serial numbers.</p> <p>Other testimony from McClay was less helpful to Routh's defense. The ex-Marine sniper visited the golf course and surveyed the area around the 6th hole where prosecutors say, \"a sniper's hide\" was set up just outside the fence. McClay told the court it offered what he called \"a clear shot\" to the 6th hole where Trump was soon to arrive.</p> <p>Routh then asked about whether the gun would be effective firing at the 5th hole, where Trump was golfing at the time, an area much farther away. \"Depending on the skill of the shooter,\" McClay said, \"yes.\"</p> <p>Before his arrest, Routh already had a criminal record, including a 2002 conviction in North Carolina for possessing an explosive device. He spent much of his life in North Carolina before moving to Hawaii. He was a strong supporter of Ukraine following the invasion by Russian troops. He has said he backed Trump for president in 2016 and regrets that decision.</p>\n<p>The attempt on Trump's life was the second that year — following a shooting during a campaign rally in Butler, Pa. in July 2024. A gunman, perched on a building rooftop, fired as Trump spoke to supporters. Trump's ear was struck, and an attendee died. The gunman, 20-year-old Thomas Crooks, was killed by a Secret Service sniper.</p>\n</div>\n</div></body></html>",
      "author": "Greg Allen"
    },
    {
      "title": "You can now experience Björk's heartbreak in VR",
      "link": "https://www.npr.org/2025/09/23/nx-s1-5543338/bjork-vr-vulnicura-remastered",
      "source": "NPR News",
      "pub_time": "2025-09-23T14:28:59-04:00",
      "description": "<em>Vulnicura VR Remastered</em> revisits a project the Icelandic pop artist debuted a decade ago, now reimagined with advanced technology.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>Björk's 2015 album <em>Vulnicura</em> tells the story of the Icelandic pop artist's emotional journey following a painful breakup with her then-longtime partner, American artist Matthew Barney.</p> <p>\"I realized that I'd written a whole heartbreak album,\" said Björk in an exclusive interview with NPR. \"And it's like a bit of a tricky genre to tap into.\"</p> <p>Björk said VR seemed like the ideal medium beyond the album to share her heartbreak at the time. \"What most people were complaining about with VR is it was very isolating,\" Björk said. \"And I was like, 'Wow. Perfect. It's gonna be good in this lonely, solitary journey.'\"</p>\n<p>A newly remastered version of <em>Vulnicura VR</em> available on the Apple Vision Pro headset (and soon Meta Quest; the release date is still pending) enables fans to experience this journey alongside Björk.</p> <p>When the album opens, the user finds themselves navigating across an austere Icelandic landscape of imposing mountains, leaden skies and minutely-detailed moss. At one point, Björk dissolves into a shower of tiny particles. At another, the user can reach out and grab long threads to stitch together Björk's broken heart.</p> \n<p>Created by the San Francisco-based VR music company PulseJet Studios, the new version updates a project the artist first created about a decade ago, back when the technology was in a very different place.</p> <p>When Björk first released parts of <em>Vulnicura VR</em>, consumer VR was the hot new thing. HTC and Oculus came out with groundbreaking headsets. Online app stores touted new immersive video content. Filmmakers were gaining attention for cutting-edge films that exploited the intimacy and immersive properties of the medium, such as Matthew Cooke's short VR offering <em>Confinement</em>, about solitary confinement in U.S. prisons.</p>\n<p>But the technology was limited, and the many artists working on Björk's ambitious project faced these limitations head on – even though the work was in many ways groundbreaking. \"Björk really took advantage of the intimacy of the medium,\"said Los Angeles-based filmmaker Andrew Thomas Huang, who has been involved with <em>Vulnicura VR</em> since its earliest days. \"But it was very DIY.\"</p> <p>The original project was conceived iteratively as part of <em>Björk Digital</em>, an exhibition about Björk's career that ran from 2016-2020 at various museums around the world such as New York's Museum of Modern Art and the Miraikan in Tokyo. Huang said Björk collaborated with a bunch of different artists and assorted technologies on creating immersive video versions of some of the <em>Vulnicura</em> album's songs for these installations. As such, the initial versions of <em>Vulnicura VR</em> could only be viewed by museum visitors. They had to be tethered to computers and carry unwieldy controls in their hands. \"It was very clunky,\" Huang said. \"And sometimes the computers wouldn't work.\"</p> \n<p>In 2019, Björk released a version of <em>Vulnicura VR</em> for Steam-accessible headsets. This widened the audience for the work. But it had some of the same limitations as the museum versions, such as the need for computers and hand controls. \"We saw a big opportunity to improve graphics and navigation with new technology and the new all-in-one headsets,\" said PulseJet Studios founder John Gearty. \"The 2019 version still runs, but this one is a lot easier to get around.\"</p>\n<p>With the newly remastered iteration for the \"all-in-one\" headset, users can roam freely and use their bare hands to explore Björk's world. The navigation between the songs is more intuitive, and the visual effects, sharper. The spatial audio has been enhanced, too. \"We painstakingly developed moss and rocks and flowers,\" said Gearty, of working on the new version.</p> \n<p>Gearty said he hopes more musicians will take Björk's lead and explore VR's artistic potential beyond the immersive concert experiences offered lately by artists like Sabrina Carpenter and bands such as Metallica.</p> <p>\"This isn't just TV,\" said Gearty. \"We are pretty committed to thinking about the entire experience differently and surrounding the user with an artistic vision you can't see every day.\"</p>\n<p>Björk's project arrives in its remastered version at an inflection point for the VR industry. A recent report from the market intelligence company International Data Corporation (IDC) forecasts a compound annual growth rate of nearly 40% between this year and 2029. At the same time, more than half of the game developers who participated in a recent survey about VR said the industry is stagnating.</p> <p>\"I continue to believe VR has tremendous creative potential, particularly with regard to live performance,\" said Charlie Fink, a producer, podcaster, author, and Chapman University lecturer in the immersive technology space. \"That said, VR has not achieved the commercial success everyone thought was possible ten years ago.\"</p> <p>For her part, Björk said she's interested to see where artists take the medium in the future, and she's delighted that the new version of <em>Vulnicura VR</em> can now reach many more people. \"I have always liked the democracy feeling about music,\" she said.</p>\n</div>\n</div></body></html>",
      "author": "Chloe Veltman"
    },
    {
      "title": "Trump cancels meeting with Democrats as prospects for shutdown increase",
      "link": "https://www.npr.org/2025/09/23/g-s1-90051/trump-shutdown-democrats",
      "source": "NPR News",
      "pub_time": "2025-09-23T12:30:23-04:00",
      "description": "President Trump called off a planned Thursday meeting with top Hill Democrats to discuss a possible deal to avoid a shutdown. He called Democrats' demands \"unserious.\" Democrats say he chickened out.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p>President Trump abruptly cancelled a planned Thursday meeting at the White House with top congressional Democratic leaders, increasing the chances of a government shutdown on Oct. 1.</p> <p>Shortly after Senate Minority Leader Chuck Schumer and House Minority Leader Hakeem Jeffries claimed victory in a joint statement for securing the meeting on Tuesday morning, the president posted on his social media platform that he was calling it off.</p>\n<p>\"After reviewing the details of the unserious and ridiculous demands being made by the Minority Radical Left Democrats in return for their Votes to keep our thriving Country open, I have decided that no meeting with their Congressional Leaders could possibly be productive,\" the president wrote.</p> <p>He argued that the items in the Democrats' alternative funding proposal like rolling back the Medicaid changes enacted in the president's signature tax bill and extending Affordable Care Act tax credits were nonstarters. \"There are consequences to losing Elections but, based on their letter to me, the Democrats haven't figured that out yet,\" Trump wrote.</p>\n<p>Jeffries shot back his own response on social media saying \"Trump Always Chickens Out,\" a reference to the \"TACO\" slogan that some popularized around the president's shifting positions on imposing tariffs.</p> <p>\"Our position is not complicated: cancel the cuts, lower the costs, save health care,\" Jeffries added at a press conference on Tuesday in New York.</p> <p>As a sign the messaging war is only starting about who is to blame in the event of a shutdown next week, Jeffries added, \"the extremists want to shut down the government because they are unwilling to address the Republican healthcare crisis that is devastating America.\"</p> <p>Schumer said in a statement that the president was \"running away from the negotiating table before he even gets there.\" He said the president would \"rather throw a tantrum than do his job.\"</p>\n<p>Schumer argued, \"Trump and Republicans are holding America hostage. Donald Trump will own the shutdown.\"</p> <p>On Friday the House narrowly approved a bill extending current funding levels through Nov. 21, but the Senate did not have the 60 votes needed to advance it. An alternative proposal from Democrats also failed. Both chambers are on recess this week, and Senate Majority Leader John Thune indicated he will bring up a straight extension of funding levels on Sept. 29. House leaders cancelled planned votes for next Monday and Tuesday and the chamber isn't scheduled to return until late next week.</p>\n<p>GOP leaders insist Democrats would bear the blame if there is any interruption in funding, and have dubbed the dynamic \"the Schumer shutdown.\"</p> <p>In a letter to House Democrats, Jeffries said he would hold a virtual meeting with members on Friday afternoon to talk about the next steps. He noted that House GOP leaders change the schedule for next week but that he scheduled a caucus meeting for all House Democrats on Monday evening. \"Democrats will be in town and prepared to get the job done.\"</p>\n</div>\n</div></body></html>",
      "author": "Deirdre Walsh"
    },
    {
      "title": "After fireworks caused her dog to panic, a stranger offered them a ride home",
      "link": "https://www.npr.org/2025/09/23/nx-s1-5549135/fireworks-stranger-dog-unsung-hero",
      "source": "NPR News",
      "pub_time": "2025-09-23T12:01:29-04:00",
      "description": "Lara Friedman was walking her large rottweiler on July 4 when fireworks went off. Her dog went into panic mode. Then a stranger offered to help, ensuring both got home safely.",
      "content": "<html><body><div><div class=\"storytext storylocation linkLocation\" id=\"storytext\">\n\n<p><em>This story is part of the My Unsung Hero series, from the Hidden Brain team. It features stories of people whose kindness left a lasting impression on someone else.</em></p> <p>In late 2020, Lara Friedman and her partner adopted a 9-week-old Rottweiler puppy. They affectionately named him The Dude.</p> <p>\"[It became] immediately clear he [was] sweet, playful, snuggly, protective and a total goofball,\" Friedman said.</p>\n<p>Because they didn't have a backyard, the family developed a routine of walking The Dude four times a day.</p> <p>\"If he [had] his way [we would] stop and say hello to everyone on his route, especially kids,\" Friedman said. \"And he takes very seriously his responsibility to sing along with ambulance and fire engine sirens.\"</p> <p>Friedman and The Dude were out on one of these walks in July. It was their last stroll of the evening, around 9:30 p.m.. Suddenly, fireworks started going off overhead.</p>\n<p>\"They were right on top of us. You could smell them,\" Friedman recalled. \"The Dude flipped out. He went into total panic mode.\"</p> <p>It had rained earlier that evening and the sidewalks were slippery. Friedman weighs about 135 pounds. The Dude weighs 120 pounds. It quickly became clear that The Dude was likely going to drag her down the street, putting both of them into a dangerous situation.</p>\n<p>\"I'm standing [there] ... just frozen and the fireworks keep going off. And I realized there is no way I can get the two of us home safely,\" Friedman said.</p> <p>Just then, a stranger walked past. When he noticed The Dude's panic, he stopped and tried to comfort the dog. Uncharacteristically, Friedman began to cry.</p> <p>The man, whom Friedman believes introduced himself as Blake, asked her if she was OK.</p> <p>\"'I said, 'I can't get him home safely,'\" Friedman recalled. \"And he said, 'Would it help if I walked you home? I can try to help control him.'\"</p> <p>\"And I said, 'I feel weird saying this, but yes, that would be helpful.'\"</p> <p>Blake went into his house and came back with another man named Bubba. Together, the three of them tried to wrangle The Dude down the sidewalk. But it didn't work.</p>\n<p>So, Blake suggested he drive Friedman and The Dude home. Overwhelmed and out of options, Friedman gratefully accepted the offer. As Blake drove the car over, Bubba helped Friedman hold The Dude, as fireworks continued to go off above them.</p>\n<p>The Dude was terrified, but as soon as they opened the car's back door, he ran over and hopped in. Blake drove them home.</p> <p>Friedman will never forget the kindness Blake and Bubba showed to her and The Dude that evening.</p> <p>\"I don't know how that night would've turned out without these two angels, who came to my rescue and to The Dude's rescue. But I am so grateful and we will absolutely be paying this forward.\"</p>\n</div>\n</div></body></html>",
      "author": "Autumn Barnes"
    }
  ]
}